{
  "paperid": "1804.05399v2",
  "title": "Geometric Speed Limit of Accessible Many-Body State Preparation",
  "authors": [
    "Marin Bukov",
    "Dries Sels",
    "Anatoli Polkovnikov",
    "A Michael",
    "Isaac Nielsen",
    "Matthieu Mark G Bason",
    "Nicola Viteau",
    "Paul Malossi",
    "Ennio Huillery"
  ],
  "year": 2019,
  "abstract": "We analyze state preparation within a restricted space of local control parameters between adiabatically connected states of control Hamiltonians. We formulate a conjecture that the time integral of energy fluctuations over the protocol duration is bounded from below by the geodesic length set by the quantum geometric tensor. The conjecture implies a geometric lower bound for the quantum speed limit (QSL). We prove the conjecture for arbitrary, sufficiently slow protocols using adiabatic perturbation theory and show that the bound is saturated by geodesic protocols, which keep the energy variance constant along the trajectory. Our conjecture implies that any optimal unit-fidelity protocol, even those that drive the system far from equilibrium, are fundamentally constrained by the quantum geometry of adiabatic evolution. When the control space includes all possible couplings, spanning the full Hilbert space, we recover the well-known Mandelstam-Tamm bound. However, using only accessible local controls to anneal in complex models such as glasses or to target individual excited states in quantum chaotic systems, the geometric bound for the quantum speed limit can be exponentially large in the system size due to a diverging geodesic length. We validate our conjecture both analytically by constructing counter-diabatic and fast-forward protocols for a three-level system, and numerically in nonintegrable spin chains and a nonlocal SYK model.",
  "sections": [
    {
      "heading": "I. INTRODUCTION",
      "text": "The Quantum Speed Limit (QSL) is the minimum time, T QSL , required to prepare a quantum state with unit fidelity. Understanding the physics behind it is anticipated to lead to significant advances in the field of quantum computing [1], which is based to a large extent on the ability to reliably manipulate the population of quantum states. The quantum speed limit is also of prime importance for experimental quantum emulators, such as cold atoms [2][3][4], trapped ions [5][6][7], and superconducting qubits [8], which require preparing quantum states with high fidelity before they can be studied. The origin of its physical meaning is rooted deeply in the Heisenberg energy-time uncertainty principle [9], which implies that the time over which a quantum process occurs is intimately tied to the energy uncertainty ∆E it leads to. This was recognised by Mandelstam and Tamm [10][11][12][13], who used it to introduce the lower bound T QSL ≥ π/(2∆E). In recent years quantum speed limits have been studied ever more extensively, and various improved bounds and alternative derivations have been proposed [14][15][16][17][18][19], including generalizations to mixed states [20] and open systems [21]. In particular, it has been noticed that the bound can be sharpened by the absolute geodesic length L = arccos | ψ i |ψ * | [22], leading to * mgbukov@berkeley.edu for an initial state |ψ i and a target state |ψ * . Unfortunately, this bound is of limited practical use in quantum many-body systems, where ∆E ∼ √ L scales with the system size L, and hence in the thermodynamic limit the bound becomes trivially T QSL ≥ 0, misleadingly suggesting that it is possible to prepare any many-body state in no time. It is not hard to see that this issue arises due to the lack of constraints on the allowed terms in the Hamiltonian used to prepare the target state [23]. In other words, since the bounds are based on generic geometric arguments, they must hold for any Hamiltonian. However, if one can fine tune the Hamiltonian arbitrarily, the quantum brachistochrone problem becomes almost trivial to solve [24]. In fact, the bound is tight, because the equality holds when the Hamiltonian is unconstrained: performing H * = i(|ψ * ψ i | -|ψ i ψ * |)/ √ 2, effectively realizes the σ y Pauli operator between the initial and the target states, saturating the bound. While this is admittedly not a problem in simple setups, such as a two-level system, where the control space is sufficiently small, it quickly becomes the bottleneck for many-body Hamiltonians, in which the realization of nonlocal terms like H * requires access to exponentially many couplings, and exponential sensitivity to fine-tune them. Indeed, realizable protocols only control local physical couplings and require much longer times, such that the bound (1) becomes useless. It does not tell us anything about how it is to prepare the target state. Let us illustrate this point explicitly. Consider a system of L noninteracting qubits, prepared in some product initial state |ψ i = | ↓ • • • ↓ and subject to a Hamiltonian H = i H i . We want to transfer the population into the target product state |ψ * = | ↑ • • • ↑ ."
    },
    {
      "heading": "arXiv:1804.05399v2 [quant-ph] 20 Feb 2019",
      "text": "On the single-qubit level, it is optimal to do a π-pulse around the y-(or x-) axis, i.e. H i = ∆σ y i , such that T (L=1) QSL = π/(2∆). Clearly, the existence of L independent qubits does not make the process any faster. On the other hand, the energy fluctuations in the total system are ∆E = ∆ √ L, so the expression (1) suggests that it would be possible to rotate the spins faster. This fallacious argument shows how the standard quantum speed limit bounds are based on the premise that one can access the full Hilbert space to construct the optimal driving Hamiltonian. In the present example, this bound will be achievable only if one can realize the Hamiltonian √ 2 which transfers the population from the initial into the target state by rotating it into a macroscopic Schrödinger cat (GHZ) state at intermediate times. In experiments, where one only has local control over the system, one simply cannot implement this evolution. Moreover, in more complex interacting setups the structure of the target state itself is very complicated so H * will not only be non-local but exponentially complex. One intuitively expects that T (L) QSL should generically increase with L as it is usually much harder to prepare many-body states with a good fidelity, especially in complex systems. Quantum state preparation has enjoyed renewed attention from the theoretical community in the last decade. Analytically, ideas known as Shortcuts to Adiabaticity have been put forward, developing the concepts of counter-diabatic (CD) and fast-forward (FF) driving protocols [25][26][27][28][29][30][31][32][33][34][35][36][37][38][39][40][41][42][43]. counter-diabatic driving studies the engineering of time-dependent counter-diabatic Hamiltonians, which generate transitionless time evolution [in the instantaneous basis of the original Hamiltonian] far away from the adiabatic limit. Also away from the adiabatic limit but allowing to create excitations during the evolution, fast-forward Hamiltonians are designed to steer the system into the target state in a fixed amount of time. In the mean time, numerically, the state preparation paradigm has been formulated as an optimisation problem [44][45][46][47][48][49][50][51][52]. Recently, stochastic descent, gradientbased GRAPE [53] and CRAB [54], and model-free Machine Learning [48,[55][56][57][58][59][60][61][62][63][64][65][66] have proven useful algorithms to find approximate fast-forward Hamiltonians in singleparticle and many-body systems. In this work, we formulate a conjecture and give numerical and analytical evidence supporting the validity of a new, geometric lower bound on the quantum speed limit (cf. Eq. ( 2), (6) below). This bound implies that the quantum speed limit is controlled by the geodesic length between the initial and the target state in the eigenstate manifold set by the control parameter space. Based on this conjecture, we show that the adiabatic limit and the associated quantum geometry [35] constrain the time of possible unit-fidelity protocols both in single-particle and complex many-body systems. From our conjecture it also follows that the quantum speed limit for all protocols is bounded by the quantum speed limit for counter-diabatic protocols, which generally cannot be implemented within the constrained control parameter space, but for which the geodesic bound can be rigorously proven using recent results from Ref. [67]."
    },
    {
      "heading": "II. GEOMETRIC BOUND CONJECTURE",
      "text": "Consider a system described by the Hamiltonian H(λ), where λ is the control parameter which couples to a local operator. To simplify the discussion we assume that the control parameter has a single component [68]. At time t = 0 we prepare the ground state (GS) |ψ(t = 0) = |ψ 0 (λ i ) . We want to transfer the population with unit probability over a finite time span T from this initial state into a target state |ψ(t = T ) = |ψ 0 (λ * ) , which (up to an overall phase) is the ground state of H(λ * ) [69]. In order to implement such a protocol we only allow Hamiltonians of the form H(t) ≡ H(λ(t)), which depend on time solely through the control function λ(t). Such constrained Hamiltonians, if they prepare the target state with unit fidelity, are called fast-forward Hamiltonians: H FF (t) ≡ H FF (λ((t)) [70]. Whenever preparing the target state with unit probability (or unit fidelity) is possible, the system is called controllable. By the adiabatic theorem, for any nondegenerate Hamiltonian H(λ) the problem becomes asymptotically controllable in the limit T → ∞. Notice that, in general, there may exist multiple protocols which yield unit fidelity. Any unit-fidelity protocol obtained using Optimal Control methods gives rise by definition to a fast-forward Hamiltonian. Conjecture.-Let us formulate the following conjecture: for any fast-forward Hamiltonian H FF (λ(t)) the energy fluctuations, averaged over the protocol duration, are larger than the geodesic length ℓ λ : where the parameter λ changes along a fixed unit-fidelity protocol in an arbitrary way. Note that we define the geodesic length ℓ λ within the control space; it is generally larger than the distance between wavefunctions (i.e. the absolute geodesic). In particular, for extensive systems with L degrees of freedom and local controls, the RHS of Eq. ( 2) typically scales as √ L while the distance between wavefunctions is always bounded from above by π/2. Further, in Eq. ( 2), are the energy variance δE 2 F F (t), which can be thought of as the time-time component of the geometric tensor δE 2 F F (t) = g tt , and the eigenstate Fubini-Study metric tensor, g λλ , respectively. Here |ψ 0 (λ) is the instantaneous ground state of H(λ), and A λ is the adiabatic gauge potential [35]. The ket |ψ(t) denotes the time-evolved initial state under the Hamiltonian H FF (t), which satisfies the boundary conditions |ψ(0) = |ψ 0 (λ i ) and |ψ(T ) = |ψ 0 (λ * ) . We emphasize the difference between the evolved and the instantaneous states: |ψ(t) = |ψ 0 (λ(t)) . The subscript c denotes the connected expectation value: To motivate the conjecture, notice that this bound is tight and can be saturated in the adiabatic limit. Indeed, from Adiabatic Perturbation Theory (APT) it follows that [35,71] Hence, for any monotonic λ(t) the bound (2) is saturated in the adiabatic limit. Moreover, it is easy to see that at least for any real-valued Hamiltonian, satisfying instantaneous time-reversal symmetry, the next-order correction to Eq. ( 4) scales as λ4 with a non-negative pre-factor, such that g tt -λ2 g λλ ≥ 0. This fact follows immediately from the structure of APT where all the coefficients in the expansion of the wave function in the instantaneous basis in powers of λ are imaginary in linear order, and real-valued in quadratic order [see Eq. ( 12) in Ref. [72]]: where |ψ 0 , |ψ (1) and |ψ (2) are real-valued functions. This observation, in turn, implies that there is no interference between the λ and λ2 contributions to the energy variance. In particular there is no λ3 contribution, and hence the quadratic and quartic terms above come from squares and are non-negative: Therefore, at least perturbatively, the bound is satisfied for any sufficiently slow protocol. We note that within APT, the λ4 contribution is treated on the same footing as the squared acceleration term λ2 because d t ( λ) = λ∂ λ ( λ) ∼ λ2 . Indeed the linear in acceleration correction to the wave function also becomes imaginary [35,72]. Even though we formulated the bound for fast-forward Hamiltonians, the conjecture is intimately related to CD driving protocols. In a recent work Funo et al. derived that, for any counter-diabatic protocol with monotonic λ(t) the inequality Eq. ( 2) is always saturated [67]. This can be seen as follows: using the counter-diabatic Hamiltonian, the system follows the instantaneous ground state of H(λ): |ψ(t) = |ψ 0 (λ(t) . Then evaluating the variance of H CD one can convince oneself that the only non-zero contribution comes from the gauge potential term: and hence g tt = λ2 g λλ . This leads to the interesting observation that the leading non-adiabatic contribution to the energy variance without CD driving, is identical to the energy variance coming from the gauge potential in the CD protocols. However, a major difference is that for counter-diabatic protocols this result applies to arbitrarily fast protocols where APT does not hold. We point out that CD protocols usually requ"
    },
    {
      "heading": "III. ANALYTICAL VERIFICATION OF THE GEOMETRIC BOUND CONJECTURE",
      "text": "In this section we consider two exactly-solvable examples to analytically verify the validity of the conjecture. To this end, we first show how one can use counter-diabatic driving to find a fast-forward Hamiltonian. The first example will be a two-level system for which the conjecture reduces to the original Mandelstam-Tamm bound. We nevertheless want to show the proof as it highlights how going from a counter-diabatic to a fast-forward protocol increases the time length and hence the QSL. The second example is a three-level system, where the conjecture becomes much less trivial and gives a larger value of quantum speed limit than the Mandelstam-Tamm bound."
    },
    {
      "heading": "A. Two-Level System",
      "text": "Consider first the prototypical model of a two-level system (2LS) governed by the following Hamiltonian: where g is a fixed magnetic field along the z-axis and λ(t) is an a priori unknown optimal protocol. We prepare the system in the ground state |ψ i of H 2LS (λ i = -2g) and seek a function λ(t) which targets the ground state |ψ * at λ * = +2g in time T , following unitary evolution under H 2LS (t). State preparation in this model has been discussed extensively in the context of various approaches, and analytical expressions for the optimal protocols have been derived [76]. As we mentioned we will use this example to highlight connections between counter-diabatic and fast-forward protocols. Before we dive into this analysis, notice a quick but curious fact: the initial and target states are related by the rotation |ψ * = exp(-iπS z )|ψ i . Hence, the static Hamiltonian H FF (t) = -gS z is a legitimate fast-forward Hamiltonian for T = π (with λ(t) ≡ 0). Let us compute the left-hand side (LHS) and the right-hand side (RHS) in Eq. ( 2) separately. On the RHS, note that the geodesic length is ℓ λ = θ, where tan θ = λ i /g. On the LHS, on the other hand, we have ψ(t)|(S z ) 2 |ψ(t) = 1/4 and ψ(t)|S z |ψ(t) = cos(θ)/2, and hence ℓ t = sin(θ)/2. Therefore, the inequality (2) yields π sin θ ≥ 2θ, which is indeed always true for θ < π/2, and hence the conjecture holds true for this special case. The counter-diabatic protocol amounts to adding an extra (counter) term to the Hamiltonian which keeps it in the instantaneous ground state [26,29,31,33,35]: is the (adiabatic) gauge potential with respect to the parameter λ (see e.g. Ref. [35] for details). However, the counter-diabatic protocol kicks the Hamiltonian out of the original control space by adding a magnetic field along y-direction. In order to map the counter-diabatic protocol to a valid fast-forward protocol, we need to perform an additional unitary rotation, as was first discussed in Ref. [30]: (10) where R(t) is a unitary change-of-frame matrix, which is equal to the identity in the beginning and in the end of the protocol: R(0) = 1 = R(T ). In this case it is easy to see that the wave function |ψ(t) follows the ground state of a gauge equivalent Hamiltonian Therefore |ψ(t) coincides with the initial and target states in the beginning and in the end of the protocol. Let us now take the extreme case of the fastest counterdiabatic protocol λ → ∞, where the counter-diabatic Hamiltonian reduces to the rate times the gauge potential (the calculation away from the infinite-speed limit is shown in App. A): For the unitary R(t) we can choose where Θ(t) is the Heaviside step function. This transformation rotates S y to S z . Note that R(t) is constant except at t = 0, T giving rise to the pulse-like contributions from R † (t)∂ t R(t) to the fast-forward Hamiltonian: with δ(t) = ∂ t Θ(t) the Dirac delta function. Finally, to make the z-magnetic field time independent, we can rescale the time according to Then, using that δ(t) = δ(t )|dt /dt|, we find The total protocol time T ≡ T QSL , which sets the quantum speed limit in this case [76], can be found as Let us now check the conjecture for this quantum speed limit protocol. To evaluate the LHS of Eq. ( 2), notice first that both δ-function kicks can be interpreted as a free rotation under the Hamiltonian H = S x for the time π/2. Second, for a (piecewise) constant Hamiltonian the energy variance is (piecewise) conserved. Therefore, we need to add two contributions from the kicks and a contribution coming from the rotation around z-axis, leading to: where |ψ(0 + ) , is the wave function right after the first π/2 rotation around x-axis, which brings the spin to the xy-plane. Using that ψ(0 On the RHS of the conjecture (2), we have the geodesic length ℓ λ = dλ √ g λλ , where leading to ℓ λ = θ such that ℓ t ≥ ℓ λ is indeed satisfied. We see that in this simple example the difference between ℓ t and ℓ λ can be attributed to an extra rotation required to bring (at the QSL, kick) the y-gauge potential term back to the allowed xz-plane."
    },
    {
      "heading": "B. Three-Level System I",
      "text": "With the exception of the two-level system example above and a few other free-particle systems [36], it is not known how to analytically compute the fast-forward Hamiltonian or the quantum speed limit T QSL in more complicated systems. Below, we show that the ideas of mapping counter-diabatic to fast-forward driving protocols presented in Sec. III A, can be used to identify other controllable models and compute the corresponding value for T QSL . Along the way, we unveil the difficulty and hidden complexity behind constructing fast-forward protocols in generic systems, and showcase a concrete example which features an intrinsic emerging dynamical gauge degree of freedom. Consider the two-qubit system described by the Hamiltonian where, as before, g and λ are the magnetic field components along the z and x-directions respectively, and J = 1 is the zz-interaction strength which sets the reference energy scale. Let the initial and target states be the ground states of H 3LS (λ) for λ i = -2g = -λ * , respectively. Similar to Sec. III A, our goal is to find a protocol λ(t) which prepares the target state in time T , following evolution with the single-particle Hamiltonian H 2LS (t). Due to the qubit-exchange symmetry of both H 3LS and H 2LS (t), the problem represents effectively a three-level system (3LS) with SU (3) spanning the space of all possible observables. A priori, it is not clear whether such an optimal protocol exists, since the initial and target states are eigenstates of a fully interacting Hamiltonian, whereas during the evolution the system is non-interacting (decoupled). Note that, in general, this population transfer can only be achieved if and only if the entanglement entropy of each of the two qubits is the same in the initial and target states, as entanglement is preserved during evolution with the non-interacting Hamiltonian H 2LS . This condition is clearly satisfied in our setup, since the states are related by the transforma- ) is a legitimate fast-forward Hamiltonian for T = π, similar to the 2LS, c.f Sec. III A. It is straightforward to check that this fastforward Hamiltonian satisfies the geometric bound conjecture (2). Unfortunately, this only works for the protocol duration T = π, which immediately puts an upper bound on the QSL. For T < π, one can formally rely on general theorems in Optimal Control for systems on compact Lie groups [77], to argue the existence of a finite quantum speed limit T QSL > 0 for this problem. However, since the proofs are non-constructive, one cannot use them to directly check the validity of the geometric bound conjecture. Nonetheless, as we demonstrate now, one can apply the same strategy as the 2LS example in Sec. III A. In particular, (i) we first compute the counter-diabatic Hamiltonian, and then (ii) use the latter to derive a fastforward protocol. However, in practice finding the correct frame transformation in step (ii) is a particularly difficult problem, since there is no straightforward way to identify the correct time-dependent rotation to map the interacting counter-diabatic Hamiltonian to the noninteracting H 2LS . The procedure requires the use of noncommuting rotations in the 8-dimensional operator manifold corresponding to the SU (3) group which, due to their intrinsic time-dependence, lead to unwanted extra Galilean terms that take the transformed Hamiltonian outside the parameter manifold of H 2LS . Moreover, an additional constraint is imposed by the boundary conditions imposing that the rotation reduces to the identity at t = 0, T , c.f. Sec. III A. In the following, we demonstrate how to circumvent all these issues and construct a fast-forward Hamiltonian for the system in Eq. (16). Due to the small dimensionality of the Hilbert space, it is possible to find the exact adiabatic gauge potential in the ground state manifold. Note that, since the Hamiltonian H 3LS (λ) is real-valued, one can choose the gauge potential to be purely imaginary [35,36]. There are only three linearly-independent imaginary matrices which can be shown to generate a SU (2) ⊂ SU (3). Hence, in the most general form we have where α = α(λ, b(λ)) and γ = γ(λ, b(λ)) are fixed functions, which depend on the model parameters, and can be computed using, e.g., a variational principle [36]. We leave details of such computation for the appendix App. B. Let us only comment that because we are looking into the gauge potential for the ground state manifold, i.e. the gauge potential which adiabatically evolves the ground state but allows mixing between the two excited states, the gauge potential is defined up to an emergent dynamical gauge degree of freedom b = b(λ), which we use to our advantage in finding the fast-forward Hamiltonian. Having computed the exact gauge potential, which governs the dynamics at the QSL, we now aim at finding a transformation R(t) that brings the counterdiabatic Hamiltonian (17) to the original parameter manifold (8) with renormalized drive fie"
    },
    {
      "heading": "IV. GENERALIZATION OF THE MAPPING OF FAST-FORWARD TO COUNTER-DIABATIC PROTOCOLS",
      "text": "The previous two examples were very instructive. In particular, we saw that at the quantum speed limit the protocols which can be obtained by rotating the gauge potential automatically satisfy the conjecture (2) because they consist of two pieces: the rotated gauge potential contribution (or more generally rotated counter-diabatic Hamiltonian) and the extra kick contribution due to the rotation, cf. Eqs. (12), (20). The contribution of the first term to ℓ t gives precisely the geodesic length, or more accurately dλ √ g λλ along the chosen path λ(t), while the second, or kick term results in an extra positive contribution. Hence, for protocols of this form, the conjecture is automatically satisfied. Let us show that this scenario (and hence the validity of the bound) is generic for at least a broad class of fast-forward protocols. To do this, we first prove that any fast-forward protocol can be represented as a rotated counter-diabatic protocol. Let us assume that there is a Hamiltonian H FF (t) ≡ H(λ(t)) such that the corresponding wave function |ψ(t) satisfies the boundary conditions |ψ(0) = |ψ i and |ψ(T ) = |ψ * . We further assume that λ(t i ) = λ i and λ(T ) = λ * . The latter assumption is not crucial because λ(t) is allowed to change discontinuously (but we assume that |ψ(t) is continuous and differentiable with respect to time). Let us also choose some arbitrary monotonic function µ(t) which interpolates between λ i and λ f for t ∈ [0, T ] along the adiabatic path, for example: We now show that, at the QSL, every fast-forward Hamiltonian can be mapped to a counter-diabatic Hamiltonian. Define a unitary map R(t) such that where |ψ 0 (µ(t)) is the instantaneous wave function and |ψ(t) is the time-evolved wavefunction under the Hamiltonian H FF (λ(t)). One can convince oneself that this change-of-frame transformation is not unique but it always exists [78]. Let us plug the equation above into the Schrödinger equation: Rearranging the terms, we find Since µ(t) follows an adiabatic path, the evolution of the instantaneous wavefunction |ψ 0 (µ(t)) at the QSL along this path is governed by the gauge potential [79] Using these relations, we immediately conclude that (25) where The last term in Eq. ( 25) does not affect the ground state and reflects the gauge freedom in the choice of the gauge potential we discussed in Sec. III B above. We can simply absorb it into A µ via A µ → A µ + K µ / μ. There is also an obvious gauge freedom in choosing the mapping related to the choice of the function µ(t) and the rotation matrix R. In the two simple examples we analyzed above this gauge freedom can be used to make the second term in Eq. ( 25): -iR † (t)∂ t R(t) to be orthogonal to the first term, i.e. to enforce the condition Equation (25) shows that, at the QSL, any fast-forward Hamiltonian can be written as a rotated counter-diabatic Hamiltonian. Clearly, by applying an appropriate timedependent phase transformation to R: R(t) → R(t)e iφ(t) , with φ(t) an overall time-dependent scalar phase, we can get a similar mapping of fast-forward to counter-diabatic Hamiltonians also away from the QSL. To do this, in Eq. ( 25) we replace μA µ → H CD = H(µ(t)) + μA µ . Once we have establish the equivalence of the fastforward and counter-diabatic protocols we can examine which conditions we need in order to satisfy the conjecture (2). Since a sufficient condition for the conjecture is that R can be represented as a finite product of piecewise constant transformations: where each R j is time independent and acts only in the interval [T j-1 , T j ] (T N = T ). Then, similar to the 2LS and 3LS examples, within the bulk of each time interval only the rotated counter-diabatic Hamiltonian is effective, while at the interval boundaries the wave function evolves according to the kicks given by R j . This implies that, under the assumption that such representation of R exists, using Eq. ( 27) we have and the conjecture (2) follows immediately. At the moment we cannot prove that in general there exists no smooth R such that the integral of expression ( 27) is smaller than the geodesic length. We also do not know any general recipe for finding R. Below, we briefly explain the intuition behind the orthogonality condition (26). We again consider a two level system with the Hamiltonian similar to Eq. ( 8) but with an important difference that now the control parameter is the azimuthal angle φ. For any h 0 = 0 the parameter space geodesic length ℓ φ is larger than the distance between wave functions, which is determined by the global geodesic L. Thus, the conjecture gives a tighter bound for ℓ t and hence for the QSL. Similar to Sec. III A we choose the initial and target states lie in the (x, z)-plane; they are defined as the ground states at φ i = 0 and φ * = π. Because adiabatic transformations with respect to φ are generated by rotations around the z-axis, the gauge potential in this case is simply A φ = S z [35], and hence the counter-"
    },
    {
      "heading": "V. NUMERICAL VERIFICATION OF THE GEOMETRIC BOUND CONJECTURE",
      "text": "In this section, we use algorithms from Optimal Control to numerically test the geometric bound conjecture in systems where analytical solutions are limited by the complexity arising from the enhanced dimensionality of their Hilbert spaces."
    },
    {
      "heading": "A. Three-Level System II",
      "text": "The fast-forward Hamiltonian we found in Sec. III B is non-interacting. One might wonder how the physics of the 3LS discussed in Sec. III B changes if we look for an interacting fast-forward Hamiltonian. In other words, as before we start from and target the ground state of H 3LS , see Eq. ( 16), for λ i = -2g = -λ * and J = 1, but this time we also evolve with H 3LS (t). Hence, the fast-forward Hamiltonian for this problem must be in the same control parameter manifold as Eq. ( 16) for some optimal protocol λ(t). Recently, methods from Shortcuts to Adiabaticity were applied to study related setups of three-level systems [80][81][82][83][84][85]. The physics of this optimization problem below the QSL, i.e. for T < T QSL , was analyzed extensively in Ref. [49], where it was shown that the state preparation problem close to optimality exhibits genuine quantum control phase transitions as a function the protocol duration T , including symmetry breaking, which introduce sharp changes in the functional form of the optimal protocols. Despite the similarity of the current setup to the one in Sec. III B, for this initial value problem, we were unable to find the corresponding rotation of the counter-diabatic Hamiltonian to its fast-forward counterpart analytically, cf. Secs. III A and III B. Nevertheless, the existence of a finite quantum speed limit can be argued using Optimal Control theorems [77] and, variational fast-forward protocols can been constructed which put an upper bound on the QSL [49]. This motivates the search for an approximate fast-forward protocol λ(t) using Optimal Control algorithms. Although within the scope of some numerical limitations, Optimal Control allows us to test the validity of the conjecture (2). Indeed, applying GRAPE [45,53,86], results in an (almost) optimal protocol which, in turn, defines a proper fast-forward Hamiltonian. To find it, we fix a protocol duration T and discretize time in N T = 100 equal steps. We then use GRAPE, which is based on gradient ascend, to find the best possible value for the control field λ(t) at each time step in the range λ(t) ∈ [-16g, 16g],which optimizers the fidelity of being in the target state at the end of the protocol t = T . In order to minimize the probability of getting stuck in a local fidelity maximum, we repeat the procedure a total of two hundred times and post-select the best outcome. The optimal protocol enables us to test the geometric bound conjecture (2) numerically. To this end, we first identify the quantum speed limit within numerical precision, which allows us to safely focus on protocol durations T > T QSL [note that the conjecture holds only above the QSL, where we can achieve unit fidelity]. In this regime, we also make sure that the approximate fastforward protocol indeed prepares the target state with fidelity F h (T ) = | ψ(T )|ψ * | 2 of at least 99.99%. To evaluate the LHS ℓ t , we use the fast-forward Hamiltonian with λ(t) obtained using GRAPE. The quantity ℓ t , related to the time-averaged of the square root of the energy fluctuations of H FF , is then computed numerically. On the RHS of (2), we determined ℓ λ independently by using (i) the geodesic length computed from the analytical gauge potential ( 17) and (ii) -a very slow ramp in the adiabatic limit (T = 100J), where the bound is saturated. We found excellent agreement between the two approaches. Figure 2 shows the result which confirms the validity of the geometric bound conjecture for the 2.6 2.7 2.8 2.9 3.0 T 1.0 1.5 2.0 2.5 3.0 3.5 4.0 ℓ t /ℓ λ GRAPE adiabatic limit 4 6 8 10 12 14 T 1.00 1.25 1.50 1.75 2.00 2.25 2.50 ℓ t /ℓ λ GRAPE adiabatic limit FIG. 2. Numerical justification of the conjecture, cf. Eq. ( 2), across the quantum speed limit of preparing the interacting ground state of the Hamiltonian H3LS following evolution generated by H3LS(t). The inset shows numerical evidence that the conjecture is saturated in the adaibatic limit. The parameters are λi/g = -2 = -λ * /g. The optimal control algorithm used is GRAPE [45,53]. interacting 3LS setup. The inset to Fig. 2 shows numerical evidence that the inequality is saturated in the adiabatic limit. Checking this is a nontrivial task, because at late times there are many protocols with unit fidelity. Most of these optimal protocols have large energy fluctuations and will not be close to saturating the bound. To circumvent this issue, we initiated GRAPE with a smooth adiabatic protocol. The unit-fidelity protocols we obtained this way smoothly connect to the adiabatic solution in the limit T → ∞, where we proved that they saturate the bound. Interestingly, any smooth deformations on top of the adaibatic protocol introduced by GRAPE, always lead to ℓ t /ℓ λ > 1, providing additional evidence that the conjecture is valid. The same applies to more complex many-body systems, see also Fig. 7 and Fig 9."
    },
    {
      "heading": "B. Nonintegrable Ising Chain: Ground State Physics",
      "text": "The previous examples we discussed all share in common a few-dimensional Hilbert space. A natural question to ask is whether the Conjecture (2) holds for many-body systems. In this section, we study a non-integrable Ising chain with emphasis on the ground state physics. Nonintegrability here implies both the absence of a closedform solution for the gauge potential, and the presence of locally thermalizing quantum dynamics which obeys the Eigenstate Thermalization Hypothesis (ETH) [74]. Hence, this model represents a generic quantum manybody system, and our goal below is to test the geometric bound conjecture (2) on it. Consider the non-integrable transverse-field Ising model (TFIM) in a longitudinal field, described by the Hamiltonian In the following, we set J = 1 as a reference energy scale. Once again, λ(t) denotes the control field. The initial and target states are the interacting ground state for λ i = -2g = -λ * , respectively, and the protocol duration is denoted by T . Quantum state preparation in this setup has been studied extensively using Reinforcement Learning in Ref. [48], and this state preparation problem has been shown to have glassy optimization complexity [50]. Due to the lack of a closed-form solution of the stationary Schrödinger equation, it is not possible to obtain a the ground state manifold of the system as a function of λ analytically. Therefore, we restrict the analysis of this initial value problem to the methods of Optimal Control. Because of the extensivity of the spectrum of manybody systems, it is unphysical to allow for unbounded drive fields λ(t), since local control does not grant access over extensively large energy scales. Therefore, we consider the experimentally relevant situation of a bounded drive λ(t) ∈ [-4g, 4g]. As before, we discretize the protocol duration T in time steps δt, and study the problem using two different control algorithms (see Sec. V A for details): (i) GRAPE looks for continuous protocols, while (ii) Stochastic Descent (SD) has proven useful to look for the so-called bang-bang protocols, i.e. protocols which take values on boundary of the allowed domain: λ ∈ {±4}. Although discontinuous, the family of bangbang protocols are known to contain an optimal solution as a consequence of Pontryagin's maximum principle. It is not known what the quantum speed limit for this problem is, nor whether it is finite in the thermodynamic limit. Therefore, we make sure to consider only optimal protocols with durations T , which allow for enough time to prepare the target state with many-body fidelity F h (T ) = | ψ(T )|ψ * | 2 of at least 99.99%. In this respect, it is important to mention that close to optimality finitesize effects have been shown to be negligible for this problem setup, starting from a system size of L > 6 sites, see Ref. [48], and hence we restrict to L = 10 for the results presented here. To check the geometric bound conjecture (2), we compute numerically the LHS and RHS. Once the optimal fast-forward protocol λ(t) has been determined, the numerical computation of ℓ t on the LHS is straightforward. On the RHS, we can no longer calculate the geodesic length exactly, since we do not have the exact expression for the adiabatic gauge potential. Nevertheless, as we argued in Sec. II and verified numerically in Sec. V A, we can obtain the geodesic length ℓ λ from evolution in the adiabatic limit. Figure 3 shows the ratio ℓ t /ℓ λ between the timeintegral over the square root of the energy fluctuations  2), in the high-fidelity region of the quantum state preparation problem in the many-body Hamiltonian (32) as a function of the protocol duration T . The parameters are λi/g = -2 = -λ * /g, J/g = 1 and L = 10. We used Stochastic Descent (SD) to find (nearly) optimal bang-bang protocols λ(t) ∈ {±4} of time step is δt = 0.005J. of the fast-forward Hamiltonian corresponding to the optimal protocol and the geodesic length, as a function of the protocol duration T . It is an interesting observation that, even though both the bang-bang protocols (dashed line) and the continuous GRAPE protocols (solid line) satisfy the conjecture, the average energy variance ℓ t is kept smaller by the GRAPE protocols. We recall that, according to Pontryagin's maximum principle, one can find a bang-bang protocol to achieve (at least) the same fidelity as with any continuous protocol. We attribute the fact that the two families of protocols differ in terms of the average energy variance they create during the evolution, to their robustness properties: while bang-bang protocols might be optimal they have recently been shown to be unstable to small perturbations [48]. Mathematically bang-bang protocol result in a larger energy variance and hence larger ℓ t because they the Hamiltonian changes very rapidly between the bangs, while the state does not have time to follow. If we associate ℓ t with the fluctuating energy cost following Ref. [67] then clearly bang-bang protocols are "
    },
    {
      "heading": "C. Nonintegrable Ising Chain: Excited States Physics",
      "text": "It is well known that some properties of low-energy states differ significantly from those of their excited states counterparts. Most notably, in many systems, the ground state physics is protected by a finite gap in the energy spectrum, which renders the adiabatic limit well-defined. In contrast, the energy level spacing for excited states is usually exponentially suppressed in the system size, and for spin-1/2 chains scales as 2 -L . Consequently, the time scales for the adiabatic limit are exponentially longer for excited states. On the other hand, fast-forward protocols are allowed to excite the system during the evolution before they prepare the target state. One can imagine harnessing this additional freedom to improve on the time scales for adiabatic state preparation. This raises the question whether the conjecture (2) is not violated for excited states. To test this, we add a small y-field to the nonintegrable Ising chain and consider the Hamiltonian: with h/J = -0.1, g/J = 1, and a driving protocol λ(t)/J ∈ [-2, 2]. We pick for an initial state an infinitetemperature state, characterized by energy which is closest to zero at λ i = -2J, see Fig. 4 (purple line). The target state is the adiabatically connected state at λ * = 2J. This choice for the initial state is motivated by ETH, according to which the states in the middle of the spectrum are the first one which become chaotic and lead to thermalization of the system under generic dynamics like dynamics governed by the Hamiltonian (33). To ensure a finite geodesic length ℓ λ and a well defined adiabatic limit, we introduced a small magnetic field in the y-direction which breaks the emergent integrability of the system (see clustering of the states closer to λ = 0, i.e. Jt ≈ 0.8), and opens up the corresponding unavoided crossings along the adiabatic trajectory. To test the conjecture for excited states, we consider two spin chains of length L = 6 and L = 8, respectively. Imposing periodic boundary conditions, the only two symmetries in the Hamiltonian (33) are translation invariance and parity (reflection about the middle of the chain). Without loss of generality, we work in the zero-momentum sector of positive parity, containing the GS, which allows us to consider only those states that are coupled during the time evolution. The corresponding symmetry-reduced Hilbert sub-spaces have sizes dimH = 13 and dimH = 30, respectively. Figure 4 shows parts of the instantaneous energy spectrum of the model, including the adiabatic trajectory from the initial into the target state. The magenta line in the middle marks the adiabatically connected state. One can clearly observe a number of avoided crossings, which are responsible for large protocol durations required to find te system in the adiabatic limit. For instance, to prepare the target state with 99.999% probability adiabatically in the Hamiltonian (33) requires ramp durations on the order of T = 4 × 10 4 for L = 6, and T = 10 5 for L = 8. To compute the LHS of the geometric bound conjecture (2), we used GRAPE to find an (almost) optimal protocol sequence of 100 time steps at a number of fixed protocol durations of order JT ∼ O (10). The nonadiabatic character of these protocols allows for a protocol duration much shorter than the adiabatic ones, yet we made sure that all GRAPE protocols prepare the target state with at least 99% fidelity. Figure 5 demonstrates that the Conjecture (2) holds even for the excited states of generic many-body models. Interestingly unlike in the two-spin case the ratio ℓ t /ℓ λ increases with the protocol time T , c.f. Fig. 2. As we argued we anticipate that in the limit T → ∞ the bound is saturated for any state, ground or excited, because of applicability of APT, so the ratio ℓ t /ℓ λ should go down with T . The growth of ℓ t /ℓ λ is attributed to the numerical GRAPE procedure. Since the energy fluctuations are not part of the cost function, GRAPE is ignorant to them. as we initiate the algorithm from a random protocol configuration, it flows to a nearby local minimum in the control landscape, which is more likely to have large energy fluctuations with increasing time. Therefore, if we want to use GRAPE to study the adiabatic limit, one should either start close to it, or bias the algorithm towards it. Nevertheless we clearly see that the inequality ℓ t > ℓ λ holds at all protocol times considered. This result comes with an important consequence. In generic systems satisfying ETH, the geodesic length ℓ λ for excited states exponentially diverges with the system size L so the conjecture implies that any fast-forward protocol is exponentially long. Since fast-forward protocols excite the system in the basis of the instantaneous Hamiltonian [before they deexcite it to reach the target state with unit probability], one may naïvely think that by using such out-of-equilibrium protocols it is possible to circumvent the restrictions in the adiabatic limit imposed by the size of"
    },
    {
      "heading": "D. Fully-Connected Ising Model",
      "text": "Potential candidates that violate the conjecture are Hamiltonians which have small ground state gaps along their adiabatic path but have a lot of symmetry such that the ground state phases are trivially found by inspection. In those cases one could wonder whether numerical methods from optimal control theory can find protocols that violate our conjecture. Here we check one example and show that it does not. Consider a quantum p-spin model without disorder: For any p > 2, this model has a mean-field like first order transition from paramagnet to ferromagnet with a gap [87] exponentially closing with the system size L This makes it hard to adiabatically cross the transition but at the same time the ground states in the two phases are trivial Z and X polarized product states. Note that the ground state is unique for any odd p. Moreover, the Hamiltonian conserves total angular momentum S 2 such that the effective Hilbert space dimension is only L + 1. Figure 6 shows the low energy spectrum of an L = 14 spin model for large p. Even though the gap closes exponentially, the geodesic length does not exponentially grow with system size. In contrast, in the thermodynamic limit, it undergoes a jump of π/2 at the critical point. The latter reveals the simple Landau-Zener nature of the problem, with essentially only two states participating in the transition. Once again we use GRAPE to numerically find closeto-unit fidelity protocols that cross the quantum phase transition, i.e. they start at λ = -2 and end at λ = 0. The small gap and the highly non-local nature of the Hamiltonian seem to make the optimal control problem significantly harder than any other models considered so far in this work. Typical protocols, obtained from a random initial seed for the GRAPE, have energy fluctuations which are about two orders of magnitude larger than the conjecture bound (2). In order to obtained good protocols with small energy variance we therefore bias the algorithm to the right corner of phase space by starting from the geodesic protocol with some small random noise part. This results in much better protocols which, in the adiabatic limit saturate the bound, see Fig. 7. For shorter times, when the inverse time becomes comparable to the minimum gap along the trajectory, we can  (34). The model has a first order transition with an exponentially small gap separating the two phases. In the thermodynamic limit, the geodesic length ℓ λ jumps by π/2 at the critical point. still find almost-unit-fidelity protocols but their energy variance grows rapidly with decreasing time. Numerical optimal control results thus suggest that our conjecture is also satisfied for mean-field like first order quantum phase transitions. Kitaev (SYK) model and free fermions, where U ijkl is a random variable drawn from a normal distribution with zero mean and variance L -3/2 , and λ(t) is the drive. Here L labels the number of fictitious sites in the fully-connected quantum dot, and c † j creates a spinless fermion on such a site j. The free-particle kinetic energy (hopping) term is assumed to have periodic boundary conditions. For λ = ∞, the resulting local noninteracting model is described by free fermions, while for λ = 0 it becomes the SYK model. Numerically we initialize the system in the ground state of λ = -2, which has high overlap with the non-interacting ground state and can thus be considered in the Fermi-liquid phase, see Fig. 8. We target the SYK ground state at λ = 0 for a single realization of the disorder. For a given disorder realization there is a sharp transition from a Fermi liquid to a non-Fermi liquid at a critical value of the hopping. Like in the fully-connected Ising model, this is accompanied with a sharp jump in the geodesic length. As before, we use GRAPE to find nearly optimal fastforward protocols of duration T , and verify numerically the validity of the geometric bound conjecture, cf. Fig. 9. The bound is clearly satisfied but our inequality seems to far from tight. We have numerically verified that the ratio of ℓ t /ℓ λ does go to 1 in the adiabatic limit but this would require to go about 10 times slower than the data presented in Fig. 9. Whether the large excess energy fluctuations close to the quantum speed limit are a consequence of the numerical optimization procedure or are simply unavoidable, remains an open question. 160 170 180 190 200 T 0 10 20 30 ℓ t /ℓ λ GRAPE adiabatic limit FIG. 9. Numerical verification of the geometric bound conjecture ( 2) for the ground state of a fermionic SYK model described by Hamiltonian (35). The data shows a single disorder realization, since every realizations comes with its own optimal protocols. For the presented realization the quantum speed limit is estimated to be around T = 150. The inset shows numerical evidence that the conjecture is saturated in the adaibatic limit. The data shows a single typical realization of the disorder for half filling at L = 8."
    },
    {
      "heading": "VI. DISCUSSION/OUTLOOK",
      "text": "Even though standard quantum speed limit bounds are correct, they can only be saturated by a Rabi-pulse constructed out of a Gram-Schmidt orthogonalized version of the initial and target states. It suffices to consider an ensemble of L copies of a single qubit to realize that those operations are usually not accessible in ex-periments. With only local controls, one can prepare a product of L qubits in exactly the same time as one can prepare a single qubit state. However, currently known quantum speed limits argue that this process should be √ L times faster. This speedup is possible but requires access to a maximally-entangled state in the process. The known bounds are thus a consequence of quantum supremacy, but they do not tell us anything about how hard it is to attain the bound. In this paper, we resolved this issue by taking into account that the absolute minimal path in Hilbert space between two states cannot be attained by just any Hamiltonian; instead we compute the distance between two states as the distance in the accessible (i.e. fast-forward) Hamiltonian parameter space. By reconciling ideas of Adiabatic Perturbation Theory, Counter-Diabatic driving, and Optimal Control, we conjectured that the time length ℓ t for any fast-forward protocol, equal to the time integral of the instantaneous energy fluctuations, is bounded from below by the geodesic length imposed by the geometry of the instantaneous eigenstate manifold. While proving this statement for generic quantum systems remains an open problem, we have provided substantial evidence for the validity of the corresponding conjecture (2), and proved it in certain limits amenable to analytic treatment. In the exactlysolvable two-and three-level systems, we demonstrated that one can find a fast-forward Hamiltonian at the quantum speed limit analytically using ideas from counterdiabatic driving. By identifying and exploiting a residual dynamical gauge degree of freedom, we showed that the three-level system at the infinite-speed limit can be mapped to a single non-interacting collective spin degree of freedom. We also showed that any fast-forward Hamiltonian can be obtained from a counter-diabatic Hamiltonian by a unitary rotation. The mapping might allow one to prove the conjecture in general. For a non-integrable Ising chain, we used optimal control algorithms to numerically verify the universality of the proposed geometric bound not only for the ground state but also for excited states. An interesting observation, which comes from Eq. ( 3), is that the energy fluctuations can be interpreted as the time component of the non-equilibrium quantum metric tensor g tt = δE 2 F F (t), since the latter describes the distance between wave functions at two consecutive moments of time t and t + δt: Then the conjecture (2) applied to a short time interval states that, for any time evolution, the control is always time-like g tt -λ2 g λλ ≥ 0. The geometric bound conjecture can then be seen as a constraint imposed by causality on the optimal quantum state preparation protocols. The universal geometric bound conjectured and checked in this paper can be used to define complexity of a dynamical control problem through the geometric length, which is a property of the ground state manifold. In particular, one can say that the problem is computationally hard if the equilibrium distance between the initial and final stated determined through the quantum geometric tensor is exponentially large in the number of degrees of freedom. This definition of complexity makes no reference to particular protocols, which can be say realized on a quantum computer. There are very few other examples we are aware of where equilibrium properties constrain the possible behavior of a system away from equilibrium. One of them is the famous Jarzynski equality which constraints the work distribution done on a system in an arbitrary non-equilibrium process by the equilibrium free energy difference [88]. Such results are remarkable in their nature, because they demonstrate the conservative character of physical laws, and usually point towards deeper connections between seemingly unrelated phenomena. Since the Hamiltonian (B1) is real, it can be instantaneously diagonalised by a unitary, generated by a purely imaginary operator [36]. There are three independent su(3) basis elements that satisfy this property which form a closed Lie subalgebra: su(2) = span{ŷ, xy, ŷz} ⊂ su(3). Thus, in full generality, we can make the ansatz [36] A with α, β, and γ some λ-dependent functions [note that they are all time-dependent via λ(t)]. To determine these coefficients, it is sufficient to minimise the norm of the square of the operator G: which is a quadratic form of α, β and γ. This results in the following equation for the functions α, β, and γ. The Hessian is independent of α, β, and γ for a quadratic form. Finding the gauge potential via this minimization scheme is particularly convenient as it does not"
    },
    {
      "heading": "a. Exactly Solvable Limits",
      "text": "It becomes clear that for J = 0, when the two qubits are decoupled, the physics reduces to that of two independent two-level systems. Hence, in the limit of J = 0, we can find the fast-forward Hamiltonian following the derivation of the fast-forward Hamiltonian in Sec. A. We call this limiting case the 2LS limit. Interestingly, the 3LS admits a second exactly solvable limit, g = 0, for which the original Hamiltonian (B1) reduces to the transverse-field Ising model on two-sites. In this Ising limit, α = 0 = β and the gauge potential reduces to Notice the former similarity between this gauge potential and the one obtained for the 2LS. It turns out, the Ising limit is another disguised two-level system, generated by the following Lie subgroup u(2) = su(2) ⊕ u(1), where su(2) = span{x/2, ŷz, ẑz + xx/2} and u(1) = span{( xx -1/3)/2}. As an immediate property of this decomposition, the following commutation relation follows Recalling the steps we followed in the single-particle limit in Sec. A, a rotation about the x-axis should map the gauge potential from the ŷx to the ẑz + xx/2 direction. However, there is no xx term present in the original Hamiltonian, cf. Eq. (B1). At first sight, the resulting rotated Hamiltonian is kicked outside the fast-forward manifold. The way out is to notice that the operator G, see Eq. (B4), remains invariant if we add to the gauge potential A any term which commutes with the Hamiltonian H. Thus, using Eq. (B7), we may extend the gauge potential to where ρ(t) is an arbitrary function of time. Below, we restrict to the infinite speed limit λ → ∞. The generalisation to arbitrary speeds can be done following the same steps as in Sec. A. The counter-diabatic Hamiltonian in the Ising limit thus reads H CD = λ (γ ŷz + ρ(t) xx) . To derive the corresponding fast-forward Hamiltonian, we once again do a π/2 rotation about the generator x/2 [notice the extra factor of 1/2 which is required by the canonical commutation relations of the emergent su(2) group], and enforce the boundary condition using step functions: (t) = exp -i π 4 [Θ(t) + Θ(Tt)] x , (B10) which leads to H FF (t) = -λ(t)γ(t) ( ẑz + xx/2) + π 4 [δ(t)δ(Tt)] x + λρ(t) xx. (B11) By choosing ρ(t) = -2γ(t), we get rid of the unwanted term to find H FF (t) = λ(t)γ(t) J -J ẑz + π 4 J λ(t)γ(t) [δ(t)δ(Tt)] x ∝ H(t) g=0 The quantum speed limit in the Ising limit reads Let us now go back to the general case for the 3LS. The starting point is once again Eq. (B5), with • the ground state norm: G 2 2 = ψ GS |G 2 |ψ GS . Curiously, choosing the ground state norm, the Hessian in Eq. (B5) has a vanishing determinant, which signals the existence of an additional gauge degree of freedom. Physically this freedom originates from allowing the gauge potential to mix to excited states in an arbitrary way. This freedom is encoded in choosing the operator K introduced in Sec. IV. Without loss of generality, we choose this along the xy-direction and denote it by b. The reduced problem now becomes two-dimensional where the optimal solution α = α(b), γ = γ(b) now depends parametrically on the gauge field b(λ). Since the exact expressions are rather cumbersome, we choose not to show them here. Instead we list the following important properties: (i) the dependence on the gauge field b turns out to be linear, so we can write (ii) the above functions obey the following symmetries: α 0 (λ) = α 0 (-λ), γ 0 (λ) = γ 0 (-λ), α 1 (λ) = -α 1 (-λ), γ 1 (λ) = -γ 1 (-λ). (iii) for λ → 0, both α 1 (λ), γ 1 (λ) ∼ 1/λ have the same power-law divergence. We are now fully equipped to tackle the general case. Recall that out goal is to find a time-dependent unitary R(t), which maps dynamically the counter-diabatic Hamiltonian to the fast-forward Hamiltonian H FF (t), up to an overall time-dependent prefactor. We will construct this transformation in two steps: 1) Recalling that the terms in the above gauge potential form a closed su(2) algebra, we use the dynamical gauge field b(λ) to orient the gauge potential along the ŷ-direction. To do this, let us perform the rotation where the boundary conditions (BC) are chosen to satisfy the requirement R (1) (0) = 1 = R (1) (T ). This is at first sight problematic, since we have two BC for a single first-order ODE. However, from the symmetry properties above, one can convince oneself that if b(λ) = -b(-λ) is antisymmetric, then both BC coincide and thus represent a single constraint, since λ * = -λ i . Indeed, using the same symmetry properties, it is easy to see that b(-λ) also obeys Eq. (B17). Last, notice that, even though the functions α and γ have a 1/λ-singularity for λ → 0, the quotient γ/α does not, as the singularity is lifted. Thus, the RHS of Eq. (B17) is a smooth function of b and λ. It then follows from the Picard-Lindelöf theorem for existence and uniqueness of ordinary differential equations that the initial value problem in Eq. (B17) has a unique solution. In the following, let us fix the dynamical gauge field b to sat"
    }
  ],
  "figures": [
    {
      "caption": "10 -FIG. 4 .",
      "image_path": null
    },
    {
      "caption": "FIG.6. Low energy spectrum of a 14-spin disorder free pspin model for p = 51 discribed by Hamiltonian",
      "image_path": null
    },
    {
      "caption": "FIG.7. Numerical verification of the geometric bound conjecture (2) for the ground state of a disorder free p-spin model described by Hamiltonian",
      "image_path": null
    },
    {
      "caption": "FIG. 8.Probability to find the ground state of Hamiltonian",
      "image_path": null
    }
  ],
  "equations": []
}