{
  "paperid": "2024.emnlp-main.15",
  "title": "Fine-Tuning or Retrieval? Comparing Knowledge Injection in LLMs",
  "authors": [
    "Oded Ovadia",
    "Meni Brief",
    "Moshik Mishaeli",
    "Oren Microsoft",
    "Giusepppe Attardi",
    "Lukas Berglund",
    "Meg Tong",
    "Max Kaufmann",
    "Mikita Balesni",
    "Asa Stickland"
  ],
  "year": 2024,
  "abstract": "Large language models (LLMs) encapsulate a vast amount of factual information within their pre-trained weights, as evidenced by their ability to answer diverse questions across different domains. However, this knowledge is inherently limited, relying heavily on the characteristics of the training data. Consequently, using external datasets to incorporate new information or refine the capabilities of LLMs on previously seen information poses a significant challenge. In this study, we compare two common approaches: unsupervised fine-tuning and retrieval-augmented generation (RAG). We evaluate both approaches on a variety of knowledge-intensive tasks across different topics. Our findings reveal that while unsupervised fine-tuning offers some improvement, RAG consistently outperforms it, both for existing knowledge encountered during training and entirely new knowledge. Moreover, we find that LLMs struggle to learn new factual information through unsupervised fine-tuning, and that exposing them to numerous variations of the same fact during training could alleviate this problem.",
  "sections": [
    {
      "heading": "Introduction",
      "text": "Large language models (LLMs) are able to capture vast amounts of factual information (Petroni et al., 2019;Cohen et al., 2023;Hu et al., 2023). LLMs exhibit a remarkable level of knowledge in various domains due to their massive pre-training datasets. However, there are two significant limitations to this knowledge. First, it is static and does not update with time. Second, it is non-specific and thus may lack nuanced expertise in particular domains. While these are two different problems, they are deeply related since their solution is the same: enhancing the model's knowledge. Recently, the idea of adapting LLMs to particular domains and updating their knowledge has * Equal contribution. become increasingly common (Yu et al., 2022). Various models have been suggested to improve factual knowledge and capabilities in diverse fields such as healthcare (Singhal et al., 2023a,b;Wu et al., 2023a), finance (Wu et al., 2023b;Yang et al., 2023), and law (Huang et al., 2023;Nguyen, 2023). In this work, we focus on the evaluation of a model's knowledge and its ability to memorize, understand, and retrieve factual data. We aim to understand the concept of knowledge injection (Wang et al., 2020;Chen et al., 2022;Liu et al., 2020;Lauscher et al., 2020). Given some knowledge base in the form of a text corpus, what is the best way to teach a pre-trained model this knowledge? One way to add knowledge to a pre-trained model is through fine-tuning. With fine-tuning, we continue the model's training process and adapt it using task-specific data. By exposing the model to a specific knowledge base, we expect the model weights to adapt accordingly. This process is meant to optimize the model for targeted applications, enhancing its performance and contextual relevance in specialized domains. Another method to enhance a model's knowledge base is through the use of in-context learning (ICL) (Chen et al., 2021;Radford et al., 2019;Min et al., 2021;Lampinen et al., 2022). The main idea behind ICL is to improve the performance of pretrained LLMs on new tasks by modifying the input query to the model without directly changing the weights of the model. One form of ICL is retrieval augmented generation (RAG) (Lewis et al., 2020;Neelakantan et al., 2022). RAG uses information retrieval techniques to enable LLMs to obtain relevant information from a knowledge source and incorporate it into generated text. This study aims to evaluate the knowledge injection capabilities of LLMs through a comparison of fine-tuning and RAG. To illustrate the rationale, let us use an analogy. Consider three college students taking a test on a specific topic. All had access to class materials but didn't know the topic beforehand. The first student had the textbook only during the test, the second had pre-test access and studied, and the third lost access upon the test announcement. Who would probably perform better?"
    },
    {
      "heading": "Background",
      "text": "To assess knowledge injection, we must first understand what knowledge means for LLMs. Knowledge and Language Models Defining knowledge is a complex philosophical task far beyond the scope of this research. However, we can examine what factual knowledge means in the context of language models. If a model knows a fact, it can accurately and consistently answer questions about it. Furthermore, it can reliably distinguish between true and false statements related to this fact. We can then extend this definition to a whole knowledge base, not just a single fact. Mathematically, let Q = {q n } N n=1 be a set of N multiple choice factual questions, where each question has L possible answers and exactly one correct answer. Let A = {(a 1 n , . . . , a L n )} N n=1 be the corresponding set of possible answers, and C = {c n } N n=1 be the correct answers. Let M be a language model. We denote by M(q n ) ∈ {a 1 n , . . . , a L n } the predicted answer of the model to the n-th question. We define the knowledge score L of M in relation to Q to be the standard accuracy score: We say that the model M possesses any knowledge regarding the set of questions Q if the following holds: In simpler terms, the model can consistently give correct answers, outperforming a simple random guessing baseline. Naturally, if the knowledge score L M,Q is higher for one model compared to another, then we assert that the former is more knowledgeable with regards to Q compared to the latter. Previously Seen Knowledge One important distinction to make is between knowledge that the model has been exposed to before during pretraining as opposed to entirely new facts. Considering the size of modern LLM training sets, they cover a vast amount of information available through web-sourced text. As a result, even in niche domains, the goal of knowledge injection is not necessarily to teach the model entirely new facts but rather to \"refresh\" its memory by inducing a bias toward a particular domain. Knowledge and Reasoning We emphasize that this knowledge evaluation framework for LLMs is imperfect. Importantly, it doesn't address other quality metrics influencing a model's response. Creating a purely knowledge-intensive dataset without involving some level of reasoning is challenging. Consequently, a model with robust reasoning abilities might excel on unfamiliar knowledge-intensive tasks by making \"educated guesses\" in a multiple-choice exam. Therefore, any evaluation of knowledge in LLMs should consider this, with results seen as part of a broader range of benchmarks for reasoning (Sakaguchi et al., 2021), reading comprehension (Dua et al., 2019), and general language abilities (Srivastava et al., 2022). However, this evaluation framework still strongly emphasizes factual information above all else. Causes for Factual Errors There are many possible reasons for the failure of models to answer factual questions accurately. In (Wang et al., 2023), Wang et al. introduce a taxonomy of five main model-level causes: • Domain knowledge deficit: A language model may lack comprehensive expertise in a specific domain to which it has not been exposed. For example, a model trained exclusively on texts written by William Shakespeare would perform poorly when asked about the works of Mark Twain. • Outdated Information: LLMs invariably have a cutoff date determined by their training dataset. Consequently, any events, discoveries, or changes occurring after the last training update will not be within the model's knowledge without access to external sources. • Immemorization: Sometimes, a model is exposed to knowledge during its training process but does not retain it. This is especially true for rare facts that appear in the training dataset only scarcely (Kandpal et al., 2023). • Forgetting: Language models often undergo additional training after the pre-training phase (fine-tuning). In some cases, this might lead to a phenomenon called catastrophic forgetting ( Kirkpatrick et al., 2017;Goodfellow et al., 2013;Chen et al., 2020;Luo et al., 2023), where models lose some of the knowledge they had prior to the fine-tuning process. • Reasoning Failure: In certain instances, a language model might possess relevant knowledge about a fact but fail to utilize it properly. This is particularly evident in complex multi-step reasoning tasks (Tan et al., 2023) or when posed with different questions about the same fact, resulting in disparate outcomes (Berglund et al., 2023). We observe that most of these issues arise during the pre-training phase, with catastrophic forgetting being the notable exception. Hence, many LLMs will suffer from factual errors of this kind regardless of any post-training process."
    },
    {
      "heading": "Injecting Knowledge to Language Models",
      "text": "Following the background given in Section 2, it is clear that general pre-training is insufficient for many knowledge-intensive tasks. To solve this, an additional post-processing step is essential to augment the knowledge of a pre-trained model. This step is often reffered to as knowledge injection (Wang et al., 2020;Chen et al., 2022;Liu et al., 2020;Lauscher et al., 2020). In this section, we examine two widely used frameworks for knowledge injection: fine-tuning (FT) and retrieval augmented generation (RAG). We begin by formulating the knowledge injection problem, aiming to explain both methods using consistent terminology."
    },
    {
      "heading": "Problem formulation",
      "text": "In Equations ( 1) and ( 2), we presented a formulation for knowledge in language models through the lens of question-answering (Q&A). We now extend this formulation to the problem of knowledge injection using the same terminology. Given a set of factual questions, there exists some text corpus containing information that is relevant to these questions. The central assumption of knowledge injection is that given full access to this corpus, it could serve as an auxiliary knowledge base and improve the model's performance on this set of questions. Mathematically, let M be a pre-trained model, and let Q be a set of factual questions, as before. Now, assume we have a relevant auxiliary knowledge base B Q . Our objective is to discover a transformation, denoted as F, that, when applied, would enhance the knowledge about Q: In this work, we aim to compare two choices for F: fine-tuning and RAG to see which option performs better in this problem."
    },
    {
      "heading": "Fine-Tuning",
      "text": "Fine-tuning is the process of adjusting a pre-trained model on a specific, often narrower, dataset or task to enhance its performance in that particular domain. Here, it is vital to distinguish between different types of fine-tuning. FT techniques are commonly classified into supervised, unsupervised, and reinforcement learning (RL) based methods. We proceed by briefly reviewing these methods and their relation to the problem of knowledge injection. Supervised Fine-Tuning Supervised finetuning (SFT) requires sets of labeled input-output pairs. One of the most common SFT methods is instruction tuning (Wang et al., 2022;Mishra et al., 2021;Ouyang et al., 2022;Taori et al., 2023), which has emerged as one of the most powerful methods to improve model performance. With instruction tuning, the input is a natural language task description, and the output is an example of the desired behavior. Many current state-of-the-art LLMs have gone through instruction tuning after their pre-training phase. Instruction tuning has been shown to be very effective at improving the overall quality of the model, with a particular emphasis on its zero-shot and reasoning capabilities. However, despite these advantages, instruction tuning does not necessarily teach the model new knowledge (Ouyang et al., 2022;Chung et al., 2022;Mitra et al., 2023;Chia et al., 2023;Zhou et al., 2023). As such, instruction tuning alone is not a viable solution to the knowledge injection problem. Reinforcement Learning Another form of FT relies on RL or RL-inspired optimization strategies to better align the model after its pre-training phase. A few prominent examples are reinforcement learning from human feedback (RLHF) (Ope-nAI, 2023; Touvron et al., 2023), direct preference optimization (DPO) (Rafailov et al., 2023), and proximal policy optimization (PPO) (Schulman et al., 2017;Tunstall et al., 2023). These techniques have been shown to be very useful, especially when used in conjunction with instruction tuning. However, similarly to instruction tuning, these methods focus on the overall quality of the response and its expected behavior and not necessarily on its breadth of knowledge. Unsupervised Fine-Tuning The final FT strategy we discuss is unsupervised, meaning there are no available labels for the model to learn from. One common unsupervised FT technique is often referred to as continual pre-training or unstructured FT. In this method, the FT process is viewed as a direct continuation of the pre-training phase. We start with a saved checkpoint of the original LLM and train it in a causal auto-regressive manner, i.e., predicting the next token. One major difference in comparison to actual pre-training is the learning rate. Usually, one would need a much lower learning rate when continuing the pre-training of the model to avoid catastrophic forgetting (Kirkpatrick et al., 2017). It is well known that LLMs store vast amounts of knowledge during their pre-training phase (Zhou et al., 2023). So, it makes sense to continue this process in order to inject knowledge into the model. Hence, we use the unsupervised FT approach throughout this work and evaluate its efficacy in enhancing the model's capacity for learning new information."
    },
    {
      "heading": "Retrieval Augmented Generation",
      "text": "Retrieval augmented generation (RAG) (Lewis et al., 2020) is a technique that expands LLMs' capabilities, especially in knowledge-intensive tasks, by using external knowledge sources. While the original formulation involved additional training per task, it has since been demonstrated (Neelakantan et al., 2022) that a pre-trained embedding model can achieve improved performance with no additional training involved. The idea is that given an auxiliary knowledge base and an input query, we use the RAG architecture to find documents within the knowledge base that resemble the input query. These documents are then added to the input query, thus giving the model further context about the subject of the query. In practice, implementing the suggested architecture is quite straightforward: Given an auxiliary knowledge base B Q and a pre-trained embedding model M e , we create a dense vector representation (embedding) per document b ∈ B Q and store these in a vector store. Upon receiving a new query q, we use its embedding, M e (q), to retrieve q's top-K closest neighbors, b q = {b k } K  (Hendrycks et al., 2021) in the topics of anatomy, astronomy, college biology, college chemistry and prehistory. The chosen tasks were selected based on their emphasis on factual knowledge and the minimal reliance on reasoning. As a heuristic, we opted for tasks where the questions are short and involve no context. In practice we selected four STEM subjects as well as one humanities subject, to ensure the evaluation is not limited to certain fields. Note that prehistory involves questions spanning all non-modern history. This approach aims to enable us to test LLM proficiency in comprehending and manipulating information in isolation from its reasoning processes."
    },
    {
      "heading": "Current Events Task",
      "text": "To further isolate LLMs' abilities to learn new knowledge, we created a task comprising multiple-choice questions about current events. This task includes multiplechoice questions about events that occurred after the cutoff of the various models' training data. Specifically, we focused on \"current events\" from the USA, in the time span of August-November 2023, that are included in the relevant Wikipedia indexesfoot_1 . This method enables us to mostly guarantee that the models have not been exposed to these facts, thus allowing us to directly test knowledge injection capabilities."
    },
    {
      "heading": "Data Collection and Preprocessing",
      "text": "To effectively evaluate the LLMs' performance on these knowledge-intensive tasks, a comprehensive auxiliary dataset was collected by scraping relevant articles per topic from Wikipedia. The rationale behind selecting Wikipedia as the primary source of knowledge is its broad coverage of relevant topics and its reliability as a repository of crowd-verified knowledge. All articles pertinent to the tasks were retrieved via the official Wikipedia API 2 by identifying the relevant central page per topic. Subsequently, a rigorous cleaning process was utilized to transform the data from raw subsections to clean chunks. This step was done with the \"wikiextractor\" tool (Attardi, 2015). The division into small, clean (e.g., remove HTML, URLs, etc.) chunks was aimed at enhancing the evaluation of the LLMs' understanding across various knowledge domains and aiding the LLMs in the fine-tuning process."
    },
    {
      "heading": "Current Events Task Creation",
      "text": "After collecting the relevant chunks from Wikipedia, we created a new multiple-choice dataset with the help of GPT-4 (OpenAI, 2023). First, we removed any small chunks. For each remaining chunk in the corpus, GPT-4 was instructed to create four highly specific, high-quality multiple-choice questions with only one correct answer. By specific, we mean that the question can be answered without knowledge of which context the question refers to and with minimal ambiguity. Next, GPT-4 was asked to select the two most specific of the four. This was followed by a manual evaluation and verification step. In total, this resulted in 910 new questions."
    },
    {
      "heading": "Paraphrases Generation",
      "text": "After creating the dataset, we utilized GPT-4 to generate augmentations of the dataset. We instructed GPT-4 to provide paraphrased versions of the input data that fully retain the information while being reworded. Each paraphrasing iteration was done with a different seed to ensure variety. We selected 240 chunks at random for each task and created two paraphrases per chunk. These were set aside to be used as validation sets for hyperparameter tuning. For the current events dataset, we created ten paraphrases for each chunk used in the fine-tuning process described in Section 6."
    },
    {
      "heading": "Experiments and Results",
      "text": "Experimental Framework We used the popular LM-Evaluation-Harness (Gao et al., 2021) repository to evaluate the performance of LLMs on the selected knowledge-intensive tasks. LM-Evaluation-Harness is a robust benchmarking tool that currently serves as the industry standard for model evaluation and is the basis of the HuggingFace leaderboardfoot_3 . Leveraging this platform ensured a standardized evaluation framework and allowed consistent comparison across models, methods, and datasets. More importantly, by using the industry standard for evaluation, we could avoid any differences stemming from prompt engineering and formatting issues and replicate the reported baseline results for each model. Model Selection We chose three models for inference evaluation: Llama2-7B (Touvron et al., 2023), Mistral-7B (Jiang et al., 2023), and Orca2-7B (Mitra et al., 2023). The choice of these models was meant to represent the most popular opensource base models and an instruction-tuned model across various baseline capabilities. Additionally, we selected bge-large-en (Xiao et al., 2023) as the embedding model for the RAG component and used FAISS (Johnson et al., 2019) as its vectorstore. This embedding model is currently the SOTA of open-source embedding models, according to the HuggingFace MTEB leaderboardfoot_4 . Configuration Variations Our evaluation included multiple configurations, with a grid-search  5)) for each knowledge-injection method, averaged (columnwise) across all experiments in Table 1. over them, to allow for more comprehensive benchmarking. Firstly, we compared the baseline and fine-tuned models and their performance with the RAG component. Secondly, we explored the optimal number of text chunks to add to the context in RAG. Specifically, different values of K ∈ {0, . . . , 5} were employed to analyze the impact on model performance. Finally, we explored 5-shot performance vs. 0-shot. Training Setup We trained all of the models using the unsupervised training procedure described in Section 3.2. For each dataset, we divided the auxiliary knowledge base into equal chunks of size 256 by concatenating or splitting the original chunks based on their length. We also added two special tokens, <BOS> and <EOS>, to demarcate the original chunks' beginnings and ends to preserve the documents' structure. The models were trained using learning rates between 1 × 10 -6 and 5 × 10 -5 , which were found through a hyperparameter search. All models were trained on 4 NVIDIA A-100 GPUs for a maximum of 5 epochs and a batch size of 64. Evaluation method All evaluations were done by appending each of the multiple-choice options to the question, followed by passing the concatenation through the model to get a log probability score per option. The highest score was interpreted as the model's choice and used for accuracy calculation. More formally, this means that in Equation (1) we say that M(q n ) = c n if: where M(q n ∥a l n ) = log P M (q n ∥a l n )."
    },
    {
      "heading": "MMLU Results",
      "text": "For each task and model, we compared four approaches: using just the base model, RAG, FT, and finally combining FT and RAG by using the fine-tuned model as the generator. Furthermore, we tested the MMLU tasks using both 0-shot and 5-shot scenarios. The full results are shown in Table 1. An aggregation of the relative accuracy gain, i.e., where M is the base model and M ′ is the knowledge-injected model, is shown in Figure 2. In all cases, RAG performed significantly better compared to the base models. Furthermore, using RAG with the base model as the generator was consistently better than only fine-tuning. In some cases, using the fine-tuned model instead of the base model as the generator in the RAG pipeline improved results even further. However, this is not consistent and thus demonstrates the inherent instability of fine-tuning. Additionally, we found that the 5-shot approach boosts the results by a small margin in most cases, with a similar trend being observed in all of the different approaches. Current Events Results The evaluation on the current events task is shown in Table 2. RAG proves particularly effective due to the one-to-one correspondence between the questions and the auxiliary dataset (see Section 4.3). Fine-tuning is not competitive with RAG. However, fine-tuning with multiple paraphrases still provides a significant improvement over the baseline. We note that combining RAG with fine-tuning shows inferior performance compared to RAG alone. It is worth noting that although the questions are based on information the models were not exposed to during training, the results of the base models surpass 1 L = 0.25. This can partially be explained by the models using reasoning and/or pre-existing knowledge when answering questions that are not independent of the past information. Some examples of this can be found in Appendix D. Fine-Tuning vs. RAG: In the results of both the MMLU and current events tasks, a significant advantage for RAG over fine-tuning is evident. While fine-tuning improved results compared to the base model in most cases, it was not competitive with the RAG approach. Several factors might contribute to this behavior. Firstly, RAG not only adds knowledge to a model but also incorporates context relevant to the question, a feature lacking in fine-tuning. Additionally, fine-tuning may impact other capabilities of the model due to a degree of catastrophic forgetting. Finally, it's plausible that unsupervised fine-tuned models might benefit from further alignment through supervised or RL-based fine-tuning, as evidenced by the vastly improved performance of Orca2 over the base Llama2."
    },
    {
      "heading": "The Importance of Repetition",
      "text": "Unlike the other tasks, where the model has been exposed to aspects related to the topic during pretraining, current events includes new information. In this case, standard regular fine-tuning not only did not improve the performance of Llama2 but also significantly degraded it. To improve the finetuning results, we explored augmentation of the data using paraphrases. Data Augmentation Data augmentation is a well-established method for enhancing the performance of language models and has been surveyed extensively (Shorten et al., 2021). Using generative models for augmentations has also been used successfully to improve classification models in the past (Sharma et al., 2022). An example of data augmentation using paraphrasing can be found in Appendix C. Monotonic Improvement This approach resulted in notable improvements in our results, showcasing a direct correlation between the number of paraphrases utilized and the models' accuracy. Our experimentation revealed a compelling trend. For all models tested, the accuracy was a monotonically increasing function of the number of paraphrases used (visualized in Appendix A, Figure 4). This observation strongly suggests the positive impact of paraphrase augmentation, yielding information repetition, on the model's ability to comprehend and generalize new knowledge from limited data. Learning New Information In Appendix A, Figure 3, we can see an interesting phenomenon observed throughout our experiments. After each epoch, i.e., completing another iteration over the entire dataset, the training loss drops significantly. This is consistent with what is known about LLMs memorizing the data during training and overfitting (Tirumala et al., 2022). Our hypothesis is as follows: In order to teach pre-trained LLMs new knowledge, the knowledge must be repeated in numerous ways. This is well known for LLM pre-training (Kandpal et al., 2023), and we see in this case that this holds for fine-tuning as well. The rationale for this hypothesis is that mere memorization of sentences does not entail knowledge of their content, as was already shown in (Berglund et al., 2023). By providing the information in numerous forms (like the data augmentation process we used), the various relationships in the data (e.g., a =⇒ b, b ̸ =⇒ c) stand a higher chance of appearing naturally. We believe this can potentially both increase L M,Q in general, as well as ameliorate Berglund et al.'s Reversal Curse. While promising, this result still warrants further research."
    },
    {
      "heading": "Conclusion and Future Work",
      "text": "Large language models possess vast amounts of knowledge on various topics. In this work, we tested their capability to adapt to new knowledge: both specialized and completely unseen. This is among the first studies to compare two prominent approaches in this domain, namely fine-tuning and retrieval augmented generation. While fine-tuning can be useful for many use-cases, we found that RAG is a more reliable choice for knowledge injection. Some aspects of this work still warrant further research. For example, we focused on unsupervised training as our primary fine-tuning method, as opposed to instruction-tuning or RL-based methods. Researching combinations of various techniques, with diverse auxiliary knowledge bases, may yield improved results. This approach, combined with our hypothesis from Section 6, could further enhance our understanding of knowledge injection via FT. While we believe that this work further enhances our understanding of knowledge in LLMs, there is a lot more work to be done in this field. Specifically, more research is required regarding the question of knowledge representation in LLMs, especially from a theoretical perspective. Finally, further efforts are needed to measure knowledge in LLMs. While we employed an empirical approach as described in Equation (2), it is important to explore other definitions and perspectives on knowledge as well, and extend upon this work."
    },
    {
      "heading": "Limitations",
      "text": "As in all machine learning applications, the choice of hyperparameters significantly impacts the results. We therefore strongly recommend optimiz-A The Importance of Repetition Figures"
    },
    {
      "heading": "B RAG Ablation Study",
      "text": "As mentioned in Section 5, we compared various values of K ∈ {0, . . . , 5}, shown in Table 3.We were unable to find an optimal value of K per model, per 0/5-shot, or per task. In fact, other than Anatomy that worked well with K = 2 consistently, there seems to be no patterns that aid in predicting the performance per K, unlike the results presented in (Lewis et al., 2020) for other setups. Moreover, the gap between the best and worst performing Ks can be large. Unfortunately, we must conclude that this additional hyperparameter is unstable. This is a downside of using RAG in practice, and the choice of K cannot be ignored."
    },
    {
      "heading": "C Paraphrase Examples",
      "text": "Below is the prompt we used to generate paraphrases with GPT-4: Your task is to paraphrase a text paragraph. The paragraph is given below. Make sure to keep the same meaning but change the wording. Do not change any factual information. Try to keep roughly the same length of the original text. Give NUM _ PARAPHRASES different paraphrases for each text. These paraphrases should be as different from each other as possible. Return a JSON formatted string with one key, called 'paraphrases', and a list of paraphrases."
    },
    {
      "heading": "Input paragraph:",
      "text": "Below are some examples. First, an example taken from the following Wikipedia page: \"51st International Emmy Awards\"."
    },
    {
      "heading": "Paraphrase I",
      "text": "The fifty-first edition of the International Emmy Awards Competition accepted submissions across all categories from December 7, 2022, until the closing date of February 16, 2023."
    },
    {
      "heading": "Paraphrase II",
      "text": "The International Emmy Awards Competition, now in its 51st year, accepted submissions across all categories starting from December 7, 2022, until the deadline on February 16, 2023."
    },
    {
      "heading": "Paraphrase III",
      "text": "The fifty-first edition of the International Emmy Awards Competition accepted submissions across all categories from December 7, 2022, until the closing date of February 16, 2023. The next example was taken from the following Wikipedia page: \"2023 Indianapolis mayoral election\". Paraphrase I The mayoral election in Indianapolis took place on November 7, 2023, with preliminary elections occurring on May 2. The sitting mayor, Democrat Joe Hogsett, successfully ran for a third term. Both Hogsett and his Republican opponent, Jefferson Shreve, moved on to the main election. Paraphrase II On November 7, 2023, citizens of Indianapolis cast their votes to elect their Mayor, following primary elections on May 2. Joe Hogsett, the Democrat already in office, won his bid for a third term. Hogsett and the Republican candidate, Jefferson Shreve, were the two contenders in the final electoral round."
    },
    {
      "heading": "Paraphrase III",
      "text": "The mayoral election in Indianapolis took place on the 7th of November, 2023, following primary elections that occurred on the 2nd of May. Joe Hogsett, the incumbent Democrat, successfully ran for a third term. Both Hogsett and his Republican challenger, Jefferson Shreve, made it through to the final round of the election."
    },
    {
      "heading": "D Current Events Existing Knowledge Examples",
      "text": "To give a better understanding of how a model might be able to answer questions about new information, with better than random success, we present three possible scenarios as examples. These scenarios show how models with stronger reasoning skills can infer the correct answer even for unseen information. The first scenario involves questions about previously unseen information, where basic reasoning abilities allow a model to make an educated guess. Question: What was a key issue that led to the 2023 United Auto Workers strike?"
    }
  ],
  "figures": [],
  "equations": []
}