{
  "paperid": "2301.04222v4",
  "title": "Geometric phases along quantum trajectories",
  "authors": [
    "Ludmila Viotti",
    "Ana Gramajo",
    "Paula Villar",
    "Fernando Lombardo",
    "Rosario Fazio",
    "M Berry",
    "Y Aharonov",
    "J Anandan",
    "Frank Wilczek",
    "A Zee"
  ],
  "year": 2023,
  "abstract": "",
  "sections": [
    {
      "heading": "Untitled",
      "text": "A monitored quantum system undergoing a cyclic evolution of the parameters governing its Hamiltonian accumulates a geometric phase that depends on the quantum trajectory followed by the system on its evolution. The phase value will be determined both by the unitary dynamics and by the interaction of the system with the environment. Consequently, the geometric phase will acquire a stochastic character due to the occurrence of random quantum jumps. Here we study the distribution function of geometric phases in monitored quantum systems and discuss when/if different quantities, proposed to measure geometric phases in open quantum systems, are representative of the distribution. We also consider a monitored echo protocol and discuss in which cases the distribution of the interference pattern extracted in the experiment is linked to the geometric phase. Furthermore, we unveil, for the single trajectory exhibiting no quantum jumps, a topological transition in the phase acquired after a cycle and show how this critical behavior can be observed in an echo protocol. For the same parameters, the density matrix does not show any singularity. We illustrate all our main results by considering a paradigmatic case, a spin-1/2 immersed in time-varying a magnetic field in the presence of an external environment. The major outcomes of our analysis are however quite general and do not depend, in their qualitative features, on the choice of the model studied."
    },
    {
      "heading": "Introduction",
      "text": "As Berry first stated in his seminal work [1], when a quantum system is prepared in an energy eigenstate and adiabatically driven in a cycle, it acquires, in addition to the dynamical phase, a phase that depends solely on the path traced in the ray space. Being independent of the specific dynamics giving rise to the path, this phase is of geometrical nature. Following Berry's breakthrough, consistent generalizations of the Geometric Phase (GP) have been found for unitary evolutions which are kept cyclic while they are not required to be adiabatic [2], in the presence of degenerate subspaces [3], and for the case in which both the adiabaticity and the cyclicity conditions are removed [4,5]. Further generalizations include the definitions of GPs for mixed states [6][7][8][9][10] and the socalled off-diagonal GPs [11,12], which apply in the case where the initial and final states are orthogonal. GPs are profoundly linked to the theory of fiber bundles and holonomies, bridging geometrical concepts like parallel transport over curved spaces with physics [13][14][15], and contributing in this way to the understanding of quantum mechanics at the foundational level. Since their discovery, GPs have also emerged in most diverse physical systems [16,17], deepening the comprehension of numerous phenomena such as integer quantum Hall effect [18], topological insulators and superconductors [19,20], as well as playing a pivotal role in quantum information processing [21][22][23]. The quest for implementations of geometric quantum information processing has also spurred the search for geometric interferometry in several different setups. The first proposal of this kind was realized in NMR [22]. Thereafter, Berry phases in superconducting qubits were both studied theoretically in [24] and observed experimentally for different regimes of couplings in circuit-QED arrangements [25][26][27][28][29][30]. In this direction, high-fidelity quantum gates were demonstrated with trapped ions [31]. The need to improve the performance of quantum information processing devices against the exposure to external environment has led to the suggestion of non-adiabatic geometric gates schemes [32][33][34][35][36][37]. In this context, it becomes of fundamental importance to understand how geometric interferometry is affected by the presence of an external environment. Consequently, GPs need to be generalized to deal with the systems subject to nonunitary quantum evolution. The effect of fluctuations in the classical control parameters of a quantum cyclic evolution may average out mitigating their effect on the accumulated Berry phase [38]. The presence of an external bath was found to give rise to new geomet-ric contributions to decoherence [39,40], as experimentally detected in [41,42]. Different definitions of GPs applicable in the non-unitary case have been put forward. Tong et al. [43] introduced a purificationindependent formula computed over the reduced density matrix while an average over different histories (trajectories) taking into account system-bath interaction was discussed in Carollo et al. [44,45] and further analyzed in [46][47][48]. Additional work along these lines can be found in [49][50][51][52]. There is, however, a different level of description of open quantum systems which may capture features that are washed out by simply looking at the properties of density matrices. This level is accessed, for example, when the state of the system is continuously monitored. In this case, the quantum system is described by a wave function whose smooth evolution is interrupted by random quantum jumps induced by the coupling with the environment [53]. This sequence of smooth evolutions interrupted by jumps is named a quantum trajectory (see [54] for a recent review on the subject). There are also formal connections between this setting and that emerging in monitored quantum circuits [55], a tractable setting to explore universal collective phenomena as dynamics of quantum information and entanglement [56,57]. Goal of the present work is to describe the properties of accumulated GP along quantum trajectories. In this approach we are inspired by the work of Gebarth et al. [58] where the GPs induced by a sequence of weak measurements stirring the system along a path in a parameter space were analyzed. The randomness introduced by the occurrence of jumps in a given trajectory is reflected in the fact that the GPs inherit a stochastic nature. By random sampling over the trajectories, the entire distribution can be reconstructed. Since the Berry phase is not an observable, the average value does not correspond to the phase accumulated by the average state (this is, the density matrix). Previous works, with the notable exception of [58], either restrict the study of the dynamics of smoothly evolving pure states with no jumps or define average quantities. Understanding the fluctuations of GPs induced by random jumps is to a large extent unexplo"
    },
    {
      "heading": "From Lindblad dynamics to quantum trajectories",
      "text": "Lindblad equation -In order to make a connection with existing literature, it is convenient to set the stage and start from the case in which the state of an open quantum system is described by a density matrix ρ(t). In this case, under proper conditions, the dynamics is governed by the Lindblad equation [63,64] The first term in the r.h.s. of the Lindblad equation accounts for the unitary evolution, while the second originates in the coupling to the environment. The strength and the nature of this coupling are encoded in the Lindblad operators L α . We will consider a Hamiltonian H that depends periodically on time /Ω the period of a cycle in suitable parameter space. The Lindblad operators, if time-dependent, should also be time-periodic It is useful to already at this point briefly comment on the adiabatic limit for slow dynamics as this issue will be central in the analysis conducted along the paper. If the evolution is unitary, for a sufficiently large period T , a system prepared in an eigenstate will remain in the corresponding instantaneous eigenstate up to small corrections due to Landau-Zener transitions between energy levels. In other words, the occupancy of any given eigenstate will not change in time. The situation strongly differs in presence of an environment. In this case, a proper adiabatic limit is not well defined, since the slow driving limit where adiabatic dynamics sets in, is also the regime in which the consequences of the external baths are the most severe and the system reaches a (possibly periodic) steady state. The adiabatic limit itself should be reconsidered [65][66][67][68][69] in an open system, as the existence of a continuum of energy levels makes the energy splittings of the system a bad reference scale for defining the regimes. Effects due to non-adiabaticity and corrections due to the presence of the environment seem thus to be inextricably linked. Monitored dynamics and quantum trajectories -The dynamics of the systems radically change when it is possible to continuously monitor their state. In this case, the state of the system remains pure and consists of intervals of smooth evolution interrupted at random times by abrupt changes called quantum jumps. A sequence of smoothly-evolving intervals together with a set of random events is denominated a quantum trajectory. The literature on the subject is vast and we refer to the following papers and books for a general overview [53,54,70,71] and applications e.g. to many-body systems [72,73]. Evolution is described in this framework as follows. If at time t the state of the system is |ψ(t)⟩, at a later t + δt time it will be with probability p o (t) with probability p α (t) (2) where o, α = 1, .. label the different operators K α inducing dynamical steps Each choice in the r.h.s. of Eq.( 2) represents evolution steps of different characters. The second line corresponds to the occurrence of a jump K α at time t, while the first is a smooth evolution (no jump), albeit altered from unitarity by the fact that acquiring the information that no jumps occurred modifies the evolution of the system. The no-jump operator K o can also be thought of as generated by an effective drift Hamiltonian H o to which it relates in the usual way K o = 1 -i δt H o . The full evolution in a time interval [0, t] is therefore characterized by a sequence of N J jumps of types α i occurring at times t i . We will denote the string of these events ) with 0 ≥ t i ≥ t ∀i, the quantum trajectory. As mentioned above, this framework naturally emerges when the system is continuously and indirectly monitored, so that each trajectory can be viewed as the result of continuous measurements of the environment on a given basis. From this perspective, continuous monitoring may lead to decoherence mitigation by the environment [74], also post-selection and error correction schemes [75,76] have been proposed. The properties of the Kraus operators K o/α guarantee that the probabilities to get a given outcome sum up to one, and the time step δ t should be taken small enough for the first order approximation to be valid, which requires α p α ≪ 1. Averaging over every possible jump sequence one gets back the Lindblad equation [53] in Eq.( 1), the converse implication is not valid, an infinite number of different unravellings give rise to the same Lindblad evolution [54]. We will address this question in Appendix C."
    },
    {
      "heading": "The model",
      "text": "Since we are interested in studying the impact of an external environment on the GPs, we will consider a unitary evolution over which the accumulated GP, in the adiabatic limit, is the Berry phase. To be concrete, we shall consider a spin-1/2 particle in presence of a time-dependent magnetic field B(t) = ω nB (t), whose direction is given by nB = (sin (θ) cos(Ω t), sin (θ) sin(Ω t), cos θ) with fixed polar angle θ and time-varying azimuthal angle Ω t. Such unitary evolution is generated by the Hamiltonian with σ = (σ x , σ y , σ z ); and |0⟩ and |1⟩, the eigenstates of σ z . The instantaneous eigenstates of H(t) are denoted |ψ -(t)⟩ and |ψ + (t)⟩ . Figure 1: Trajectories described by the state of the system on the Bloch sphere under different conditions. The black line corresponds to unitary evolution in the adiabatic limit. The purple line depicting a curly ring corresponds to general unitary dynamics in which non-adiabatic corrections start to be visible. In the presence of an environment, the quantum state can suffer from jumps or can be smoothly driven along the whole evolution. For a system prepared in the exited eigenstate, the orange trajectory corresponds to a fully smooth drift. Differently, the blue path shows a jump that projects the state into the instantaneous ground eigenstate and is afterward smoothly driven. Finally, the light blue path shows a case with several jumps, where the non-adiabatic corrections appear in between the jumps. If the system could be kept perfectly isolated while the direction of B(t) is adiabatically changed in a cycle parameterized by t ∈ [0, T ], with T = 2π/Ω (as shown in Fig. 1), it would acquire an adiabatic (Berry) phase ϕ ± a = -π(1 ∓ cos θ), where the ∓ sign depends on the energy eigenstate in which the system was initially prepared. Lindblad operators -For a system that evolves according to H(t) given by Eq. ( 5) coupled to an en-vironment of harmonic oscillators a consistent timedependent Lindblad equation of the form in Eq. ( 1) can be derived from microscopic considerations as long as the evolution remains sufficiently slow [77,78], with Lindblad operators given by and corresponding to decay, spontaneous excitation, and dephasing respectively. The coupling strengths considered in this work are, in terms of the dissipation ratio Γ, γ -= Γ ; γ d = 0.32 Γ, while we consider γ + to be negligible (all the results that we will show are rather generic and do not qualitatively depend on the chosen values). The jumps defined by Eq. ( 3) from the Lindblad operators above lead, after averaging, to a consistent Lindblad equation for slow dynamical evolutions [79]. The operators introduced in Eq. ( 6) induce transitions and dephasing between the instantaneous eigenstates of the Hamiltonian defined in Eq.( 5). In order to keep the analysis as general as possible, we will include a further term in the Lindbladian which requires considering a fourth operator along a fixed direction in the Bloch sphere. The particular choice of σ z operator as the additional Lindblad operator is motivated by the need of introducing transitions that do not simply involve the instantaneous eigenstates. Any other Lindblad operator that differed from those in Eq.( 6) would lead to similar qualitative conclusions. While the unitary evolution of the closed system will follow the curly path indicated in purple in Fig. 1, the actual dynamics will follow, with some probability, the path indicated in blue (see Fig. 1 for illustrative purposes), i.e. it will be discontinuous and not necessary closed after a cycle of the driving, even in the slow-driving limit. Moreover, the slower the driving, the more jumps will occur (see light blue curve in Fig. 1). The task of the next Sections is to characterize GPs under these conditions. Smooth evolution with no jumps -A particularly interesting quantum trajectory is that which is smooth along the whole evolution. Before addressing the characterization of GPs in indirectly monitored systems, we provide insight into the evolution giving rise to it. When the records of the measurements performed on the environment reveal zero jumps, the dynamics describe a continuous smooth path and is generated by an effective drift Hamiltonian which depends both on the Hamiltonian of the system and the Lindblad operators as described by Eq. ( 3). Within the model considered in our work, the effective drift Hamiltonian H o governing the no-jump dynamics [K o = 1 -δtH o in Eq.( 3)] is given by with f (t) = cos 2 (θ) + sin 2 (θ) sin 2 (Ωt). We highlight the fact that, due to the unitarity of σ z matrix, the no-jump evolution is completely independent of the fourth Lindblad operator L z included ad-hoc and, consequently, from the parameter γ z . An illustrative example of the trajectory generated by the above evolution, referred to as the no-jump trajectory in what comes, is the orange path in Fig. 1. In Appendix D we provide the analytic solution for the dynamics associated with t"
    },
    {
      "heading": "Geometric phases in open systems",
      "text": "As mentioned in Sec. 1, the accumulation of a GP during the dynamics of a quantum system is not necessarily restricted to an adiabatic evolution. For a generic quantum trajectory, consisting of a sequence of smoothly-evolving intervals together with a set of random quantum jumps R, a proper phase that deals with both aspects of evolution can be defined. Considering the evolution in a time interval [0, T ], parameterized with t, the GP associated to a trajectory in which N J jumps are registered at times t i , can be written as where R = R(T, N J ) for brevity, with t 0 = 0 and the convention that t N J +1 ≡ T in the sum of integrals. The definition of GP as given in Eq.( 9) will be at the basis of our analysis and we refer to Appendix A for a derivation of this expression. As it is evident from the dependence on the times and nature of the jumps, the phase ϕ[R(T, N J )] will be a stochastic variable, dependent on the trajectory R(T, N J ). The first term in Eq. ( 9) is the total relative phase between the initial and final states. The remaining terms are of two different kinds, reflecting the properties of the dynamics itself. The second term features the dynamical phases accumulated along the in-tervals of smooth evolution that take place before, between, and after jumps, and which should be subtracted in order to access the purely geometrical object ϕ R . The occurrence at time t i of a jump generated by the operator K αi introduces a contribution arg ⟨ψ(t i )| K αi |ψ(t i )⟩ given by the Pancharatnam phase difference ϕ 1→2 P = arg ⟨ψ 1 |ψ 2 ⟩ between the state before and after the jump. Such terms, arising when the path traced by the state shows discontinuities [4,5], can also be thought of as the GP accumulated along the geodesic arc in the Hilbert space that fills the discontinuity by joining both states. The expression in Eq. ( 9) is independent of the U (1) gauge choice. It neither requires the trajectory to trace a close path in the state space nor relies on adiabaticity condition. Moreover, it does not even demand unitarity as it is well defined also if the states |ψ(t i )⟩ or |ψ(t ′ )⟩ are not normalized (the norm should, however, be non-vanishing). Suitable to be applied to the trajectories that emerge in master equation unraveling, Eq. ( 9) has been employed in limiting forms for addressing the definition of GPs fitting non-unitary evolution. A first explored route was to focus on the no-jump trajectory [44,45]. This approach, which disregards the possibility of quantum jumps by restricting to the smooth evolution, preserves the well-known definitions of GPs applicable to pure states and includes environmental effects through the non-hermiticity of which trivially reduces to the expression for the GP accumulated in the most general unitary evolution [5] when this is indeed the case, and therefore the states are instantaneously normalized, rendering the denominator ⟨ψ(t)|ψ(t)⟩ ≡ 1 ∀ t. Eq.( 10) also reduces to Aharonov-Anandan and Berry phases as the conditions required by each definition are fulfilled, namely, for cyclic and unitary while not necessarily adiabatic evolution and for both cyclic and adiabatic evolution. Note that phase ϕ 0 is ill-defined if some internal product on its argument vanishes, this observation will become of relevance when discussing the topological transition in Section 5.3. Several other works consider the full Lindblad equation unraveling, suggesting to define the GP of the ensemble-averaged state ρ(t) as an average over the ensemble of phases {ϕ R } = ϕ {R} obtained by applying Eq.( 9) to each trajectory [44][45][46]. It has been extensively discussed whether this is a proper definition of a GP for the density matrix representing the state of the system as it does not allow for a one-toone relation between the set of density matrices and the obtained GP values [47,48,80]. Finally, a different approach introduces a generalized GP defined directly from the reduced density matrix [43]. The expression reads where λ k (t) and |ξ k ⟩ are the instantaneous eigenvalues and eigenstates of the density matrix ρ(t) which describes the state of the system. Even though defined for non-degenerate but otherwise general mixed states, when computed over pure states under unitary evolution, reduces to the unitary expression of the GP. All the above-mentioned proposals of GPs applicable when dynamics are non-unitary either restrict to modified evolutions on which pure-state GP definitions would be applicable or seek a consistently defined GP for the reduced density matrix ρ(t), which accounts for an averaged description. Stochastic processes, however, arising from master equation unraveling, acquire independent physical relevance in continuous monitoring schemes. As anticipated in the introduction, the randomness introduced by the occurrence of jumps in a given trajectory reflects in the GPs acquiring a stochastic nature itself. This approach, therefore, requires a study of the environ"
    },
    {
      "heading": "Geometric phase distribution P [ϕ]",
      "text": "We investigate in this section the distribution of the ensemble {ϕ R } = ϕ {R} of GPs obtained by applying Eq. ( 9) to each individual realization (trajectory) of the evolution, characterized by some set R(T, N J ). In Fig. 2 we show two representative cases in which the corresponding dynamics of a hypothetical unitary evolution would either be faster (with small but non-zero non-adiabatic corrections) or slow enough to be considered in the adiabatic regime while the environment remains the same, characterized by the dissipation rate Γ = 10 -3 ω, which leads to γ -= Γ, γ d = 0.32 Γ, and negligible γ + . We first attend the case with γ z = 0, in which the environment induces jumps involving instantaneous eigenstates only. The two situations, corresponding to the two sets of parameters indicated before, are shown in Fig. 2, in panels (a) and (b) respectively. In both panels, we also plot for reference the adiabatic (Berry) result, the no-jump and unitary GPs, and the average of the distribution. Being the Berry phase independent of Ω, it is exactly the same for both cases, this is, ϕ a ∼ 1.482π. For the parameters chosen, the value ϕ 0 computed from Eq.( 10) over the trajectory with no jumps, shows small deviations from ϕ a . While the values of these characteristic GPs are similar, the entire distribution of the monitored system is dras- tically different on each panel. In the first case of faster driving, the period T is such that a considerable amount of times the evolution is completed registering no jumps, with the mean number of jumps over the ensemble NJ = 0.63. The narrow peak in the Figure shows these cases of entire smooth evolution. In addition, there is a small background revealing the accumulated GP along those trajectories where jumps occurred. The composition of the ensemble is reflected in the histogram by the presence of a large contribution, corresponding to ∼ 50% of the realizations, due to the no-jump GP-value and the remaining 50% of the counts distributed in a broad way over the possible GP values. This broad background distribution can be easily interpreted as the randomness inherited by the GP due to the (random) time at which the jump occurred. A single term ⟨ψ(t i )| K -i |ψ(t i )⟩ in Eq. ( 9), denoting a contribution to the GP from a jump at time t i , successfully accounts for the background when considering all possible jump-times. The peak in the distribution agrees well with both the adiabatic and the no-jump values. The average phase, on the other side, is a bit off due to the small and poorly structured background, broadly distributed over 2π. This clearly demonstrates that even a single jump occurring at a random time leads to very large fluctuations in the accumulated GP. In the case with slower driving shown in panel (b) the mean number of jumps over the set of trajectories is NJ = 1.77. This means that the state of the system is much more likely to undergo an abrupt change, or even more than one, in each realization of the cycle. As expected, the distribution of GPs becomes much wider, and a sharp peak around ϕ 0 is not visible anymore. Higher-order cumulants become necessary to understand the dynamics. The three lines, corresponding to the adiabatic, nojump, and average GPs do not provide thorough information on the dynamics of the monitored system. The rate Ω/ω at which the magnetic field is rotated has thus a direct impact on the distribution of GPs. For larger rates, the system is exposed to the environment for a shorter period of time, but deviations from the adiabatic regime become non-negligible. On the other hand, lowering the driving frequency might result in the system being exposed to environmental effects for too long, implying strong corrections to ϕ R from ϕ + a . Fig. 3 shows the distribution of GP-values obtained along a range of different Ω/ω rates which include the cases presented in Fig. 2. For high enough frequency, the distribution shows a sharp peak around the no-jump value of the GP and almost no background counts. On the other hand, this no-jump value deviates considerably from the Berry phase. The broad background visible in panel (a) of Fig. 2 develops as the frequency rate is lowered and the relative period grows. Further on, the background turns into a second peak, while the one in the no-jump value decreases. For the smaller rate values, the distribution shows the behavior depicted by panel (b) of Fig. 2, this is, a broad single-peaked distribution. This regime shows non-negligible environmental effects also over the GP associated with the no-jump evolution, which deviates from the adiabatic result even though the driving is performed slowly. We refer to Appendix D for an analytical expression of the dependence of this deviation on the different parameters involved. The broadening exhibited by the distribution as the frequency rate decreases is reflected in the increment of the distribution variance. We note that, for variables described on a c"
    },
    {
      "heading": "Distribution of interference fringes in a spin-echo protocol",
      "text": "If the system is prepared in an eigenstate of the Hamiltonian and subsequently driven in a cycle, adiabatically and in absolute isolation from the environment, then the quantum state accumulates a Berry phase that can be measured by implementing a spinecho protocol [81]. It goes as follows. The system is initially prepared in a superposition state |ψ(0)⟩ which reads in terms of the ground and exited instantaneous eigenstates of H(0). Then, it is driven for a period T , causing each eigenstate to acquire both a dynamical and a geometric phase ϕ ± a . A spin-flip operation and a second cycle in the opposite direction lead to a cancellation of the dynamical phases, resulting in a purely geometric relative phase. Berry phase can thus be extracted through state tomography [25,27,82] or by realizing that the probability for the system to be back in the initial state once the full evolution is completed, the persistence probability, is related to the Berry phase as |⟨ψ(0)|ψ(2 T )⟩| 2 = cos 2 (2 ϕ + a ) [83]. The relation between the persistent probability and the GP given above relies on two factors: the adiabatic regime preventing the transitions between eigenstates and the exact cancellation of the dynamical phases during the protocol. If an echo experiment is performed on a system that is exposed to the effect of the environment and continuously monitored, the persistence probability will retain its dependence on the dynamical evolution. Nevertheless, it is worth understanding to which extent it is possible to learn features of GPs in a monitored system through an echo protocol. For each realization of the protocol, characterized by a sequence of jumps R(2 T, N J ), we can parametrize the persistent probability P R through an associated angle φ R Both the persistence probability and the parameter φ R inherit the stochastic character of the trajectories, with the probability of measuring a given value φ related to the probability of the trajectories as In the limiting case in which the persistence probability approaches its adiabatic value, φ will approach ϕ + a . Away from that particular regime, φ R is NOT equal to the GP ϕ R = ϕ[R] but, as mentioned previously, a convenient parametrization of the spin-echo interference fringes. The non-adiabatic and environment-induced deviations from ϕ + a can be analyzed by examining the ensemble {φ R } = φ {R} that is obtained by computing Eq. ( 13) for each individual realization of the protocol. This study will also allow seeking possible relations, if any, between the stochastic behavior of the GPs and that of experimental outcomes (note that φ R is defined modulo π/2 and up to a sign, therefore, any relation between the distribution of GPs and the distribution of the experimental results should take this into account). The frequency Ω at which the magnetic field is rotated is expected, once again, to have a direct impact on the distribution [36,37]. On increasing the relative value of Ω, the system will be exposed to the disruptive influence of the environment for shorter times, allowing to a larger extent a partial cancellation of the dynamical phases. At the same time, in this regime, non-negligible deviations from the adiabatic results will be unavoidable. On the other hand, smaller values of Ω might result in the system being exposed to environmental effects for too long, leading to strong deviations of the echo-parameter values φ from ϕ + a . In analogy with what we did in section 5.1, we examine first the case γ z = 0 and present, in Fig. 6, two representative cases in which the hypothetical unitary evolution would either be faster or slow enough to be considered within the adiabatic regime. These are shown in panels (a) and (b) of Fig. 6 respectively. In both panels, we also display the adiabatic Berry phase ϕ a (which does not depend on Ω), the GP ϕ 0 obtained in a no-jump evolution, and the GP ϕ u obtained in general unitary evolution. The φ value obtained from an echo experiment which is completed without detecting jumps is also shown. For the parameters chosen, both panels show very small deviations of φ extracted in a protocol with no jumps from the Berry phase (see the insets in Fig. 6). It should be noted, however, that the probability of registering this specific trajectory is different in the two cases, as can be seen in the differences in the full P [φ] distributions. The first striking feature that comes out is the presence of three distinct sharp peaks. The broad distribution observed in the GP values completely disappears in the spin-echo. This behavior originates from the fact that when γ z = 0, only jumps between instantaneous eigenstates are possible. This particular aspect of the unravelling leads, when combined with the properties of the persistence probability, to a distribution of interference fringes qualitatively different from that of the GPs. Each of the peaks shown in panel (a) of Fig. 6 can be understood as arising from a different set "
    },
    {
      "heading": "The distribution changes radically when γ",
      "text": "In what follows we discuss the case γ z = 0.1 Γ with Γ = 10 -3 ω. We start re-considering the two representative cases of fast and slower driving, displayed in panels (a) and (b) of Fig. 8 respectively. The first noticeable aspect is that, while three peaks observed in Fig. 6 (indicated here by the blue contours) can still be detected, they are now coexisting with a broad distribution. As visible in panel (a) of Fig. 8, the three peak heights discussed previously decrease in the presence of γ z . The suppression of the peaks is accompanied by the appearance of a broad background distribution covering the entire range. Panel (b) of Fig. 8 attends the slow driving situation, in which the probability to have a jump, and even several, along each trajectory, grows. The inclusion of the L z jump modifies the sharp-peaked distribution into a broad one, which covers the entire range of φ values. In partic- 1.275 1.325 1.375 1.425 1.475 ϕ/π 0 1 2 3 4 P [ϕ] 1e 1 (a) 1.475 1.480 0 2 4 1e 3 1.275 1.325 1.375 1.425 1.475 ϕ/π 0 1 2 3 4 5 P [ϕ] 1e 2 (b) 1.3625 1.3875 0.0 2.5 5.0 7.5 1e 1 ular, the two peaks connected to the no-jump trajectory disappeared. The inclusion of this term in the Lindbladian induces jumps into states other than the eigenstates of the Hamiltonian. In this sense, we may consider the results quite generic, not specifically dependent on the choice of the Lindblad operator. In order to get a more complete view of the effect of a finite γ z , Fig. 9 shows the distribution of φ-values as a function of Ω/ω. For a fast-driven evolution in which almost no jumps are detected, the behavior exhibited by the distribution is similar to that observed in the γ z = 0 case. When the velocity of the driving is reduced, gradually favouring the occurrence of jumps, the effect of introducing a finite γ z value becomes more relevant. The L z jumps lead to φ values that do depend on the time at which the jump took place and hence biuld up a broad background. Summarizing, while the distribution of interference fringes is, in general, quite different from that of the phase accumulated along a single trajectory, the analysis of a spin-echo protocol allows to extract reliable information on both the no-jump trajectories and the adiabatic (Berry) phase in some regimes of parameters. In the following Section we will concentrate on the no-jump trajectory (the kind of smooth evolution associated to the side-peaks of the probability distribution emerging in the echo-protocol) and show that undergoes a topological transition as a function of the coupling to the environment."
    },
    {
      "heading": "Topological transitions",
      "text": "As already anticipated, we conclude this analysis of GPs in monitored systems by focusing on the no-jump trajectory. We will show, following in spirit the work in Ref. [58], that the drift jump-free dynamics encode a topological transition. We would like to emphasize that, although the setting is very much different from that of [58], we believe that the nature of the transition is the same. Our analysis is a strong hint to the conjecture that this type of transition is rather generic for monitored systems. Phase diagram -The GP ϕ 0 given by Eq. ( 10) depends, for every fixed θ, on the ratios Ω/ω and Γ/ω. We recall the no-jump trajectory, and therefore the GP associated with it, have no dependence on γ z . Plotted as a function of the above-mentioned parameters, the GP shows discrete singularities at critical points, around which it makes a 2π winding. Meanwhile, the probability associated with this particular trajectory vanishes at these points. We stress that, being the initial state of the system the eigenstate |ψ + (0)⟩ of H(0), the null probability condition ⟨ψ(0)|ψ(T )⟩ = 0 implies a final state |ψ -(T )⟩, meaning a singular point if found when full population transfer is attained within a time-interval t ∈ [0, T ], and refer to Appendix D for details on the analytical derivation. Fig. 10 shows a color plot of the GP in the Γ -Ω diagram at fixed values of the angle θ. The range of the parameters is shown to highlight the singular point and the 2π winding of the GP around it. The white lines indicate the probability for the nojump trajectory, which approaches zero on reaching the singularity. We will show that the collection of these singular points delimits regions of the parameter space associated with different topological classes of evolution. This will be done by defining a topological invariant n ∈ Z (see below) and explicitly showing it takes different values over different regions of the parameter-rates plane. Topological transition in the no-jump trajectory -Direct inspection of the effective drift Hamiltonian shows that, if the magnetic field points in the zdirection, the exited eigenstate |ψ + ⟩ of H(t) remains fixed in a pole of the Bloch sphere independently of the values taken by the parameter rates Ω/ω and Γ/ω. Therefore, the GP associated with the no-jump trajectory identically vanishes (mod 2π) for θ = 0 and θ = π. Without loss of generality, the mod 2π free-dom can be eliminated from the GP by simultaneously setting ϕ 0 (θ = 0) = 0 and demanding continuity. In this way, ϕ 0 (θ = π) is completely determined by the evolution and acquires a value where n is an integer number that characterizes the dependence of the GP with θ for fixed parameter values. Being an integer, n constitutes a topological invariant because it can not be changed by smoothly deforming ϕ 0 (θ). As a consequence, if the GP is characterized by different values of n as a function of the various parameters, this will impose the GP to undergo a non-smooth transformation, as the singular behavior exhibited in Fig. 10. Indeed, points in the parameter space slightly to the right and slightly to the left of the singularity (indicated with crosses in Fig. 10) give rise to no-jump evolutions associated with topological invariants n = 0 and n = 1 respectively, thus identifying different topological classes. To explicitly show this, Fig. 11 compares the behavior as a function of θ of these GPs by means of showing the difference ∆(θ) between them. Given two points, say ( 1) and ( 2) and labelled by crosses in Fig. 11, ∆(θ) is defined as This difference is seen to vanish (up to some smooth small deviations) up to θ = 0.34π, this is, until the angle of the singularity. At this specific θ value the GP obtained from each parameter rate abruptly deviates, so that their difference shows a step and settles around ∆ = 1 for the remaining range. The different topological numbers n is reflected by the value ∆(π) = 1 for θ = π. Over the full parameter space, the GP shows several singularities, with locations that depend on the value of θ. The set of singular points composes two counter-phase oscillating curves that define a chain of concatenated closed regions and split the parameter-rate space into an upper and lower region. This is shown in panel (a) of Fig. 12. Parameters within each sector lead to the same n value. The area below the sequence of closed regions is characterized by n = -1. The points given by parameter values Γ = 0 and Ω/ω ≪ 1, defining the adiabatic regime, belong to this region. The regions in between the lines are topologically trivial sectors with n = 0, while the upper one is characterized by n = 1. It is worth pointing out that these topological sectors are not equally probable. Besides the singular points of vanishing probability, the probability of attaining a trajectory with no jumps increases as Γ is reduced. This implies that the upper topological sector is less probable than the others. Topological transition"
    },
    {
      "heading": "Conclusions",
      "text": "In this paper, we have studied geometric phases in a continuously monitored quantum system. In absence of any coupling to the environment, the cyclic timedependence of the Hamiltonian leads, in the adiabatic regime, to the Berry phase, and to its consistent generalization for a generic unitary evolution. The presence of an environment induces quantum jumps so that in a single realization of the dynamics the wave function, following a given quantum trajectory, accumulates a GP that is itself a stochastic quantity. We have analyzed the distribution of GPs by highlighting the interplay between non-adiabatic effects and the influence of the external environment. We have shown that for slow drivings the distribution of phases is broad because of the several different occurrences of jumps at random times. On speeding up the driving, the number of jumps reduces and the distribu-tion becomes peaked around the no-jump trajectory (still deviating from the Berry phase because of the non-adiabatic correction and the non-Hermitian drift term). A first quantitative measure of the distribution has been given by the variance, discussed in Fig. 4. In order to have experimental access to the GPs along a given trajectory, we have also analyzed a spinecho protocol. The structure provided by the jump operators taken together with the possibility of level transitions due to non-adiabaticity and the characteristics of the persistence probability can be set in such a way that they lead either to the observation of broad distributions or extremely sharp peaks. This interplay should be thus considered in order to be explored as a tool or otherwise, the experiment is rendered uninformative. We have finally concentrated on the no-jump trajectory, showing that it undergoes a topological transition as a function of the dissipation strength. Interestingly, this transition is not necessarily connected to singularities occurring in the dynamics of the density matrix. Indeed, for the model considered herein, at the transition point occurring in the no-jump trajectory the behavior of the density matrix is smooth. Despite the striking differences shown between the GP and the interference fringes of an echo experiment, traces of this transition can be observed in the behavior of the interference fringes. In this work, we have considered a specific model for the jump operators corresponding to a well-defined type of monitoring. However, it is important to understand to which extent the properties we have discussed here depend on the type of unravelling. This question might be of particular relevance, especially if one wants to define topological properties associated with Markovian systems starting from the properties of their trajectories (there are infinite ways of unravelling the same Lindblad dynamics). A glimpse on this question is summarised in Appendix C where we consider an unraveling corresponding to a homodyne detection. For what concerns the distribution the qualitative pictures we have outlined in the body of the paper remain valid although important quantitative differences may arise."
    },
    {
      "heading": "A Pancharatnam phase along a quantum trajectory",
      "text": "As stated in section 2, the quantum trajectory emerging in a single monitored evolution of the system can be understood as intervals of smooth dynamics interrupted at random times by quantum jumps. Considered in this way, evolution in a time interval t ∈ [0, T ] is characterized by an array of jumps of type α i occurring at times t i of the form given by Eq. ( 4), and the parameter t is a continuous variable within the intervals delimited by the t i 's. In the quantum jumps approach, the algorithm applied in constructing the trajectories goes as follows [53]. The time interval [0, T ] is discretized into N steps of length δ t. and the state is consistently updated at each time step according to a randomly-decided non-hermitian operator, as described in Eq. ( 2). Hence, each quantum trajectory can also be thought of from an algorithmic point of view as the ordered collection of states generated by the action of a specific sequence of operators K 0,α given by Eq. ( 3), and is in this way a discrete set of states. For a sequence of N discrete pure states, the suitable GP expression is Pancharatnam phase [5,44,45], and is given by (17) The Pancharatnam phase is independent of the U (1) gauge choice and does not require the sequence to close, rely on adiabaticity condition or demand for unitarity, allowing for non-normalized states in the sequence, as long as non of them perfectly vanishes. Exhibiting these characteristics, it becomes a natural definition of GP to be applied to monitored dynamics, in which evolution is generated by non-hermitian operators. It equals the unitary GP associated with the trajectory build-up from joining consecutive states in the sequence by the shortest geodesic in the Hilbert space. While this definition does not imply any constraint on the number of states in the sequence by itself, when applied in the context of quantum jumps the number N of states is constrained from below as a consequence of the condition reigning the time step. An evolution in time-interval [0, T ] consist of N = T /δ t ≫ 1 states. Splitting the sequence of states {|ψ 1 ⟩ |ψ 2 ⟩ ... |ψ N ⟩} into sets starting and ending at those corresponding to the specific times t i where a jump is registered, sets a bridge between this two different descriptions of a quantum trajectory. Each time interval [t i , t i+1 ], discretized in time-steps of length δt, consist of a number of steps that depend on the specific values of t i and t i+1 . From a given jump-time t i , any time-step in the consecutive interval can be found as t i + k i δt, this is, by adding some amount k i ∈ N of increments δt, up to some maximum value k * i that satisfies t i+1 = t i +k * i δt (See Fig. 14). At each given time, the outcome of a measurement performed on the environment will be associated to the corresponding Kraus operator acting on the system and the state generated by its action. Therefore, there is a to a one-to-one correspondence between the discrete set conforming the time interval and the array of states forming the trajectory. The splitting at jump-times t i can thus be mapped into the trajectory as with N J the number of jumps occurring in the trajectory and the out-bounds indexes i = 0 and i = N J + 1 signaling the entire time-interval limits t 0 = 0 and t N J +1 = T . Introducing such a decomposition into the formula for Pancharatnam phase, Eq. ( 17) can be re-written as The formula in Eq.( 9) for the GP is thus associated with a single trajectory is derived by taking the continuous limit δt/T → 0 within the intervals of smooth evolution [44,45]. This expression, more suitable for the exam performed in our work, inherits all the properties of the Pancharatnam phase from which it is obtained."
    },
    {
      "heading": "B Interference fringes distribution",
      "text": "As discussed in Sec. 5.2, the distribution of interference fringes from an echo experiment, which we parameterize with φ, shows three (sometimes sharp) peaks. When γ z = 0 only jumps between instantaneous energy eigenstates are possible, and the three peaks emerge from sets of trajectories of a different character as follows. 1. Smooth protocols with no jumps generate the piling up in the no-jump value φ 0 ∼ 1.43π 2. Protocols in which at least one decay or spontaneous excitation jump occurred, projecting the state into an eigenstate |ψ ± (t i )⟩ of H(t), give rise to the peak at φ ∼ 1.375π. 3. Protocols in which only dephasing jumps took place give rise to the peak at φ ∼ 1.275π. In this appendix, we provide a detailed justification of this observation. With the aim of providing an accessible presentation of the qualitative aspects of the phenomena, we will generally disregard the non-hermiticity of the smooth evolution between jumps, thinking of those intervals as unitary (slowly or rapidly driven) evolution. Hence, this presentation should not be taken as a rigorous quantitative analysis. We begin with the consideration of the peak (1.) coinciding with the no-jump value φ 0 ∼ 1.34π. As presented in Sec. 2 this smooth trajectory is unique and therefore the exact same value of φ will be expected on every case in which this trajectory is obtained. We thus turn to the case in which jumps are indeed detected, with special care on the anti-intuitive shrinking of the distribution in the slower regime in which more jumps are detected. When γ z = 0 three jumps are possible within our unravelling of the Lindblad equation. Two out of these three jumps project the state into an energy eigenstate, namely, decay jumps and spontaneous excitations. Whenever a jump of this kind takes place at some instant of time t i , immediately after the jump the state of the system turns into with ξ(t i ) the dynamical phase and ϕ(t i ) the geometrical phase, given by Eq. ( 9) accumulated up to the occurrence of the jump. If the protocol ends immediately after, the persistence probability P R = | ⟨ψ(0)|ψ(2T )⟩ | 2 = 1/2 preserves no information on either the GP or the specific characteristics of the jump. If, on the other hand, the system continues to evolve, the possibility of obtaining any information on a phase or the jump time will rely on the interplay between the non-adiabatic transitions and the existence of further jumps. If the evolution continues from the first jump on, this will happen smoothly until either the protocol is finished or another jump takes place. Different regimes of Ω/ω give rise to the smooth evolution of different natures. If the protocol is performed slowly enough, this smooth evolution is (almost) transition-free and |ψ(t)⟩ ∼ e i ξ(t>ti)+i ϕ(t>ti) |ψ ± (t > t i )⟩, so the result obtained for the persistent probability remains to be P R = 1/2. Moreover, this regime favors the occurrence of further jumps, thus reinforcing the erasing of information by re-projecting into eigenstates of H(t). The complete independence of the result on the times t i of the jumps makes this peak (2.) extremely sharp in the slow regime. On the other hand, if the system is driven faster, along the smooth evolution after the jump the state develops contributions from the other eigenstate due to non-adiabatic effects, favoring the emergence of relative phases and becoming with A ± (t) the amplitudes for each eigenstate. In such a situation, the persistence probability depends on t i , leading to the broadening observed in the central peak of Fig. 7 for faster driving, while still not trivially connected to the GP. As anticipated in the previous paragraphs, each jump of this kind will erase all information on the phases and any dependence on previous jump times. The possibility of further erasing events is mitigated in faster protocols by the reduction of exposure to the environment. The third peak (3.) observed in the distribution at φ ∼ 1.475π can be understood by adding dephasing jumps to the previous discussion. A dephasing jump has the effect of introducing a π shift in the relative phase of the state. If the evolution afterward remains transition-less (and no erasing jumps occur at any point), the evolution resembles that of the adiabatic echo experiment up to corrections that can be disregarded, so the persistence probability takes the value P ∼ sin 2 (2ϕ a ) (with cos replaced by sin due to the relative π shift). This situation leads to a well-defined single φ-value which is independent of the time t i at which the jump took place. Therefore, in the slow-driving range, a well-defined peak emerges, that might however be small, as in this regime decay jumps are likely. As the magnetic field is rotated faster, non-adiabatic effects induce a dependence on t i on the persistence probability. This dependence on t i is inherited by the \"phases\" extracted, and thus responsible for the broadening of the distribution observed in Fig."
    },
    {
      "heading": "C Dependence on the unravelling: field displacement",
      "text": "Another paradigmatic quantum trajectories scheme arising from a different unraveling of the master equation is that of the so-called diffusive trajectories, in which the monitored quantities produce continuously fluctuating signals instead of discontinuous jumps [84]. This is the prototypical scheme of continuous or ideal homodyne detection, which can be theoretically obtained as a limiting case of the mentioned discrete homodyne detection [70,71,80,85,86]. The master equation Eq. ( 1) is invariant under the transformation where √ λ ∈ R. Therefore it is possible to substitute K α and H(t) in Eq. ( 1) by K ′ α and H ′ (t) without modifying the averaged dynamics of the system and unravel it using the standard direct detection (quantum jumps) scheme applied before. When the reservoir is assumed to be made of harmonic modes, like electromagnetic radiation, adding the displacement √ λ to the Lindblad operators corresponds to the implementation of homodyne detection [71,85,87]. In this case, taking √ λ suitably large leads to a measurement of the quadrature of the system dipole K α +K † α . However, in order to keep the collapse probability per step small, it would be necessary to reduce the time step and hence increase the simulation time by the same order. For this reason, we refrain to consider finite large √ λ values in this section and focus on the modifications suffered by P [ϕ] for smaller √ λ values. In Fig. 15 we present, also for the case of this different unravelling of the Lindblad equation, the two cases in which the driving is performed faster or slow enough for the hypothetical unitary dynamics to be considered adiabatic. As in the previous cases, the environment remains fixed with Γ = 10 -3 ω and γ z = 0, and we have taken λ = 2.5 × 10 -5 ω < Γ. The two cases are shown in panels (a) and (b) of Fig. 15 respectively, where we also plot the no-jump and unitary GPs, and the average of the distribution for reference. Striking differences from the case of direct detection arise. For this λ/ω ≪ 1, the reference values displayed remain close to those obtained in the λ = 0, while the distributions behave differently. In the fastdriven case displayed in panel (a), the expected increase in jumps is reflected by the decrease of the sharp peak piling up from no-jump trajectories. However, the formerly broad, but still uneven background, has now turned into a completely uniform distribution in which each phase value (but the no-jump) is evenly probable. The described behavior is reinforced when the system is driven at slower frequency rates. The previously broad while single-peaked distribution lacks, in a system monitored through the operators K ′ α forming the new basis, of any structure."
    },
    {
      "heading": "D Smooth evolution with no jumps: analytic approach",
      "text": "We provide in this Appendix some additional analytical results for the no-jumps evolution. As previously mentioned, this particular case can be thought of as generated by the non-hermitian Hamiltonian in Eq. (8), in such a way that a non-normalized state ψ(t) will follow Schrodinger's equation i d dt | ψ(t)⟩ = H o (t) | ψ(t)⟩ (23) where H o (t) is not only non-hermitian but also explicitly time-dependent due to the function f (t). The effective drift Hamiltonian shares eigenstates with H(t), but the eigenvalues associated with these eigenstates are now complex and time-dependent, given by ±ω/2 [1 -i Γ/(2ω)f (t)]. The dynamics of the normalized state of the system |ψ(t)⟩ = | ψ(t)⟩ ⟨ ψ(t)| ψ(t)⟩ (24) will be governed by the more involved, nonlinear equation which is found by jointly differentiating Eq. ( 24) and making use of Eq. ( 23). The not-normalized state can be expanded into the instantaneous eigenstates of H o (t), as ψ(t) = c+ |ψ + (t)⟩ + c-|ψ -(t)⟩. Explicit computation of Eq. ( 23) leads to the following differential equations for the coefficients c± (t) where the real term ∼ -Γc + (t) indicates that even in the case with no jumps, the presence of the environment favors state transitions, as the amplitude of the excited eigenstate is suppressed. Taking into account the normalization procedure involved in turning from the not-normalized state into the real, normalized one, this suppression implies a population transfer from the excited eigenstate into the ground state. As a consequence, any trivial implementation of the adiabatic approximation is prevented. A second feature observed in Eq. ( 25) is that, for the parameters chosen in this work, a good agreement can be obtained by replacing f (t) with its mean value f (t) ∼ 1 -sin 2 (θ)/2. By performing this replacement, dynamics become easily solvable in the rotating frame. The smooth evolution of each eigenstate of the system is, within this approximation, given by ψ (±) (t) = N ± e -iΩ/2 t ±(ν + ε)e -iε/2 t ∓ (ν -ε)e iε/2 t |ψ ± (t)⟩ -Ω sin(θ) |ψ ∓ (t)⟩} , (26) where both ν and ε are complex quantities given by ν = ω -Ω cos(θ) -i Γ/2(1 -sin 2 (θ)/2) and ε = ν 2 + Ω 2 sin 2 (θ), N ± is a normalization factor. At this point, it should be stressed that Eq.( 26) explicitly shows how the state ψ (±) (t) obtained when evolving an eigenstate will not be equal to the instantaneous eigenstate at a later time in the general case. Geometric phase -The GP associated with a trajectory in which no jumps can be explicitly computed from Eq. (10). While the general expression is quite involved, it takes, for small rates Ω/ω ∼ Γ/ω of the driving frequency and the dissipation rate to the amplitude of the magnetic field, the form e -4π Im(ν)/Ω -1 2 Im(ν)/Ω , where the first term in the r.h.s is the Berry phase. The term in the second line of the equation is the main correction originating exclusively from nonadiabaticity, in otherwise unitary evolution. The third line accounts for the non-trivial effect of the environment in the no-jump evolution. As Γ → 0 this term turns into a further contribution due to nonadiabaticity. Phase diagram singularities -When computing the accumulated GPs analyzed in Sections 5.1 and 5.3 we have taken |ψ + (0)⟩ as our initial state. Thus, a vanishing probability for observing this particular trajectory, of the kind observed at the GP singular points, requires |ψ(T )⟩ ∼ |ψ -(T )⟩. Considering the cyclic character of the instantaneous eigenstates, this means a singular point will take place whenever a full population transfer is achieved exactly in a time period. It was already inferred from the differential equations governing the evolution of the c± coefficients, that the dynamics generated by the effective drift Hamiltonian H o (t) favored transitions from the excited to the ground instantaneous eigenstate. As long as the original approximation remains accurate, the singular points of the GP will be defined through the equation (ν + ε) -(ν -ε)e 2iπε/Ω = 0. No-jump interference fringe -In Section 5.2, we have studied the interference fringes of an echo experiment. For this purpose, we've defined the convenient parameter φ given by Eq. ( 13). Restricting to the case of a protocol performed without registering any jump, it was shown that the value of φ displays, generally, better agreement with the Berry phase than with the GP ϕ 0 accumulated by the state of the system under equal conditions, this is, when it is smoothly driven along one period of time. As long as the nojump value φ ∼ ϕ a , good agreement between this \"phase\" and the GP will be obtained when the second and third lines in Eq. ( 27) are sufficiently small. However, it is worth noting that the φ value will not remain close to the Berry phase for arbitrarily small driving frequency. While the protocol has shown to be less sensitive to both non-adiabatic and environmentally induced effects than the GP, it will account for the non-ideal conditions. It was already shown that the "
    }
  ],
  "figures": [
    {
      "caption": "Figure 10 :",
      "image_path": null
    },
    {
      "caption": "Figure 11 :",
      "image_path": null
    },
    {
      "caption": "Figure 12 :",
      "image_path": null
    },
    {
      "caption": "Figure 13 :",
      "image_path": null
    },
    {
      "caption": "Figure 14 :",
      "image_path": null
    },
    {
      "caption": "Figure 15 :",
      "image_path": null
    }
  ],
  "equations": []
}