{
  "paperid": "2402.04936v1",
  "title": "Quantum control by effective counterdiabatic driving",
  "authors": [
    "Francesco Petiziol",
    "Florian Minter",
    "Sandro Wimberger",
    "E Torrontegui",
    "S Ibáñez",
    "S Martínez-Garaot",
    "M Modugno",
    "A Del Campo",
    "D Guéry-Odelin",
    "A Ruschhaupt"
  ],
  "year": 2024,
  "abstract": "We review a scheme for the systematic design of quantum control protocols based on shortcuts to adiabaticity in few-level quantum systems. The adiabatic dynamics is accelerated by introducing high-frequency modulations in the control Hamiltonian, which mimic a time-dependent counterdiabatic correction. We present a number of applications for the high-fidelity realization of quantum state transfers and quantum gates based on effective counterdiabatic driving, in platforms ranging from superconducting circuits to Rydberg atoms.",
  "sections": [
    {
      "heading": "I. INTRODUCTION",
      "text": "This Perspective reviews a framework to construct quantum control protocols based on accelerated adiabatic evolutions, falling into the class of so-called shortcuts to adiabaticity (STAs) [1][2][3]. A STA attempts to realize the same dynamics obtained by means of a slow adiabatic variation of the control parameters, but in a shorter time. This acceleration is possible, since the STA gives up on following an eigenstate of the instantaneous driven Hamiltonian at all times, and admits temporary excursion into other states instead. STAs theoretically guaranteeing exact tracking of the adiabatic states can be constructed based on reverse-engineering procedures, but their direct experimental realization is often challenging due to the necessity to control additional degrees of freedom. The paradigmatic example of an exact STA, which we deal with in the following, is known as transitionless or counterdiabatic (CD) driving. It has its origins in the adiabatic control of atoms and molecules [4][5][6], and its theory was developed in [7,8]. The problem of implementing new controls, not already present in the Hamiltonian describing the adiabatic drive to be sped up, led to the development of approximate CD pulses in many setups [9][10][11][12][13][14][15][16]. The framework reviewed here attempts to overcome this difficulty, by providing a systematic method to approximate a CD Hamiltonian with initially available controls. It builds on the use of time (quasi-) periodic forcing, which is well understood within Floquet theory [17][18][19]. Using periodic drives is one of the most established methods to control atomic [20][21][22][23][24][25][26][27][28][29][30], molecular [31,32] and spin systems [33,34], for instance. The basic idea of the method reviewed is to create the new Hamiltonian terms in an effective manner [28][29][30], through a suitable highfrequency modulation of operators already contained in the original adiabatic Hamiltonian. Experimental reali- * sandromarcel.wimberger@unipr.it sations of exact or approximate CD driving were shown for Bose-Einstein condensates [35], NV centers [36,37], ions [38,39], NMR [40], superconducting circuits [41][42][43][44][45], or molecules [46]. We review the CD method in the next section, and then introduce the effective CD driving in the following one. After showing a selection of the-by now-many application, we conclude in the last section with an outlook on further advances."
    },
    {
      "heading": "II. COUNTERDIABATIC DRIVING",
      "text": "CD driving builds on a Hamiltonian Ĥ0 (λ) + ĤCD (λ), which generates exactly, in finite time, the same evolution obtained through Ĥ0 (λ) in the limit of an infinitely slow variation of the parameter λ = λ(t). Considering the instantaneous energies E n (λ) and eigenstates |n λ ⟩, such that Ĥ0 (λ)|n λ ⟩ = E n (λ)|n λ ⟩, any quantum state can be written as |ψ(λ)⟩ = n a n (λ)|n λ ⟩. Schrödinger's equation for the expansion coefficients a n (λ) then reads The first line on the r.h.s, including the Berry connection i⟨n λ |∂ λ n λ ⟩ [47], describes the accumulation of dynamical and geometric phases, while the second line describes nonadiabatic transitions among the instantaneous eigenstates. Such transitions can be exactly canceled by changing the original Hamiltonian to Ĥ0 (λ) + ĤCD (λ), with Then, in Eq. ( 1), only the diagonal part remains, and no transitions to other instantaneous eigenstates occur by arXiv:2402.04936v1 [quant-ph] 7 Feb 2024 construction. In the presence of near-degeneracies, care must be taken since the denominators may grow very fast. In a finite system, states that exactly cross belong to different symmetry sectors and then the sum in Eq. ( 2) must be disjointed into such sectors. We can immediately picture the CD Hamiltonian for a two-level system with driven Hamiltonian where {σ x , σy , σz } are the Pauli matrices. This gives For a Landau-Zener (LZ) linear scan with λ(t) ∝ t, the CD pulse f CD (t) has Lorentzian shape in time. Equation (4) shows what motivates the next section: ĤCD (λ) requires control of new operators (Pauli σy ), which were not present in Ĥ0 (λ) before. This turns out to be a recurring theme for generic adiabatic problems and, for certain classes of Hamiltonians, it can also be proven formally [12]. This issue makes the direct practical implementation of ĤCD (λ) challenging, motivating the search for approximate methods. An intuitive explanation of why one generically expects ĤCD (λ) to contain operator components not included in Ĥ0 (λ) can be given as follows. The CD field can be understood as the generator of a continuous unitary transformation Ûλ (λ) which diagonalizes Ĥ0 (λ), for each value of λ. Indeed, it can be rewritten as ĤCD (λ) = λ Âλ , where Âλ = iℏ∂ λ Ûλ Û † λ generates continuous translations with respect to λ, and has thus been termed adiabatic gauge potential [48]. A variation of the Hamiltonian can then be expressed as ], which highlights that the variation of the instantaneous basis is ruled by Âλ . One can then verify that the adiabatic gauge potential is orthogonal (for instance, with respect to the Hilbert-Schmidt inner product) to both Ĥ0 (λ) and ∂ λ Ĥ0 (λ), and hence to the space spanned by those two operators. Unless the latter are a linear combination of a full set of operators spanning the whole operator space, and in the absence of particular symmetries, ĤCD (λ) will then typically contain new operators. The natural question arises: if ĤCD (λ) cannot be implemented directly, can it still be approximated with the control parameters at hand, yielding an effective shortcut to adiabaticity? Ref. [12] answered this question positively using quantum control theory [49], by showing that -i ĤCD (λ) belongs to the dynamical Lie algebra L of the controlled systems, for any value of λ. This formalizes the concept that the evolution generated by -i ĤCD (λ), for arbitrary λ, is always approximated arbitrarily well by a suitable time development of the control functions c i (t) of the control Hamiltonian where the operators Ĥi are those composing Ĥ0 (t), namely such that Ĥ0 (t) ∈ span({ Ĥi } i=1,...,N ) for all times. L is defined as the smallest algebra spanned by {-i Ĥi } i=1,...,N and all possible nested commutators [-i Ĥl , [. . . , [-i Ĥj , -i Ĥk ]] . . . ]."
    },
    {
      "heading": "III. EFFECTIVE COUNTERDIABATIC DRIVING",
      "text": "For the two-level system from above, an effective counterdiabatic (eCD) Hamiltonian, which approximates ĤCD (t) without controlling new operators, is given by This Hamiltonian (assuming Ω > 0 and λ > 0 for all times) does indeed contain only the same operators as Ĥ0 (t) and hence avoids the use of new controls. It comes at the cost of adding sinusoidal drives, and it approximates the true ĤCD (t) well for large ω. Note that, while Ĥ0 (t) of Eq. ( 3) is purely real and thus invariant under time-reversal, the CD field of Eq. ( 4) is purely imaginary and breaks such a symmetry. The periodic forcing in Eq. ( 6) achieves this effectively through the anti-phase time dependence (co-sinusoidal and sinusoidal) of the σx and σz components, 'circularly polarised' in the x -z plane. Note also that the amplitude of the eCD field depends explicitly on λ(t): eCD is not in competition with other methods to accelerate adiabatic protocols by optimising λ(t) [50][51][52], but can be directly integrated with them for a combined speed-up. In the following, we derive the form of the eCD Hamiltonian in Eq. ( 6) from a systematic procedure, based on matching the evolution operator generated by an ansatz with the exact CD one, order by order in a Floquet-Magnus expansion for large ω. Effective CD construction. The starting point for approximating ĤCD (t) is the Hamiltonian of Eq. ( 5). An ansatz is chosen to parametrise the control functions c i (t), whose free parameters are then fixed by enforcing that Û (t) = T exp(-i t 0 Ĥ(t ′ )dt ′ ), where T denotes time ordering, approximates ÛCD (t) order by order in a perturbative expansion. The latter follows closely the paradigm of Floquet engineering [26,28,29], though applied to the approximation of a time-dependent, rather than constant, Hamiltonian. We discretise the total protocol time τ into small steps T , within which the CD Hamiltonian ĤCD (t) is approximated as constant to order T . The CD field is discretised as Ĥ[n] CD = ĤCD (nT + T /2), with n ∈ N and an error of order O(T 3 ) [53]. The functions c i (t) are parametrised as time-periodic with angular frequency ω = 2π/T , using a truncated Fourier series with L harmonics of ω [54], The discretisation of time in steps of T also defines sets of driving amplitudes {A [n] ij } pertaining to the nth time interval. Within each interval, we can apply Floquet theory [55], thanks to the time periodicity of c i (t): the evolution operator admits a decomposition in the form Û (t) = K(t)e -i ĤF t , where ĤF is the Floquet Hamiltonian governing the stroboscopic dynamics, Û (T ) = e -i ĤF T , while K(t) is a periodic operator, K(t+T ) = K(t), reducing to the identity at stroboscopic times t = nT . Hidden in the definition of ĤF is a dependence on the initial time t 0 [or, equivalently, on the global phase of the oscillating functions in Eq. ( 7)], which we do not explicitly indicate, and the choice t 0 = 0 is assumed in the following. The role of driving phases will be discussed below. The Floquet Hamiltonian ĤF can be computed systematically by means of a Magnus expansion in powers of ω -1 [28,29]. This has the form ĤF = ĤF,n with first terms reading [55,56] ĤF,1 = H 0 , The quantities H m represent Fourier components of Ĥ(t), namely H m = (1/T ) T 0 Ĥ(t)e -imωt dt. We ask for the eCD and CD evolutions to coincide stroboscopically. For each time interval in the discretisation, we thus force Ĥ CD by using the constant amplitudes {A [n] ij } as free parameters. It is clear that the smaller the period T , the better the target evolution ÛCD (t) is sampled, and so in general Ĥ(t) must oscillate quickly with respect to the original time-dependence of Ĥ0 (t) and ĤCD (t). In this limit, one further expects that the amplitudes found in nearby intervals will be close in value, and thus an interpolation is possible yielding smooth controls c i (t). A single harmonic (L = 1) can be sufficient to impose matching of the evolution to leading order in ω -1 . Raising the number of harmonics L in Eq. ( 7) introduces more free parameters that can be used to fulfil also the constraint equations produced by higherorder Magnus terms ĤF,n , improving the quality of the eCD approximation in a systematic manner. In manybody systems, such multi-tone drives also allow one to control complex many-body interactions [57,58]. Two-level problem. After having introduced the general method, the anticipated Eq. ( 6) for the LZ problem of Eq. ( 3) is derived to illustrate the above ideas. Adopting a combination of the operators σx and σz that compose Ĥ0 (t), the eCD Hamiltonian is chosen of the form Ĥ(t) = c x (t)σ x + c z (t)σ z . To achieve compensation to first order in T at stroboscopic times, we use a single harmonic (L = 1) in Eq. ( 7), and we choose the parametrisation A global phase ϕ has also been explicitly included to illustrate and discuss the role of driving phases below. The non-vanishing Fourier components of Ĥ(t) are Computing the Floquet Hamiltonian accord"
    },
    {
      "heading": "A. Micromotion and driving phase",
      "text": "With eCD, the effective Hamiltonian generated by the control fields approximates the CD Hamiltonian at stroboscopic times. What happens at intermediate times, in-between two full periods? Deviations from the dynamics generated by the Floquet Hamiltonian are described by the micromotion operator K(t). Analogously to the Floquet Hamiltonian, this can also be approximated through the Magnus expansion [55,56]. It reads K(t) = e n>0 ω -n Fn(t,0) , where the leading order term F 1 (t, t ′ ) reads Already from the expansion of K(t), one can see that the micromotion reduces to the identity in the limit ω → +∞. Therefore, as ω increases, not only the stroboscopic dynamics will match the adiabatic one closer, but deviations around the latter will also be suppressed for all times. This is illustrated in Fig. 1"
    },
    {
      "heading": "(b).",
      "text": "As mentioned above, the phase relation between σx and σz components in Ĥ(t) plays a crucial role, as it effectively reproduces the time-reversal symmetry breaking imposed by the exact ĤCD . But what is the role of the global phase of the drives, and the impact of phase imperfections? As clear from the derivation of the eCD field for the two-level problem, the global phase ϕ of Eq. ( 12) does not change the leading-order term in the Floquet Hamiltonian, ĤF,2 , but it affects higher-order terms. Therefore, although for different choices of ϕ the target CD dynamics is always reproduced to leading order, the deviations due to higher-order terms exhibit a dependence on ϕ. For some values of ϕ, accidental error compensation may then also occur, yielding a fidelity increase. A relative phase offset between the σx and σz components has a more dramatic impact instead, since it also alters ĤF,2 . A detailed analysis of such static-phase effects is found in Ref. [60]."
    },
    {
      "heading": "IV. APPLICATIONS: QUANTUM STATE TRANSFERS",
      "text": "We discuss now the application of the eCD scheme to specific problems, in particular for the realization of shortcut-to-adiabatic quantum state transfers and quantum gates."
    },
    {
      "heading": "A. fmod-STIRAP",
      "text": "A first application of the effective CD method is in the context of STIRAP [61,62]-one of the most widespread adiabatic quantum control protocols. In its basic formulation, STIRAP enables population transfer between two states |0⟩ and |2⟩ which do not possess a direct matrix element, being it forbidden, for instance, by selection rules. This is achieved by separately coupling |0⟩ and |2⟩ to an intermediate state |1⟩ with time-dependent pulses. A key feature of STIRAP is that it realises this desired population transfer without populating the intermediate state, thus not allowing leakage out of state |1⟩. This is possible, since the STIRAP pulse sequence keeps the system in an instantaneous dark state at all times, which never overlaps with state |1⟩ [61]. The application of the exact counterdiabatic approach to STIRAP was the first example showing that the implementation of CD fields is typically challenging [7]: the CD pulse necessitates a direct coupling between the initial and target state, which by assumption is not possible. In rotatingwave approximation (RWA), the STIRAP Hamiltonian in two-photon resonance [61], including the exact CD pulse Ω CD (t) [7,63,64], reads where ∆ 1 is the single-photon detuning. Ω ± (t) are typically referred to as pump (-) and Stokes (+) pulses. Following the eCD recipe, an eCD field approximating Ω CD (t) is constructed by adding new Fourier components to the pump and Stokes Rabi frequency at eCD frequency ω, Ω ± (t) → Ω ± (t) + Ω eCD (t) cos(ωt + ϕ ± ) [65]. Owing to the additional sidebands in the pulses, this protocol was dubbed frequency-modulated (fmod-) STIRAP [65]. As in the LZ case, the necessity to emulate a purely imaginary second-order coupling fixes the phase relation between the pulses to ϕ + -ϕ -= π/2. Imposing that the oscillations reproduce the CD Rabi frequency then fixes the eCD amplitude to Ω eCD (t) = ωΩ CD (t). A comparison of the final protocol (in)fidelity obtained by STIRAP and its accelerated eCD counterpart is shown in Fig. 2 for different values of the Rabi frequency and delay d between the Gaussian-shaped [65] pump and Stokes pulses. These results highlight how the eCD correction gives access to much larger fidelities, and in a much broader parameter regime, as confirmed by recent experiments [45]. Approximate CD fields for STIRAP implemented in a superconducting qubit [43], building on earlier proposals [63,64,66] can be understood as an eCD field similar to fmod-STIRAP, but using single-exponential (single sideband), rather than (co)sinusoidal (symmetric sidebands), additional pulses. A consequence of this is the generation of additional effective light shifts that must be compensated for, which would instead be cancelled by construction in fmod-STIRAP."
    },
    {
      "heading": "Bell states in circuit quantum electrodynamics (QED).",
      "text": "A second example is the preparation of entangled Bell states with two qubits dispersively coupled to a photonic mode, acting as a quantum bus [59]. This setup describes, for instance, a circuit QED system of transmon qubits coupled to a common microwave resonator [67][68][69]. The system Hamiltonian can be written in the form Ĥ = ĤQ + ĤQR + ĤR , where ĤQ = i=1,2 Ω i σz i /2 and ĤR = ω R â † â are the bare qubit and resonator Hamiltonians respectively, while ĤQR = i=1,2 g i (σ + i â + σi â † ) describes the qubit-resonator coupling in RWA. Here, â † and â represent creation and annihilation operators for photons in the resonator, respectively. When the qubits are close to resonance with each other (Ω 1 ≈ Ω 2 ), in the dispersive qubit-resonator regime (|Ω i -ω R | ≫ g), the resonator mediates a second-order effective coupling between the qubits of strength g = g 1 g 2 /[2(Ω 1 -ω r )], describing a flip-flop interaction g(σ 2 ). The single-excitation eigenstates at resonance are thus entangled Bell states |B ± ⟩ = (|01⟩ ± |10⟩)/ √ 2. In Ref. [59], an adiabatic preparation protocol of such states is developed. An initial offset in the qubit frequencies is ramped down adiabatically until resonance is reached, where an avoided crossing of width ∼ 2g signals the second-order coupling. Assuming Ω 1 > Ω 2 , the adiabatic evolution maps |01⟩ → |B + ⟩ and |10⟩ → |B -⟩ up to phase factors. However, the second-order nature of the coupling requires long ramping times to avoid excitations, and the application of a shortcut is thus particularly instrumental. When computing numerically the exact counterdiabatic field for this protocol, its major component is a timedependent interaction ĤCD (t) = ih(t)(σ ). An eCD field for this problem is constructed in Ref. [59] by considering time-dependent modulations of the qubitresonator couplings. Such modulations are directly possible in tuneable-coupling superconducting qubits [70], or can be interpreted as the effect of modulations of the resonator-qubit detuning (i.e. of the qubits' or resonator's transition frequencies). The eCD correction takes the form The performance, in combination with different choices for the adiabatic ramp function, shows a substantial speed-up of the protocol at desired fidelity values [59]. This is exemplified in Fig. 3 for a selection of sweep functions. By combining an optimised ramp with eCD, the protocol infidelity can be improved by orders of magnitude in comparison to a simple linear ramp."
    },
    {
      "heading": "V. (SHORTCUT-TO-)ADIABATIC QUANTUM GATES",
      "text": "Going beyond individual state transfers, eCD fields are used to speed up full quantum gates building on adiabatic evolution, thus finding immediate applications in quantum information processing. Gate synthesis is in general a more challenging task, since it requires implementing a whole unitary, rather than controlling the evolution for one specific initial state only. We briefly discuss two ex-amples, where the eCD framework is used to speed up an arbitrary single-qubit gate based on a modified STI-RAP protocol and a geometric controlled-phase gate in Rydberg atoms."
    },
    {
      "heading": "A. fSTIRAP-based single-qubit gate",
      "text": "The first example is the acceleration of an arbitrary adiabatic single-qubit gate based on a modified version of STIRAP, known as fractional STIRAP (fSTIRAP) [71]. The latter implements the STIRAP pulse sequence with modified pump and Stokes pulses, which depend on two new parameters η and χ that control the final superposition state obtained, ψ fin (η, χ) = cos(η)|0⟩-e -iχ sin(η)|2⟩. By implementing a sequence of two non-resonant (∆ 1 ̸ = 0) fSTIRAPs, one with pulse order swapped, a complete gate Û (η, χ) = cos(2η) e iχ sin(2η) -e -iχ sin(2θ) cos(2θ), (16) is obtained. A double fSTIRAP is needed, since a single one would introduce an unwanted phase spoiling the gate. This adiabatic gate can be accelerated by using an eCD correction identical in matrix form to the fmod-STIRAP case, for χ = 0, but involving a Rabi frequency adapted to the new shape of the pump and Stokes pulses pulses. Details on the exact shape of the eCD pulse and a performance study are found in Ref. [65]. Geometric two-qubit gate from Rydberg blockade. In the context of Rydberg atoms [72][73][74], a controlled-phase two-qubit gate between neighbouring atoms can be realised, based on the accumulation of Berry phase over a cyclic operation, by exploiting the Rydberg blockade effect [75]. To reach high fidelities, strong Rabi frequencies would be desirable to enhance adiabaticity, but, at the same time, they increase the value of an additional dynamical phase imprinted to the state, which scales roughly as the ratio between Rabi frequency and Rydberg blockade. The latter phase is unwanted, and represents a gate imperfection, such that a compromise between this error and nonadiabatic errors must be accepted at finite V . Both issues can be mitigated by eCD [76]. The eCD field, besides counteracting nonadiabatic effects, is able to bypass the creation of the unwanted phase by approximating ĤCD (t) without implementing also the original adiabatic pulses, which are responsible for the dynamical phase. Moreover, Ref. [76] proposes an approximation for a separable pulse to overcome the problem that the CD pulses typically require control on additional qubit-qubit interactions which are hard to implement."
    },
    {
      "heading": "VI. CONCLUSION",
      "text": "We reviewed the construction of effective CD fields for accelerating quantum control protocols based on adiabatic driving. We discussed some applications spanning from the realisation of high-fidelity state transfers to the design of full quantum gates. A natural outlook is to extend these methods towards STAs for truly many-body quantum systems. For large systems, the problem of approximating the CD field is further complicated by the fact that the exact CD field cannot be determined neither analytically nor numerically, when exact diagonalisation of Ĥ0 (t) is over-demanding [48,77]. A variational method to derive approximate CD fields without knowledge of the spectral properties has been developed in [77], and used to propose a systematic method to Floquet-engineer STAs [13], similar in spirit to the approach reviewed here. An interesting perspective is to combine the latter methods in order to broaden the range of STA protocols for quantum many-body dynamics."
    }
  ],
  "figures": [
    {
      "caption": "Figure3. End-of-protocol infidelity vs. the duration τ for the preparation of a Bell state in circuit QED. The curves correspond to the adiabatic (dashed) and eCD (solid) cases, with the different colours corresponding to the different ramp functions of same colour in the inset. Besides the linear LZ ramp (black), the ramps include a locally-adiabatic sweep",
      "image_path": null
    }
  ],
  "equations": []
}