{
  "paperid": "2409.03084v1",
  "title": "Quantum geometric protocols for fast high-fidelity adiabatic state transfer",
  "authors": [
    "Chris Meinersen",
    "Stefano Bosco",
    "Maximilian Rimbach-Russ",
    "S Glaser",
    "U Boscain",
    "T Calarco",
    "C Koch",
    "W Köckenberger",
    "R Kosloff",
    "I Kuprov"
  ],
  "year": 2024,
  "abstract": "Efficient control schemes that enable fast, high-fidelity operations are essential for any practical quantum computation. However, current optimization protocols are intractable due to stringent requirements imposed by the microscopic systems encoding the qubit, including dense energy level spectra and cross talk, and generally require a trade-off between speed and fidelity of the operation. Here, we address these challenges by developing a general framework for optimal control based on the quantum metric tensor. This framework allows for fast and high-fidelity adiabatic pulses, even for a dense energy spectrum, based solely on the Hamiltonian of the system instead of the full time evolution propagator and independent of the size of the underlying Hilbert space. Furthermore, the framework suppresses diabatic transitions and state-dependent crosstalk effects without the need for additional control fields. As an example, we study the adiabatic charge transfer in a double quantum dot to find optimal control pulses with improved performance. We show that for the geometric protocol, the transfer fidelites are lower bounded F > 99 % for ultrafast 20 ns pulses, regardless of the size of the anti-crossing.",
  "sections": [
    {
      "heading": "I. INTRODUCTION",
      "text": "Coherent control of quantum information is the central part of the advancement of emerging quantum technologies such as quantum processors, quantum sensors, and quantum communication [1]. However, the inherently fragile nature of quantum states makes their coherent control a challenging task. Much research is dedicated to finding so-called quantum optimal control protocols, that allow fast and high-fidelity operations by appropriately shaping the control pulses [2,3]. Optimized initialization and readout protocols are of particular interest, as they are an integral part of any error correction algorithm [4]. To achieve a fast and high-fidelity protocol, one has to carefully compose pulse shapes to avoid undesired transitions, which are summarized in shortcut-to-adiabaticity methods [5][6][7][8][9][10]. Through the addition of new control fields, one can suppress these transitions [7,[11][12][13][14][15]. However, this approach requires additional experimental overhead and precise control of new driving parameters. Approximate methods, based on the minimization of diabatic transitions, circumvent new control fields and only affect the experimentally accessible parameters while providing fast and quasiadabatic (fast-QUAD) protocols [16][17][18]. Unfortunately, these methods cannot be straightforwardly generalized to bigger parameter spaces and beyond transitions between two energy levels. Most protocols are based on classical optimization problems, which are computationally challenging for larger systems [19][20][21] and hence make purely numerical methods unattractive. Geometric approaches, including the space curve quantum control [8,9], allow for a simple geometric understanding of noisy time dynamics [22]. Notwithstanding, this geometric picture is limited because it relies on the computation of the time evolution operator and is hence constrained to small system sizes [8,9]. In addition, the derived pulse shapes are natively discontinuous due to the closed-curve and closed-area constraints of the formalism. Similar constraints on the control field to suppress first-, and second-order errors can also be found in [23]. In this work, we develop a general geometric approach to provide a general framework, based on geodesics provided by the quantum metric tensor [24][25][26][27][28][29][30][31], that can be generalized to any multi-level Hamiltonian and allows for fast and high-fidelity adiabatic operations. We refer to this approach as the geometric fast-QUAD. Our geometric fast-QUAD does not require imposing any new external control fields like in the counter-diabatic approach, it is resistant to miscalibration errors and allows for fast operations even in dense energy landscapes. It reduces undesired level transitions and the state-dependent crosstalk in the qubit operation and initialization/readout phases. In addition, since it does not require the computation of the full time-ordered evolution operator, we can easily adjust it to allow for operational flexibility of different quantum platforms. We show the advantages of the geometric fast-QUAD through an optimal protocol for initialization and readout of semiconductor spin-qubits. Semiconductor spin qubits are a platform for quantum computing based on confined semiconductor quantum dots with a promise to be scalable [32,33], with long coherence times [34], operability at high temperatures [35,36], and their similarity in fabrication to the classical semiconductor industry [37][38][39]. However, their small size can lead to dense energy spectra that may hinder fast and high-fidelity quantum control. For reading out and initializing such qubits, the measured signal is typically enhanced through spin-to-charge conversion techniques [40,41]. Common spin-to-charge techniques, such as Pauli-Spin-Blockade (PSB), rely on an adiabatic transition between a spin and a charge state [42] passing through multiple anticrossings. We illustrate advantages of the geometric fast-QUAD through optimizing the PSB initialization and readout in a double quantum dot (DQD) with experimentally feasible parameters. The paper is structured as follows. In Section II, the 1. Schematic representation of the geometric fast-QUAD approach with the example of a qubit Hamiltonian. First, one defines the system Hamiltonian and the respective parameters x µ = (x 1 , x 2 , x 3 ) one wants to optimally operate. The number of parameters defines the dimension of the quantum metric tensor gµν . For a qubit Hamiltonian, the underlying parameter manifold is the Bloch sphere. The geodesic on the sphere (red line) gives the optimal path connecting two states. Examples of non-optimal state transfer protocols (x µ 1 , x µ 2 ) are drawn as blue and purple, dotted lines. general framework is introduced, starting with the geometric formalism, relating optimal protocols to geodesics, and applying it to a general qubit Hamiltonian. Subsequently, in Section III, upon reviewing the general DQD model in the pr"
    },
    {
      "heading": "A. The quantum metric",
      "text": "Optimal control schemes rely on the control of parameters x µ = (x 1 , x 2 . . . , x n ) of the physical Hamiltonian to provide high-fidelity state transfer. The task of optimizing the fidelity of state transfer can be captured in the geometric structure of the Hilbert space through the quantum metric tensor [27]. The quantum metric tensor g µν describes the infinitesimal distance between two pure states via the local infidelity (up to second order in parameter changes) [26,44] 1 Here, x µ ∈ M, where M is the set of all possible parameter values, define a set of parameters that define an embedding for the set of pure states P (H) = H/U (1). For Greek indices, we will opt for the Einstein summation convention. The quantum metric tensor constitutes the real and symmetric part of the full quantum geo-metric tensor q µν = g µν + iΩ µν , whose antisymmetric component Ω µν is related to the Berry curvature, which captures topological effects [45][46][47][48] allowing for a possibility to straightforwardly connect quantum dynamics and topology. The quantum metric tensor, with respect to a given target state, |ψ 0 ⟩, can conveniently be written in terms of the Hamiltonian Ĥ, its eigenvalues E n , and eigenvectors {|ψ n ⟩} where ∂ µ = ∂/∂x µ is the derivative with respect to the parameters of the Hamiltonian."
    },
    {
      "heading": "B. Minimal energy fluctuations and geodesic equations",
      "text": "The quantum metric tensor g µν allows us now to connect fast and quasi-adiabatic (fast-QUAD) dynamics with the geometry of the parameter space. For coherent population transfer, experimentally controlled parameters can be written as x µ (t). State transfer is then given by a path connecting the set of initial parameter values x µ i ≡ x µ (0) to some final set x µ f ≡ x µ (t f ). The task of fast and high-fidelity population transfer then relates to the optimization problem of finding an optimal path x µ geo (t) between these two points described by the following functional This functional describes the length of a path x µ (t) parametrized by time t and can be minimized for -p(t f ) via quantum geometric protocols for a single qubit system (8) as a function of pulse time t f . As the quantum metric tensor ( 9) is independent of ϕ we can choose a protocol exclusively for ρ(t) or for the ratio θ(t) = arctan2(ρ(t), z(t)). Using the quantum adiabatic protocol (4) we find analytically that θgeo(t) = (θ f -θ0) t/t f + θ0, where the adiabaticity is given by the ramp rate δ = (θ f -θ0)/t f . We also simulate the pulse numerically, as indicated by ρgeo(t). Remarkably, the two methods align even up to the minimum transfer error. Throughout these simulations the values of ϕ = 0, ρ0 = -10 GHz, ρ f = 10 GHz, z = 0.1 GHz have been used. Note that the precision of the numerical simulations determines the singular behavior (gray area) in the transfer error. functions x µ geo (t) (See Fig. 1) that solve the Euler-Lagrange equations, which in this context are known as the geodesic equations. For adiabatic protocols, the geodesics have a conserved quantity, namely the total energy, which leads to the geometric adiabatic condition (See Appendix A) Here δ can be interpreted as the adiabaticity parameter. Since the above relationship minimizes the local infidelity (1), the geodesics also minimize the energy fluctuations [49] σ motivating the name of the adiabaticity δ = σ 2 E . If we restrict ourselves to a single parameter x µ = ε(t), we can solve for the adiabaticity parameter as follows Therefore, adiabatic protocols can be understood as paths that minimize locally the length of the path that they trace out, i.e. short geodesics with respect to the time t f . The above equation also converges to the quantum speed limit bound for pure states as found in [49]. Finally, this allows us to draw a connection between adiabatic dynamics and geometry. To find an optimal time evolution of ε(t), we need to solve Unsurprisingly, this is similar to the known fast-QUAD equation [16][17][18], differing from the historical fast-QUAD equation only by an additional exponent of 2 of the energy splitting in the denominator [50]. In contrast, however, it allows for a clear extension to multiple energy levels. In the remainder of the article, we refer to Eq. ( 7) as geometric fast-QUAD equation."
    },
    {
      "heading": "C. Two-level system",
      "text": "The geometric structure of Hilbert space allows us to optimize adiabatic population transfer. For instance, a two-level Hamiltonian in cylindrical coordinates (ρ, ϕ, z) leads to the quantum metric tensor resembling the Bloch sphere (see Appendix A) Here θ = arctan2(ρ, z) describes the azimuthal angle of the Bloch sphere. Figure 2 shows the simulated probability p(t f ) = | ⟨ψ 0 (t f )|ψ(t f )⟩ | 2 under adiabatic evolution for the standard linear protocol ρ linear (t) = (ρ fρ 0 ) t/t f + ρ 0 and the geometric protocol as defined in Eq. ( 4). Using the quantum adiabatic protocol (4) we find analytically that [44] where θ 0 , θ f are the initial and final values of θ(t). Remarkably, our analytic expression θ geo (t) and the fully numerically simulated pulse ρ geo (t) cannot be distinguished. In both cases, because of the minimization of the energy fluctuations, the transfer errors arising from undesired diabatic transitions are drastically reduced with respect to the linear protocol. The geometric fast-QUAD can be easily extended to an arbitrary multi-level system as illustrated in Eq. ( 2). In addition, the quantum metric tensor only scales with the number of control parameters and is hence also useful for large systems, making it a reliable tool for analyzing and optimizing large-scale quantum architectures."
    },
    {
      "heading": "III. APPLICATION: CHARGE TRANSFER IN A DOUBLE QUANTUM DOT",
      "text": "Given the advantages of the quantum metric tensor, we aim to apply the geometric fast-QUAD for the adiabatic initialization and readout processes. We model an effective model for a double quantum dot (DQD) system that may be used directly for the initialization and readout of singlet-triplet qubits [41,[51][52][53][54]. After providing a brief overview of the microscopic model in III A, we investigate a truncated two-level model of the full model in Sec. III B, to extend the previous result of a two-level Landau-Zener problem to one in the presence of ST - coupling [51,52,55]. Following, in Sec. III C, we will introduce a low-dimensional effective DQD model, which captures the spin-to-charge transition, while taking into account the spin state. Using this model, we will aim to provide a detailed analysis and comparison of the geometric fast-QUAD with the linear protocol under coherent and non-unitary noise. In the remaining text, we will work in units of ℏ."
    },
    {
      "heading": "A. Full model",
      "text": "The results in the single qubit case (Fig. 2) can be extended to the full 6x6 DQD [56,57], consisting of two spins in the lowest orbitals of two quantum dots. The Hamiltonian is a sum of the Fermi-Hubbard Hamiltonian and the Zeeman Hamiltonian where the spin-degenerate part is described by the Fermi-Hubbard model where ĉ † j,σ (ĉ j,σ ) creates (annihilates) a fermion on sites j with spin σ. The fermionic number operator is nj = σ ĉ † σ,j ĉσ,j , Ũ and U ij are the intra-and inter-dot Coulomb repulsion, Ω is the tunnel coupling originating from the overlap of the wavefunctions in nearby quantum dots, and V i are the chemical potentials in each dot. The spin degeneracy is lifted through the Zeeman term where µ B is the Bohr magneton, ⃗ σ = (σ x , σ y , σ z ) T is the Pauli vector consisting of the conventional Pauli matrices, B j a = b G j ab B b the effective magnetic field and G j ab the g-tensor at site j. The indices a, b = x, y, z run over the spatial components. Additionally, we define E a = E a,1 + E a,2 and ∆E a = E a,1 -E a,2 as the total Zeeman energy and the Zeeman splitting difference, which may arise due to a spatially varying g-factor as usually found in germanium-based platforms [55,[58][59][60][61][62] or a magnetic field gradient as appears in silicon-based architectures with an additional micromagnet [42,[63][64][65]. The matrix representation in the full basis is given in Appendix B."
    },
    {
      "heading": "B. Truncated two-level model",
      "text": "Here, we restrict our optimization protocol to suppress only the transition of the ground state to the closest state. This way we effectively work in a low-energy twodimensional subspace of the full 6x6 DQD, which in the eigenbasis takes the schematic form The state |T -⟩ = |↓↓⟩ is initialized by shifting the detuning ε(t), which is the difference of the left and right chemical potentials of each dot ε := V L -V R . Due to the small ST -anti-crossing, as found in [55] for out-of-plane magnetic fields, we again find that the geometric fast-QUAD is superior to the linear pulse (See Fig. 3). Even under this simplification, we report a transfer fidelity of > 99.99 % after around 150 ns pulse time."
    },
    {
      "heading": "C. Three-level model",
      "text": "To obtain a simplified model that captures spin-tocharge conversion (See Fig. 4(a)), we restrict ourselves to a double dot system with a magnetic field pointing purely in the z-direction, neglecting the fully polarized states |T ± ⟩, and focus on the singlet-triplet basis with two charge degrees of freedom (Fig. 4(b)). The Hilbert space is spanned by the following basis states where (n L , n R ) describes the number of charges in the left and right dots, respectively, and |vac⟩ represents the vacuum state. In this subspace, we find that the matrix representation of the DQD Hamiltonian, in the above basis, is The energy spectrum of the Hamiltonian in Eq. ( 18) is seen in Fig. 4(c), which displays an anti-crossing at ε = Ũ . The size of the anti-crossing is now determined by the combination of the tunnel coupling Ω and the Zeeman splitting difference ∆E Z . In contrast to the Landau-Zener-Majorana-Stueckelberg anticross-ing, the energy spectrum is not symmetric in the detuning ε. Also, the existence of a third energy level, makes it possible for diabatic transitions from the ground state to two upper energy eigenstates."
    },
    {
      "heading": "D. Incoherent dynamics",
      "text": "During coherent spin-to-charge conversion, a dominant error source are diabatic transitions in the vicinity of the anti-crossings, where the energy level difference is minimal. Our geometric protocol Eq. ( 4) is designed to minimize such errors. However, non-unitary dynamics arise due to couplings with ambient degrees of freedom, which alter the time evolution and hence may affect the optimal pulse shape. In the following, we will describe two ubiquitous noise types that may affect the protocol, lowand high-frequency charge noise. One of the most known types of noise in semiconducting and superconducting devices is the appearance of lowfrequency noise [66][67][68][69][70][71][72][73], whose noise spectral density follows S(f ) ∝ 1/f . Under sufficient conditions, the noise spectral density is the Fourier transform of the autocorrelation of the noise. For the Hamiltonian in Eq. ( 18), the noise spectral density arises from the correlation function of the fluctuations of the detuning parameter δε(t), which we include as a perturbation where δε is drawn from a Gaussian distribution δε ∼ N (0, σ 2 ), which is centered at zero with a variance given by σ 2 . In the simulations, we will model this behavior by fluctuating boundary conditions of the pulse shape ε 0,f → ε 0,f + δε [74] and illustrate the differences between a noisy and a noiseless time evolution. To study the high-frequency noise, we will adopt the Lindblad master equation, which describes non-unitary evolution of a quantum system subject to Markovian noise. It takes the form where Lj are the conventional Linblad operators. Explicitly, we describe dephasing from high-frequency noise via the dephasing jump operator [42] Ldephasing Here the Lindblad operator acts on the charge states (1,1) and (2,0). The strength of the dephasing is captured by the decoherence time T 2 . Since the dephasing operator has real entries hermitian, we can also shift the Lindbladian to obtain the equivalent dephasing operator which will generate the same time dynamics. Since for spin qubits relaxation is several orders of magnitude longer than dephasing for spin [34] and charge qubits [75], we neglect it in our analysis. Note that relaxation usually benefits adiabatic charge transfer of the ground-state as it counteracts the diabatic transitions to energetically excited states, thus effectively improving the population transfer fidelity. Using the Uhlmann fidelity F defined as we can determine the overlap of the lowest energy eigenstate |ψ 0 (t)⟩ and the time-evolved one under the nonunitary evolution given by (22) for the linear and geometric state transfer protocols."
    },
    {
      "heading": "E. Results",
      "text": "For concreteness, we will focus in our analysis only on the initialization process, as the readout process is directly provided by the reverse pulse shape. The initial state is the singlet state in the (2,0) charge state and is adiabatically pulsed to the desired final state. Under coherent evolution, the only error source is due to undesired diabatic transitions, inducing interference effects that reduce the transfer fidelity. We scan multiple pairs of parameters and simulate the transfer error 1p(t f ) using the protocol in Eq. ( 7) and the linear protocol. For the geometric protocol, we generate an appropriate adiabaticity using the boundary conditions of the detuning (ε 0 , ε f ) and the pulse time t f with Eq. ( 6) and then feed the numerically solved pulse ε num (t) into our Hamiltonian or Lindbladian based time evolution, depending on whether we want to study unitary or non-unitary dynamics. a. Unitary dynamics Figure 5 shows the results of the geometric pulse for the initialization sequence of the |↓↑⟩ state of the Hamiltonian (18). The transfer error is reduced as a function of the pulse time as we move more adiabatic at larger pulse times. We observe the advantage of using the geometric fast-QUAD over the linear protocol as a reliable protocol for circumventing coherent errors, even for very small anti-crossings and extremely fast pulse times. Strikingly, we observe as a common trend, that the transfer fidelity for the geometric fast-QUAD for t f > 20 ns yields a transfer fidelity F > 99 % for all investigated settings of tunnel couplings Ω and Zeeman splitting differences ∆E Z . Note that these results, for the same parameter settings besides the detuning boundary conditions, also hold for the adiabatic readout protocol, as the energy is conserved along these paths. b. Non-unitary dynamics In addition to providing higher fidelities for very short pulse times and dense energy spectra, our protocol is also highly resilient against quasistatic noise as seen in Fig. 6, where we plotted the susceptibility of the transfer fidelity with respect to detuning fluctuations. Notably, after 20 ns the effects of the quasistatic noise affect the fidelities below 10 -4 , even for strong fluctuation of δε = 5 GHz. In Fig. 8 we also show that the geometric protocol is robust against pulse miscalibration regarding Ω → Ω + δΩ, for small δΩ and for pulse times bigger than 20 ns. Remarkably, assuming larger tunnel couplings for the pulse leads to smaller deviations from the calibrated result. This may be caused due to favorable interference effects in the initial ramp towards the anti-crossing. Namely, assuming a smaller anti-crossing will usually result in an initial fast ramp- A similar trend can be seen in (e), (f ). Remarkably, in (f ) the charge transfer fidelity is lower bounded at 99 %, independent of the combination (∆EZ , Ω) for an ultrafast pulse with pulse time t f = 20 ns. In addition, due to the conservation of energy along adiabatic paths, we observe no difference between the initialization and readout protocols. FIG. 6. Susceptibility of the geometric fast-QUAD to lowfrequency fluctuations in detuning. We simulate the effects of quasistatic noise via a fluctuation in the detuning (19). This fluctuation will affect the initial and final boundary conditions when simulating the pulse shape as follows: ε 0,f → ε 0,f + δε. We fix the values of the tunnel coupling to Ω = 3 GHz, ∆EZ = 0.5 GHz, and the remaining are identical to the ones in Figure 5. The errors mostly affect infidelities below 1-F < 10 -4 after a pulse time of t f = 20 ns. The asymmetry of the deviation is due to the fact that the energy spectrum is asymmetric around the anti-crossing at ε = Ũ .  ing ending in a slow-down at the anti-crossing, leading to interference effects that do not destructively interfere beyond the anti-crossing. Lastly, we compare the optimal control sequences of the linear and geometric protocol given some fixed decoherence time T 2 in Fig. 7. Here, we compute the linear and geometric fast-QUAD pulse shapes and simulate the Uhlmann fidelity of the lowest energy eigenstate |ψ 0 (t f )⟩ and the resulting mixed density matrix ρ(t f ) under Lindbladian time evolution. For a fixed interval of allowed pulse operation times t f ≤ 50 ns, we find the maximum Uhlmann fidelity at fixed decoherence time and compare the linear and geometric protocol. The maximum Uhlmann fidelity F(t * f ) is given by the optimal pulse operation time t * f for any given decoherence time T 2 . The linear protocol will always perform best at the longest allowed pulse times to suppress the diabatic transitions which dominate in this regime. On the other hand, the geometric fast-QUAD will be optimal at ultrafast operation times (t * f < 10 ns) to simultaneousely reduce the coherent and incoherent errors through dephasing. Therefore, the geometric fast-QUAD will always outperform the linear protocol under fixed decoherence rates."
    },
    {
      "heading": "IV. CONCLUSION",
      "text": "In this work, we established a relationship between the quantum geometric structure of the Hilbert space and quasiadiabatic time dynamics. Our main focus lied in providing a general framework to deal with coherent errors arising from undesired diabatic transitions between multiple energy levels while operating at fast pulse times. Special emphasis was put on applying these methods to enable fast and high-fidelity adiabatic initialization and readout for a DQD system, which is integral for the min-imization of state-dependent crosstalk. Nevertheless, we stress that the framework is applicable to all quantum systems with non-degenerate eigenvalues and only requires optimization on the level of the Hamiltonian and not the time-ordered evolution operator. For coherent evolution, we found that independent of the parameter configuration, the geometric fast-QUAD provides an upper bound on the transfer error at 10 -2 for pulse times of 20 ns. Miscalibration of the pulse and quasistatic noise did not yield significant deviations. Errors arising due to dephasing effects were studied, and it was found that the geometric fast-QUAD was always superior to the linear protocol with respect to the Uhlmann fidelity, while allowing ultrafast operation times. Nevertheless, further efforts in the understanding of the quantum geometric approach have to be made, especially with a focus on including the effects of noise directly into the formalism, understanding the geometric difference between pure and mixed states, and what the impact of a non-abelian connection and degenerate eigenstates would be for transfer protocols. So far, the case of mixed states has been tackled only for full and finite rank density matrices [29,76], making it challenging to capture non-unitary time evolution and systems with infinite-dimensional Hilbert spaces. Nevertheless, the quantum geometry of parameter space will provide new opportunities for ultrafast adiabatic operations allowing for significant improvements in the coherent processing of quantum information, accelerating the advancement of emerging quantum technologies. which captures the fact that the embedding is welldefined. This can also be seen by the fact that now dim P (H Pauli ) = dim M. This metric is the metric on the Bloch sphere, as can be seen if we use ρ = tan θ and use the transformation rule for the quantum metric tensor to arrive at The left-hand side is the expression of the Hamiltonian and hence, in this case, Beltrami's identity is a consequence of conservation of energy. Computing the partial derivative of the Lagrangian above using ∂ ẋµ /∂ ẋα = δ µ α we find the adiabatic-geometric condition g µν (x) ẋµ ẋν = const. Another way to see this identity is that conservation laws arise due to symmetries. As we are considering unitary systems, we have time-reversal symmetry and hence energy conservation. The connection between symmetry and conserved charges in the geometrical context is illustrated by the Killing vectors ξ µ . Each Killing vector has an associated conserved charge [26] If the Killing vector is proportional to the tangent vector ξ µ ∝ ẋµ we also find the adiabatic-geometric relation. This shows the explicit relation between energy conservation and geometry. In order to find the geodesics of a manifold one also only needs dim M -1 Killing vector fields [26], which aligns with the parameter subspace after the constraint due to the conformal invariance of the QGT. if we constrain ourselves to the charge states (1,1), (2,0), and (0,2) including the spin states |↑↑⟩ , |↑↓⟩ , |↓↑⟩ , |↓↓⟩}. In addition, we define E j = E j,1 +E j,2 and ∆E j = E j,1 -E j,2 with j = X, Y, Z for each component of the Pauli vector, and we set the y-component to zero for simplicity. The energy spectrum of the above Hamiltonian is plotted in Figure 9. As seen in the main text, when restricting to the singlet and triplet sectors for the charge configurations (2,0) and (1,1), we find the Hamiltonian (18). Given that the Zeeman splitting difference ∆E Z is usually a much smaller energy scale than the tunnel coupling or detuning we want to find an effective 2-dimensional model. Using standard Schrieffer-Wolff transformation we find that the effective 2d model is spanned only by the singlet sector in the two different charge states (1, 1), (2, 0) where J 2 = ∆E 2 Z /Ω 2 is the expansion parameter. For this 2 × 2 Hamiltonian we can find the fast-QUAD equation explicitly in the regime of J ≪ 1 up to second order in the Zeeman splitting difference In the above equation, we rescaled Ω → Ω/2 for readability. For J = 0 we recover the fast-QUAD equation for the Landau-Zener model as seen in [17,18,50]. The difference of pulse shapes of the effective 2d and the full 3d Hamiltonian is plotted in Figure 10. We observe that the derived pulse shapes deviate significantly between the effective and the full model. First, we compute the quantum metric tensor using Eq. (A2). Making use of the quantum adiabatic condi"
    },
    {
      "heading": "Hamiltonian simulation",
      "text": "For the numerical simulations of the coherent population transfer, we first generate a pulse according to the boundary conditions for initialization or readout. Next, we replace the numerically solved pulse ε num (t) in the Hamiltonian operator and then solve the Schrödinger equation (in units of ℏ = 1) Given the initial state |ψ 0 (t = 0)⟩, we evolve the state and project it onto the lowest energy eigenstate at the final pulse time to see whether coherent errors occurred. For that, we compute the transfer probability p(t where the Lindbladian takes the form Note that the expression explicitly depends on the basis chosen, as the transpose is basis-dependent. To compute the success of the state transfer protocols we define the Uhlmann fidelity We will use this to quantify the overlap between the timeevolved pure initial state |ψ 0 (0)⟩ ≈ |S(2, 0)⟩ to the mixed state at the end of the non-unitary evolution ρ(t f ). In this case, the fidelity simplifies to Full-time evolutions are shown in Fig. 12. We observe that the geometric fast-QUAD provides a better overlap with the energy eigenstate for weak dephasing. Figure 11 shows the procedure to obtain the optimal control simulation in Fig. 7. We start by simulating the Uhlmann fidelity for a fixed decoherence time T 2 for pulse times t f ∈ [0, 50] ns and extract the highest overlap for both the linear (dashed line) and geometric (full line) protocol. These are shown in the figure as blue circles/red stars for two exemplary decoherence times T 2 = 1, 100 ns, respectively. Note that the geometric protocol provides a higher fidelity at shorter pulse times. From each simulation, therefore, we extract the fidelity F(t * f ), the pulse time t * f at which the highest fidelity is reached and the corresponding decoherence time T 2 . We note that, due to the small anti-crossing and the ultrafast pulse time (t f = 10 ns), the geometric pulse severely outperforms the linear protocol. However, only in the weak dephasing limit T2 ≫ t f do we find that the geometric fast-QUAD provides a high-fidelity state transfer. The geometric protocol, due to the minimization of the Landau-Zener transitions, will remain for long times in the anti-crossing region to avoid coherent errors. Thereby, however, it will be most exposed to charge noise."
    }
  ],
  "figures": [
    {
      "caption": "FIG.10. Pulse shaping comparison between 2d low-energy effective Hamiltonian (B3) and the DQD model",
      "image_path": null
    }
  ],
  "equations": []
}