{
  "paperid": "2508.06304v1",
  "title": "Shortcuts to adiabaticity with a quantum control field",
  "authors": [
    "Emma King",
    "Giovanna Morigi",
    "Raphaël Menu",
    "L Landau",
    "C Zener",
    "E Stückelberg",
    "F Barra",
    "M Esposito",
    "B Damski",
    "C Grandi"
  ],
  "year": 2025,
  "abstract": "Quantum adiabatic dynamics is the crucial element of adiabatic quantum computing and quantum annealing. Shortcuts to adiabaticity enable acceleration of the computational time by suppressing unwanted non-adiabatic processes with designed classical fields. Here, we consider quantum state transfer in the Landau-Zener model, which exemplifies the key elements of quantum adiabatic dynamics. We argue that non-adiabatic transitions can be suppressed by autonomous quantum dynamics, which involves coupling the Landau-Zener qubit to a second quantum system. By tuning the coupling strength, the composite quantum dynamics can reduce the probability of unwanted processes by more than two orders of magnitude. This is a prime example of control where the quantum properties of the control fields are key for implementing shortcuts to adiabaticity.",
  "sections": [
    {
      "heading": "Untitled",
      "text": "Introduction.-The Landau-Zener (LZ) model is a paradigm of a time-dependent quantum mechanical process [1][2][3] that is exactly solvable and encompasses the fundamental principles of quantum adiabatic transfer. For these reasons, the LZ model provides key insights into quantum thermodynamic principles [4], quantum phase transitions [5,6], and quantum annealing dynamics [7][8][9], serving as the workhorse for identifying strategies for accelerating adiabatic transfers [5] and unveiling the mechanisms that determine their ultimate speed limits [10,11]. Some of these strategies utilize classical control fields, which induce processes that suppress adiabatic transitions, thereby implementing so-called \"shortcut to adiabaticity\" protocols [12,13]. This can be enforced through nonlinearities [14][15][16][17]. Perfect cancellation of the non-adiabatic transitions is achieved by counterdiabatic protocols [18][19][20][21][22][23], among which the control field is known for the LZ dynamics [19]. Thermal reservoirs can be beneficial for adiabaticity [24][25][26][27]. This observation has led to the identification of open-quantum-system approaches to shortcuts to adiabaticity [28][29][30][31][32] and to the formulation of strategies for reservoir-induced transitionless quantum driving [33,34]. In these protocols, the incoherent dynamics is engineered through the coupling with a second quantum system, which can possess the features of a reservoir [35,36] or undergo dissipative dynamics itself [32,[37][38][39]. The majority of these models disregard quantum correlations between the LZ qubit and the second quantum system, treating the latter as memoryless. Nevertheless, there are indications that memory effects can lead to more favorable speed limits [34,[39][40][41]. In particular, it has been posited that entanglement between the LZ qubit and the quantum control field during the dynamics can be resourceful for shortcuts to adiabaticity [39]. This hypothesis is corroborated by studies of the multilevel LZ model [30,42,43] and on quantum annealing protocols designed by auxiliary systems [44,45]. In this work, we analyze the fidelity of quantum state transfer in the LZ model. We assume that the LZ qubit couples linearly to a second quantum system, which we interchangeably denote by quantum field or spectator. We demonstrate that, when the LZ qubit dynamics is deep in the diabatic regime, where quantum state transfer is inefficient, the composite dynamics of the LZ qubit and spectator can correct for the diabatic processes and reduce the probability that they occur by more than two orders of magnitude. The protocol is illustrated in Fig. 1. Superadiabatic transfer is realized when the coupling between qubit and spectator is in the so-called ultra-strong coupling regime [46,47]. The protocol does not require the time-dependent control of the quantum field; it is optimized by choosing the field eigenfrequency and the coupling strength with the LZ qubit, and is robust against fluctuations in the physical parameters. The model.-The dynamics of the LZ qubit and field is governed by the Hamiltonian acting on the composite Hilbert space of qubit (s) and field (f ): FIG. 1. Interference-assisted superadiabaticity: The ultrastrong coupling of an LZ qubit with a quantum field (bosonic or fermionic) leads to high-fidelity adiabatic passage even for fast sweeps, where the isolated LZ dynamics would be in the diabatic regime. Here, x0 scales the strength of the coupling, and ωc is the eigenfrequency of the quantum field. where Îi is the identity operator in the corresponding Hilbert space, see Fig. 1. The LZ Hamiltonian of the qubit reads where σj are the Pauli matrices (j = x, y, z). Hamiltonian (2) describes the dynamics of a spin 1/2 (qubit) in the presence of a classical magnetic field with a constant component along x and a time-dependent amplitude along z, which varies at a constant (sweep) rate ϵ. The instantaneous Hamiltonian Ĥs (t) is diagonal in the eigenbasis |±⟩ t with eigenenergies In the absence of the spectator field (x 0 = 0), the probability that the qubit is excited into the upper branch |+⟩ t is the infidelity where the quantum state |ψ⟩ t solves the time-dependent Schrödinger equation i∂ t |ψ⟩ t = Ĥ(t)|ψ⟩ t (we set ℏ = 1). For t → ∞, the infidelity takes the compact form I LZ = exp -πg 2 /2ϵ , showing that adiabatic transfer is warranted for g 2 /ϵ ≫ 1. Evidently, I LZ decreases monotonously by increasing the gap g and/or decreasing the sweep rate ϵ [42]. In what follows, we consider the diabatic regime, in which g 2 /ϵ < 1 and I LZ > 0.2. For convenience, we now assume that the spectator field is a second qubit at the transition frequency ω c , with Ĥf = ω c τ z /2, and τ j denoting the Pauli matrices acting on the states of the spectator Hilbert space. The qubit-spectator interaction is the minimal coupling Hamiltonian and is scaled by the parameter x 0 with the dimension of an energy. Hamiltonian (1), and variati"
    }
  ],
  "figures": [],
  "equations": []
}