{
  "paperid": "0605095v2",
  "title": "Quantum teleportation between light and matter",
  "authors": [
    "Sherson",
    "Krauter",
    "Olsson",
    "Julsgaard",
    "Hammerer",
    "Cirac",
    "Polzik",
    "Bennett",
    "Briegel",
    "Dur",
    "Cirac",
    "Zoller",
    "Gottesman",
    "Chuang",
    "Bouwmeester",
    "Boschi",
    "Branca",
    "De Martini",
    "Hardy",
    "Popescu",
    "Furusawa",
    "De Riedmatten",
    "Takei",
    "Yonezawa",
    "Aoki",
    "Furusawa",
    "Barrett",
    "Riebe",
    "Hammerer",
    "Wolf",
    "Polzik",
    "Cirac",
    "Hammerer",
    "Polzik",
    "Cirac",
    "Vaidman",
    "Julsgaard",
    "Sherson",
    "Fiurášek",
    "Cirac",
    "Polzik",
    "Julsgaard",
    "Kozhekin",
    "Polzik",
    "Julsgaard",
    "Schori",
    "Sørensen",
    "Polzik",
    "Julsgaaard",
    "Sherson",
    "Sørensen",
    "Polzik",
    "Sherson",
    "Julsgaaard",
    "Polzik",
    "Chou",
    "Polyakov",
    "Kuzmich",
    "Kimble",
    "Chaneliere",
    "Eisaman",
    "Kuhn",
    "Hennrich",
    "Rempe",
    "Mckeever",
    "Neergaard-Nielsen",
    "Melholt Nielsen",
    "Hettich",
    "Mølmer",
    "Polzik",
    "Polzik",
    "Carri",
    "Kimble"
  ],
  "year": 2024,
  "abstract": "",
  "sections": [
    {
      "heading": "",
      "text": "Quantum teleportation 1 is an important ingredient in distributed quantum networks 2 , and can also serve as an elementary operation in quantum computers 3 . Teleportation was first demonstrated as a transfer of a quantum state of light onto another light beam [4][5][6] ; later developments used optical relays 7 and demonstrated entanglement swapping for continuous variables 8 . The teleportation of a quantum state between two single material particles (trapped ions) has now also been achieved 9,10 . Here we demonstrate teleportation between objects of a different nature-light and matter, which respectively represent 'flying' and 'stationary' media. A quantum state encoded in a light pulse is teleported onto a macroscopic object (an atomic ensemble containing 10 12 caesium atoms). Deterministic teleportation is achieved for sets of coherent states with mean photon number (n) up to a few hundred. The fidelities are 0.58±0.02 for n=20 and 0.60±0.02 for n=5higher than any classical state transfer can possibly achieve 11 . Besides being of fundamental interest, teleportation using a macroscopic atomic ensemble is relevant for the practical implementation of a quantum repeater 2 . An important factor for the implementation of quantum networks is the teleportation distance between transmitter and receiver; this is 0.5 metres in the present experiment. As our experiment uses propagating light to achieve the entanglement of light and atoms required for teleportation, the present approach should be scalable to longer distances. Quantum teleportation-a disembodied transfer of a quantum state with the help of distributed entanglement-was proposed in a seminal paper 1 . The generic protocol of quantum teleportation begins with the creation of a pair of entangled objects which are shared by two parties, Alice and Bob. This step establishes a quantum link between them. Alice receives an object to be teleported and performs a joint measurement on this object and her entangled object (a Bell measurement). The result of this measurement is communicated via a classical communication channel to Bob, who uses it to perform local operations on his entangled object, thus completing the process of teleportation. In our experiment, a pair of entangled objects is created by sending a strong 'in' pulse of light (shown on the left in Fig. 1) through an atomic sample at Bob's location. As a result of the interaction between the light and the atoms the transmitted 'out' light received by Alice's and Bob's atoms become entangled. On Alice's site the entangled pulse is mixed with the pulse to be teleported on a 50/50 beamsplitter (BS in Fig. 1). A Bell measurement in the form of homodyne measurements of the optical fields in the two output ports of the BS is carried out and the results are transferred to Bob as classical photocurrents. Bob performs spin rotations on the atoms to complete the teleportation protocol. Finally, the state of the atoms is analysed to confirm that the teleportation has been successful. The experiment follows a recent proposal for light-to-atoms teleportation 12 using multimode entanglement of light with an atomic ensemble placed in a magnetic field. We describe teleportation in the language of dimensionless canonical variables 13 ; this provides a common description for light and atoms, and allows for a complete tomographic characterization of the states. The atomic object is a spin-polarized gas sample of approximately , and the transverse projections with minimal quantum uncertainties, . Changing to the frame rotating at the Larmor frequency Ω and introducing the canonical variables for the collective transverse atomic spin components 12 , we obtain , δ >> . Here A X and A P are the recipient operators in the teleportation protocol. The light to be teleported, and the 'in' and 'out' modes (Fig. 1), are described by single mode canonical operators 6,12 Q Y , ˆ, and in in ˆ, y q and out out ˆ, y q , respectively. These ˆ are quantum analogues of the amplitude and phase of light in classical physics, or, more precisely, of the classical quadrature phase amplitudes y, q in the decomposition of the electric field of light with the frequency ω as t q t y E ω ω sin cos + ∝ (see Methods for exact definitions). Two non-commuting variables in quantum mechanics cannot be measured without distortion. The challenge of teleportation thus consists of a faithful transfer of these not simultaneously measurable operators, Q Y , ˆ, onto atomic operators A X and A P . The Raman-type interaction (see Fig. 1 inset) couples the quantum ω Ω + sideband of the 'in' field to the Zeeman sublevels separated by the frequency 322 kHz Ω = . Therefore we introduce the cos , sin t t Ω Ω components of the light operators c,s c,s , Y Q and c,s c,s ˆ, y q (see Methods). Canonical operators for the upper sideband mode Q Y , ˆ can be expressed 12 via measurable sin( ) t Ω and cos( ) We first describe generation of entanglement between light and atoms. The 'in' strong pulse is y-polarized, hence its x-polarized mode in in ˆ, y q is in a vacuum state. After interaction with atoms 12 , the x-polarized 'out' mode operators out out ˆ, y q are given by: The terms in curly brackets in the equations for y ˆ represent vacuum contributions coming from different orthogonal modes of the 'in' pulse where the canonical operators s,c v represent vacuum temporal higher order canonical modes 12 . The terms containing in A P and in A X describe the imprint of the atomic state on the light via coherent forward scattering from the atomic ensemble, or, in other words, polarization rotation due to the Faraday effect 14,15 . The atomic spin operators are transformed by the interaction with light as follows 12 : The second terms in equation ( 2) describe the imprint of the light state onto atoms via the dynamic Stark effect 14 . The atoms-light entanglement described by equations ( 1) and ( 2) is very close 12 , under our experimental conditions, to the Einstein-Podolsky-Rosen entanglement optimal for quantum teleportation. The light-atoms coupling constant has been discussed in detail previously 12,[14][15][16][17][18] . (Here σ is the dipole cross-section 18 , 1 a is the vector polarizability 18 , MHz 6 . 2 = Γ is the natural linewidth (HWHM) of the transition, 13 ph is the blue detuning of light from the atomic resonance, and 2 8 . 4 cm A = is the cross-section of the atomic sample. As in our previous experiments with the atoms-light quantum interface, strong coupling with the atomic ensemble is achieved in the region of a high resonant optical depth α 0 . In the experiment we choose a nearly optimal value 12 of 1 ≈ κ by changing 0 a t N α ∝ with the temperature of the vapour. Note that another condition for strong coherent coupling is a very high ph N in the y-polarized mode. At Alice's location (Fig. 1), the 'out' pulse is mixed on BS with the object of teleportation-a few-photon x-polarized coherent pulse with frequency ω Ω + generated by an electro-optical modulator (EOM). A Bell measurement of canonical variables 6,12,13 is performed by two sets of polarization homodyne detectors in the two output ports of BS (Fig. 1). Homodyne detection followed by the normalization to the vacuum (shot) noise of light 6 is a standard method for measuring canonical variables of light. In our experiment, the strong y-polarized pulse, besides driving the entangling interaction, also plays the role of a local oscillator for the homodyne detection. The variables in phase with the strong pulse out 1 c,s c,s c,s 2 ( ) y y Y = + are measured via a measurement of the Stokes parameter 2 Ŝ in one output of BS, whereas the out-of-phase components out 1 c,s c,s c,s 2 ( ) q q Q = are measured via the Stokes parameter 3 Ŝ in the other arm (see Methods). The sin( ) t Ω and cos( ) t Ω components are measured by processing photocurrents with lock-in amplifiers. The Bell measurement of operators c,s ŷ and c,s q yields four results, c,s y and c,s q . Operationally, these values are properly normalized integrals of corresponding photocurrents over the pulse duration (see Methods). As shown in Fig. 1, the photocurrents are combined to yield two feedback signals proportional to s c y q and c s y q + which are sent from Alice to Bob. Auxiliary magnetic field pulses 14,17 with frequency Ω and amplitudes proportional to the feedback signals are applied to the atoms, so that the collective atomic spin variables at Bob's site are shifted to become: where P X g , are the feedback gains. This step completes the teleportation protocol, as the light operators Q Y , ˆ are now transferred onto atomic operators tele tele A A ˆ, X P , and all other terms in equation ( 3) can be made small with a suitable choice of κ and g. To prove that we have performed the quantum teleportation, we determine the fidelity of the teleportation. Towards this end, we send a second-verifying-strong pulse of y-polarized light through the atomic ensemble af"
    },
    {
      "heading": "Methods",
      "text": "Calibration and measurement techniques. Physically, we perform measurements of the Stokes operators of light by two sets of balanced homodyne detectors (Fig. 1). The measurements on the first pulse represent the generalized Bell measurement. The same measurements on the second (verifying) pulse allow us to determine the teleported atomic state by performing quantum state tomography. The relevant ( ) cos t Ω and ( ) sin t Ω modulation components of the Stokes operators are measured by processing the corresponding photocurrents with lock-in amplifiers. The Stokes operators of interest are 2 Ŝ (which is the difference between photon fluxes in the modes polarized at 45 ± ° to the vertical axis, and 3 Ŝ (which is the corresponding quantity for the left-and right-hand circular polarizations). Calibration of the measurement of canonical variables for light is based on measurements of the shot (vacuum) noise level. We measure the Stokes parameters for the x-polarization mode in a vacuum state. The linear dependence of the variance of the measured photocurrents on the optical power of the strong pulse proves that the polarization state of light is, in fact, shot (vacuum) noise limited 25 . All other measurements of 3 2 , ˆS S are then normalized to this shot noise level, yielding the canonical variables as 2 vacuum 0 2 0 1 d cos( ) ( ) 2 d cos( ) ( ) T c T y t S t S τ Ω τ τ Ω τ = ∫ ∫ and similarly for c 3 ( ) q S and the ( ) sin t Ω components. Since our detectors have nearly unity (better than 0.97) quantum efficiency, the Stokes operators can be operationally substituted with measured photocurrents. Next we need to calibrate the atomic coherent (projection) noise level. Whereas balanced homodyne detection for light has become an established technique for determination of the vacuum state 6 , a comparable technique for atoms is a relatively recent invention. Here we utilize the same procedure as used in our previous experiments on the atoms-light quantum interface 14,15 . We use the fact that the vacuum (projection) noise level for collective atomic spin states in the presence of a bias magnetic field can be determined by sending a pulse of light through two identical atomic ensembles with oppositely oriented macroscopic spin orientation. We therefore insert a second atomic cell in the beam. As described in detail in ref. 15, the transmitted light state in this experiment is given by ( ) out in in c c atom1 atom2 c total ˆˆ2 y y P P y P κ κ = + + = + where total P is the spin canonical variable for the entire 2-cell atomic sample. Intuitively this equation can be understood by noting that terms proportional to 2 κ in equation (1) cancel out for propagation through two oppositely oriented ensembles. A similar equation holds for out s ŷ with substitution of total X for total P . The results for Methods. The fact that the points lie on a straight line, along with the independent measurement of the degree of spin polarization above 0.99, proves 14,15,18 that we are indeed measuring the vacuum (projection) noise of the atomic ensemble. 2 κ for different atomic numbers is then calculated from the graph (Supplementary Methods). Its values are in good agreement with the theoretical calculation 18 according to In the experiment, we monitor the number of atoms by sending a weak off-resonant probe pulse along the direction x and measuring the Faraday rotation angle proportional to the collective macroscopic spin of the ensemble atoms 4 x J N = . This Faraday angle is monitored throughout the teleportation experiment, so that the value of 2 κ is known at every stage."
    },
    {
      "heading": "Decoherence and losses.",
      "text": "The main sources of imperfections are decoherence of the atomic state and reflection losses of light. For experimental values of the atomic decoherence and losses, the model developed in ref. 12 predicts, for example, 66 . 0 5 = F , which is still higher than the observed value owing to imperfections unaccounted for in the model but comparable to the obtained experimental results. Dissipation also affects the experimental state reconstruction procedure. The main effect of the light losses 09 . 0 = ε is that it modifies κ into 1 κ ε -. However, this modified κ is, in fact, exactly the parameter measured in the two-cell calibration experiment described above, so no extra correction is due because of these losses. There is also a small amount of electronic noise of detectors which can be treated as an extra vacuum contribution to the input state."
    },
    {
      "heading": "Standard deviation of the teleportation fidelity.",
      "text": "The standard deviation of the fidelity for 20 ≤ n is calculated as follows:  phase. The dashed lines indicate twice the standard deviation intervals ( ) ver c,s 2 Var y As can be seen the experimental fidelity is higher than the classical for 2 ≥ n . Below we also show the optimal gain for each n : As can be seen from the graph, the optimal gain approaches unity for high photon numbers but is significantly lower than unity for low photon numbers. The reason is that for low photon numbers a more prominent role is played by the vacuum contribution (which is perfectly transferred for zero gain and 0 = κ ). For 20 > n the atomic variance is larger so for the calculation of the fidelity for 20 > n we conservatively choose to calculate ) ( , 2 , P X P X g σ from all the data: We note that the reconstructed variances are higher and the scattering of points is somewhat larger. In the same way as above the fidelity can be optimized for different photon numbers. As can be seen the experimental fidelity quickly saturates around 55.5%. Below we show that the optimal gain also approaches unity rather fast."
    },
    {
      "heading": "Atomic decoherence",
      "text": "The rate of atomic decoherence in a paraffin coated glass cell in the absence of interaction with light is very low 15,17,18 corresponding to the coherence lifetime of sec 40m . However, the verifying pulse causes a much faster decoherence of the atomic state via the process of light-induced collisions 14,18 . This leads to the reduction in the mean spin values ."
    },
    {
      "heading": "Supplementary Notes Calculation of the fidelity for a qubit teleportation and a protocol with improved fidelity",
      "text": "In this section we show (i) how one can relate the teleportation fidelity of coherent states to that of qubits and (ii) how a fidelity approaching unity can be achieved in a more sophisticated teleportation protocol. (i) Let us call E the (completely positive) map that transforms the state to be teleported to the teleported one. We assume that we know the action of E on coherent states, i.e., (| |) E α α 〉〈 . The goal is to determine the qubit fidelity, q F , of this map. This is given by Ψ Ω 〉 = 〉 + 〉 and the integration is over the 4π solid angle. This expression can be easily determined in terms of with n,m,a,b=0,1. Note that, in practice, one can also determine these quantities in terms of other measurable quantities. In the present experiment, one can characterize E as 〉〈 ∫ where 2 2 4 1 s σ = is related to the atomic variance, 2 ( ) ( ) tele tele A A Var X Var P σ = = and g is the gain (whose values are restricted given the complete positiveness of E). For this map we obtain 2 4 2 2 2 2 3 6 16 24 4( 1)(1 2 ) ( 1) (1 6 ) 6(1 2 ) q s s g s g s F s This shows that, in principle, one can obtain arbitrarily high fidelities for 1 = g and small variances. For a particular teleportation protocol used in this paper, the value of 2 σ follows from the expressions for , tele tele A A X P (see text) and one obtains a theoretical limit on the fidelity of 0.74 for 1 κ = , in the absence of losses and decoherence. Including10% of light losses and atomic decay as in Ref. 12 of the paper, the theoretical prediction is still 0.72 for the same value of κ . (ii) A fidelity approaching unity can be achieved, in principle, by using squeezed light in the entangling pulse and measuring a number of higher order scattering modes in addition to the zero-th order cosine and sine modes. As explained in Ref .12 of the paper, the input-ouput relations describing the state of atoms and light after the interaction can be appended by similar relations for higher order modes . The corresponding optimal coefficients n g determine the envelope of the input modeY ,Q , which is a slowly decaying profile, as shown in Figure 1. The remaining half unit of added noise is due to the vacuum fluctuations of the entangling beam. It is possible to reduce this remaining noise by using squeezed light, such that the fidelity would approach unity, as the variances of in ,n y α approach zero. The squeezing spectrum should be broad enough to cover the sidebands at kHz ±322 , which is trivial with existing squeezing sources, for example squeezing of 6 dB was observed within the bandwidth of 2 MHz in Ref. 25  . Details about these improved protocols will be presented elsewhere."
    }
  ]
}