{
  "paperid": "1106.5097v3",
  "title": "Quantum Information Transmission",
  "authors": [
    "Wang",
    "Huang",
    "Dowling",
    "Zhu",
    "Huang",
    "Nielsen",
    "Kok",
    "Boto",
    "Angelo",
    "Valencia",
    "Gatti",
    "Shapiro",
    "Breigel",
    "Duan",
    "Lukin",
    "Cirac",
    "Natoriwhy",
    "Shah",
    "Brun",
    "Ollivier",
    "Zurek",
    "Modi",
    "Paterek",
    "Son",
    "Vedral",
    "Williamson",
    "Dakić",
    "Vedral",
    "Bennett",
    "Brassard",
    "Crpeau",
    "Jozsa",
    "Peres",
    "Wootters",
    "Braunstein",
    "Kimble",
    "Bouwmeester",
    "Pan",
    "Mattle",
    "Eibl",
    "Weinfurter",
    "Zeilinger",
    "Boschi",
    "Branca",
    "De Martini",
    "Hardy",
    "Popescu",
    "Horn",
    "Johnson",
    "Werner",
    "Wootters",
    "Ali",
    "Rau",
    "Alber",
    "James",
    "Kwiat",
    "Munro",
    "Barbieri",
    "De Martini",
    "Di Nepi",
    "Mataloni",
    "D'ariano",
    "Macchiavello",
    "Peters",
    "Altepeter",
    "Branning",
    "Jeffrey",
    "Wei",
    "Kwiat",
    "Riebe",
    "Haffner",
    "Roos"
  ],
  "year": 2012,
  "abstract": "We present a scheme of quantum information transmission, which transmits the quantum information contained in a single qubit via the quantum correlation shared by two parties (a two-qubit channel), whose quantum discord is non-zero. We demonstrate that the quantum correlation, which may have no entanglement, is sufficient to transmit the information of a quantum state. When the correlation matrix of the two-qubit channel is of full rank (rank three), the information of the qubit in either a mixed state or a pure state can be transmitted. The quantum discord of a channel with rank larger than or equal to three is always non-zero. Therefore, non-zero quantum discord is also necessary for our quantum information transmission protocol.",
  "sections": [
    {
      "heading": "Introduction",
      "text": "Quantum correlations have been demonstrated to be a resource for computing [1,2], metrology [3][4], imaging [5][6][7][8], communication [9,10] and steganography [11,12]. In each of these applications, entanglement has been central to the advantage provided by quantum systems. It is a question that has been discussed for quite a long time is whether other kinds of quantum correlation (besides the entanglement) can also be exploited in ways similar to entanglement. One such quantum correlation is quantum discord [13][14][15]. States with non-zero quantum discord are quantum correlated. While all entangled states have non-zero quantum discord, there exist states of non-zero quantum discord that possess no entanglement. In this paper we proposed a new use of the quantum correlations: to transmit information of an unknown qubit between two parties via a two-qubit state with non-zero quantum discord shared by the two parties. The scheme is similar to the quantum teleportation [16][17][18][19], and the information of the qubit can be transmitted from one place to another, if the correlation matrix of the two-qubit state (the quantum channel) is of full rank (rank three). The quantum discord of a state with full rank (rank three) is always non-zero. That is to say, the quantum information transmission is possible using a quantum channel with non-zero quantum discord. However, a quantum channel with non-zero quantum discord might have no quantum entanglement."
    },
    {
      "heading": "Quantum information transmission",
      "text": "Our set up is shown in Fig. 1, which is similar to the original quantum teleportation scheme [16]. A source of quantum particles generates a pair of qubits that have non-zero bipartite quantum correlations. Alice and Bob share the two qubits. Alice (the sender) makes a Bell measurement on her own qubit and an unknown single qubit C whose information will be transmitted to Bob (the receiver), and sends Bob the measurement result via a classical channel. The state Bob received will collapse to ρ ′ B . We will derive the conditions under which the state ρ ′ B contains complete information of the unknown state C. Non-classicality, which here is characterized by the rank of the correlation matrix [15], plays an important role in the quantum information transmission of the state of qubit C. In the general case, a two-qubit quantum channel system can be written as, where σ 0 is the identity operator, σ i {i = 1, 2, 3} are the three Pauli operators. The unknown single-qubit input state can be written as: where the information of qubit C is contained in the three real parameters, c i (i=1,2,3). The expression ρ C ⊗ ρ AB denotes the state of the entire system. Now we consider the requirement for implementing the quantum information transmission. We choose the Bell states as the measurement basis on the AC system. After the measurement, the state B will collapse to, where |β mn {m, n = 0, 1} is one of the Bell states, and Tr( β mn |ρ C ⊗ρ AB |β mn ) is the probability of the corresponding measurement outcome that is used to renormalize the density matrix. According to Alice's four different possible measurement outcomes, corresponding to the four Bell states, there are four possible expressions for ρ ′ B that can be written as, where where The denominator in Eq. ( 5) is equal to zero only when the state ρ AB is a direct product state, a completely classical and uncorrelated states that will not be considered here. Now let us prove that the state ρ ′ B includes all the information needed to reconstruct ρ C . In general, the state B ′ has three independent parameters, s mn k {k = 1, 2, 3} in Eq. ( 4), for each of the four Bell states. Select m = n = 0 (s 00 k = s k ) as an example. The values of m and n are sent to Bob via the classical channel. From Eq. ( 5) we have From Eq. ( 6) we construct three linear equations for c j . The information needed by Bob can be faithfully extracted when the Eq. ( 6) have a uniquesolution, which means that the coefficient matrix of the equations is of full rank. By comparing the four matrices in Eq. ( 4), we find that the four coefficient matrices can be transformed into each other by elementary matrix operations, which will not change the rank of a matrix. This means that the unique-solution condition is the same for each of the four density matrices in Eq. ( 4). Thus we only need to consider any one of the four. We define the coefficient matrix for Eq. ( 6) as T {T j,k = (-1) j+1 (r jk -r j0 s k )}. By substituting s i in Eq. ( 5) into T , it is interesting to note that the determinant of T is connected to the determinant of the matrix R, through the relation (1 + r 10 c 1 -r 20 c 2 + r 30 c 3 )det(T ) = -det(R), where the matrix R {R i,j = r i-1,j-1 } is the correlation matrix defined in Ref. [15]. The condition for unique solution for Eq. ( 6) becomes that the R matrix is of full rank. Therefore, in order to implement the information transmission of an arbitrary qubit, full rank for the correlation matrix of the channel AB system is required. In the following, we discuss the role of the rank of the correlation matrix R in the information transmission. The matrix R can be written as R = U DW T by singular value decomposition (SVD) [20], where U and W are 4×4 orthogonal matrices, , and the number of non-zero diagonal elements in D is the rank of R. Comparing with Eq. ( 1), we have, where α i j σ χ j has the form of a single qubit expanded in the Pauli operators, and represent a physical state when the coefficients satisfy Werner state [21], The Werner state is pure and maximally entangled for x = 1 with concurrence (a measure of entanglement) [22] equal to one and discord also equal to one. As shown analytically in Ref. [23], the Werner state has both non-zero discord and non-zero concurrence for x > 1/3. In the regime 0 < x ≤ 1/3, the Werner state has non-zero discord, but zero concurrence. Finally for x = 0, the Werner state is a product state with zero discord and zero concurrence. The correlation matrix of Werner state is diag[1 x -x x] , which is of full-rank except x = 0. If we do the joint Bell measurement, the state of particle B will collapse to: which contains the information of the qubit C. Comparing Eq. ( 9) with Eq. (4), we have c i ∝ s i /x, the relation between the received state and the state to be sent. Then the information of the unknown state C can be obtained directly. From Eq. ( 9), it is easy to see that for x = 1 the quantum information transmission scheme is exactly the traditional quantum teleportation scheme (except for the unitary operation imposed on the reduced system B). For x < 1/3, the entanglement of the quantum communication channel is zero, and we can still carry out the quantum information transmission. In this scheme, we transfer the complete information needed to reconstruct ρ c , but not the state itself. In the information transmission, the output density matrix ρ ′ B is not equal to the input unknown state ρ c , and cannot be simply transformed into ρ c via a local unitary operation as in the ordinary quantum teleportation [1], which is the price we pay for not having entanglement. Even if ρ c is a pure state, the output state (ρ ′ B ) is typically mixed if ρ AB is not a pure entangled state. In order to know the received state, Bob must make measurements on the received state, usually through quantum state tomography [24]. In the ordinary quantum teleportation, measurement is also needed, if Bob wants to know the state. Our quantum information transmission plus the local tomography can be regarded as the remote state tomography, which is useful in the quantum information science and technology. In general, the probabilities of the four Bell measurements are not equal, which means that Alice can learn something about the state she is sending, the information could be catch by the eavesdropper through the classical channel. If the state of the channel has the following form, where I A is the identity operator on system A and ρ B is the reduced density matrix of system B, the Bell measurements have equal probability, so that Alice cannot get any useful information about the sending state from the Bell measurements. The Werner state can be written in the above form. This is useful for security consideration."
    },
    {
      "heading": "Conclusions",
      "text": "In this work we propose a scheme of the quantum information transmission by using a quantum channel with nonzero quantum discord. Our scheme becomes ordinary quantum teleportation when a Bell state is chosen for the quantum channel. In the present scheme, what transferred from one place to another is the information of the state with knowing the relation between the received state and the state to be sent, but not the state itself. This is the disadvantage of the information transmission. When a particular channel is chosen, even Alice will have no knowledge on the information she is sending, while Bob obtains the state with complete information. The scheme for quantum information transmission can be implemented experimentally with the Werner states, as the Werner states with pairs of polarized photons from parametric down-conversion have been generated [25,26]. In addition, entangled ions in an ion trap [27] could also be used for the quantum channel."
    }
  ]
}