{
  "paperid": "1311.6781v1",
  "title": "On the Limits of Information Retrieval in Quantum Mechanics",
  "authors": [
    "Lerner",
    "Bickel",
    "Doksum",
    "Chuang",
    "Nielsen",
    "Cohen-Tannoudji",
    "Diu",
    "Laloë",
    "Derezinski",
    "Dragomir",
    "Dunford",
    "Schwartz",
    "Fabian",
    "Fabian",
    "Habala",
    "Hajek",
    "Montesinos",
    "Zigler",
    "Fröwis",
    "Gleason",
    "Kantrovitz",
    "Kato",
    "Lindenstrauss",
    "Tzafiri",
    "Loudon",
    "Mandelstam",
    "Tamm",
    "Mackey",
    "Peres",
    "Sakurai",
    "Shorack",
    "Wellner",
    "Schmudgen"
  ],
  "year": 2024,
  "abstract": "The widely considered assertion is that the unitarity of quantum mechanical evolution assures the \"preservation\" of information. It is even promoted in popular literature as an established fact. (Susskind, 2008)  Yet, a simple chain of reasoning demonstrates that: 1) almost any evolutionary operator can be well approximated by a degenerate (finite-rank) operator and 2) one needs an eternity to retrieve information exactly from a nonstationary quantum state and to distinguish between arbitrary unitary operator and its finite-dimensional approximations.",
  "sections": [
    {
      "heading": "Introduction",
      "text": "The preservation of quantum mechanical information as a result of unitarity of evolution operators-usually assumed in the standard schemes of quantum mechanics-acquired the status of popular mythology, which is repeated in numerous literature sources without much debate. It is claimed to be a law of nature akin to the conservation of energy or growth of entropy. (Susskind, 2008) In this paper, I re-capitulate two elementary facts. First, unitary evolution operators have many degenerate (finite-rank) operators in their immediate vicinity. Second, checking that a given operator is unitary within the confines of paradigmatic quantum mechanics is, in general, impossible. One of the first demonstrations of these, quite routine conclusions from the general formalism of quantum mechanics in the context of irreversibility of quantum mechanical experiments belongs to genial and untimely deceased Asher Peres. (Peres, 1984) In a simple (now available to any undergraduate student) and elegant numerical experiment, he proved that if there is an uncertainty in determination of a Hamiltonian of the quantum mechanical system, the \"average\" long-term evolution of the family of indistinguishable QM systems is irreversible. This paper, in its first part, follows a different approach. Within the confines of what I call \"primitive\" quantum mechanics-a formalism usually described in textbooks as The Quantum Mechanics-I demonstrate that there exists many finite-dimensional approximations of the original Hilbert state, which produce the results of measurement of any observable, which are arbitrarily close to the true quantum mechanical expectations. This is a direct consequence of well-known approximation property in Banach spaces. Because, the extension of the approximation of the original unitary evolution operator on a finite-dimensional space can have infinite-dimensional (\"fat\") kernel on the original Hilbert space, this proves that there are many degenerate operators in the arbitrary vicinity of the true QM evolution. In the second part, I use considerations analogous to the Mandelstam-Tamm uncertainty relation to demonstrate that an infinite precision for the quantum-mechanical measurement, in general, requires infinite time of measurement. For a physical experiment, limited in time, i.e. having a beginning and an end, there is no general possibility to distinguish between a measurement made by a perfect, or a \"coarse-grained\" device. Because of that, reconstruction of an original quantum state back to its origins is usually impossible and the unitary nature of quantum-mechanical evolution is irrelevant. Presented results are not the only limits on \"computability\" in quantum mechanics and the author hopes to present other limitations in subsequent publications."
    },
    {
      "heading": "A. Primitive quantum mechanics",
      "text": "In this section, we describe the structure of \"primitive\" (or standard) quantum mechanics. The author acknowledges caveats, both theoretical and practical, in this description but this is what is typically meant by \"quantum mechanics\" in conventional textbook treatments. (see e.g. Chapter 2 of Nielsen and Chuang, 2001 with the reference to Sakurai, 1995 andCohen-Tannoudji, Diu andLaloe, 1977) Namely, given is a separable Hilbert space over the complex numbers field L , the vectors Ψ∈ L of which are called states. The select Hermitian injection operator Ĥ : L → L is called Hamiltonian. There are other Hermitian operators Â on L, which are called observables. All linear operators on the Hilbert space constitute an algebra over the field of complex numbers. All bounded operators on L: 〈Ψ|B|Ψ 〉<∞ have a natural norm defined by the identity: This norm, under some generic assumptions, turns algebra of bounded operators on L into a Banach space. Quantum mechanical evolution is described by the exponential of the Hamiltonian: as transformations of the state vector. This exponential, under certain mild conditions is a unitary operator.foot_1  (Dunford and Schwartz, 1971, Chapter VIII) Note, that, first, we consider explicitly relativistically non-covariant formulation of the quantum mechanics. Second, our Hamiltonian is timeindependent to simplify the analytic reasoning. Otherwise, we have to deal with time ordering of exponential operators. Comment on these limitations will be provided in Part II of the present work."
    },
    {
      "heading": "B. Convergence of truncated observables",
      "text": "First, we note the following obvious property of any primitive quantum mechanics as a system. Separable Hilbert space L possesses a complete system of mutually orthogonal eigenvectors. (Dunford and Schwartz, 1971) Because we admitted the existence of a Hamiltonian operator, rotation to one of these bases turns the energy norm into a diagonal Dirichlet form. For a mathematically inclined reader, the rest of the Section 1B is a reminder of the approximating property for the Banach space of observables. (Kato, 1966, Chapter IX, Lindenstrauss and Tzafiri, 1977, Fabian, 2001, Chapter 15) However, the approximating property in conventional context is proven (or rejected) for the case of operators in general Banach spaces. For us, it is sufficient to deal with a much more limited situation of non-compact linear operators (observables) on a Hilbert space. The truncation of this system to the first n vectors defines a projector P n and orthogonal projector Q n>N on the Hilbert subspace orthogonal to the first n vectors. Obviously, for each n: for an arbitrary non-singular matrix B on a finite-dimensional Hilbert subspace with dimension n'>n engendered by the same sequence of projection operators. Now we can formulate the first lemma."
    },
    {
      "heading": "Lemma 1",
      "text": "For any ε>0, ᴲ ∃n>0 , such that the expectation of an arbitrary observable obeys at all times: This lemma is an automatic consequence of the approximation property of the Banach spaces. Yet, I emphasize demonstration more limited in scope but which is applicable when observables are unbounded operators."
    },
    {
      "heading": "Corollary 1 from Lemma 1",
      "text": "For any ε>0 ∃n ' >n such that Û n =P n U P ' n , |Det n ' Û n |=0 and U from Equation (2): Above, the Det n' Û n is the determinant of the operator U n acting on the n'-dimensional subspace of the original Hilbert space L. The Corollary 1 follows from taking Â0 = Î as an observable in Lemma 1. Note that this operator is not compact. Corollary 1 demonstrates that for any unitary operator of the form of Equation ( 2), there is an operator with non-zero (in fact, infinite-dimensional kernel) which is arbitrarily close to the original U by the \"natural\" operator norm of the Banach space."
    },
    {
      "heading": "C. Construction of the measurement device",
      "text": "Here we shall quantify a \"primitive\" theory of measurement, which is a condensed version of a standard textbook theory of measurement (Chuang and Nielsen, 2001) and is close to the axiomatic formulation by Mackey (1960). Namely, a measurement device is a non-empty family of (weakly convex) measures μ α on a (locally) compact subalgebra C of the algebra of the observables, obeying a conventional system of axioms for measure. (McKay, 1960) Then, the measurement operator for an observable Â(t ) is defined by: wherever this integral exists. Note that even if the integral of Equation ( 7) is well-defined for t=0, it is not necessary that it exists for all t>0. Thus, it makes sense to define a subalgebra κ t ⊆ C , for which Equation ( 7) is well-defined for a given measurement device. The probability distribution P α for the measurement results is described by a conventional Born formula: The example of the measurement device is easy to define. Namely, for each finite-dimensional family of the state vectors, which can also be identified with functionals on the original Hilbert space L through conventional duality, { Ψ i } , i=1, N, a measurement device can be described by the following Equation ( 9): Obviously, from the normalization condition: In 1957, Gleason proved a remarkable theorem that the expressions of Equation ( 9), if we allow the index to span all basis vectors, under certain seemingly innocuous conditions exhaust all the possible measures (Gleason, 1957, Mackey, 1960). Because of that, the measures of the type (9) can be identified with all convex measures on finite-dimensional subspaces of L. In the parlance of Mackey (1960, Chapter 2), any measurement device can be decomposed into (or, more, colloquially, answers to) a finite series of questions, which Mackey defined as projectors into one-dimensional subspaces of an original Hilbert space L. 3This formulation of measurement theory agrees with an intuitive notion that a \"sensible\" measurement device has a finite number of internal states subject to experimental monitoring. Then, the (optional) time dependence of the coefficients ρ α, i (t) can be naively interpreted as the values of \"dials\" changed by the experimentalist in course of the measurement. The monitoring itself, however, can be accomplished at an infinite number of points-or even be continuous-in some contexts it might be beneficial to identify parameter α with the reading T of an internal clock of the device. In the above formulation, there is no separate macroscopic measurement device obeying \"classical laws\" and the observed particle obeying quantum mechanics. \"Macroscopic\" simply means that the measurement device has one or more degrees of freedom, which are impossible or impractical to control quantum mechanically and for which one must use statistical description."
    },
    {
      "heading": "Time Limits on the Distinguishability of the Quantum Observables",
      "text": "A possibility to approximate any Hermitian operator on a Hilbert state by a weakly compact (i.e. irreversible) operator does not mean, in general, that one cannot make measurements with a complete preservation of the initial observable. Yet, in this section, we demonstrate that it, in general, is incredibly difficult. In particular, we point out that more and more precise measurements have diminishing returns in terms of the Fisher information. (Bickel andDoksum, 2000, Fröwis, 2012) This fact means that one cannot, in general, improve the resolution of quantum mechanical observables indefinitely, though this possibility may exist in very special cases. A. Criterion for the efficiency of quantum measurement The existence of many similar but less informative quantum states in the vicinity of the \"true\" state, which is the product of unitary evolution of an original one, does not necessarily mean the impossibility of distinguishing between them. However, to accomplish this distinction, one needs at least a theoretical opportunity to increase the precision of a quantum measurement procedure indefinitely. To investigate this matter, we need to elaborate further on the protocol of quantum measurement. Every quantum mechanical measurement relies on several idealized steps. First, the measurement apparatus is prepared in a quantum certain state at t=0. Then, it is put in contact with the system undergoing the measurement (which is conventionally called particle) and the probabilities of transition of the measurement apparatus into its internal states are read out at some time t>0. To describe this situation, we need to distinguish between the Hamiltonian of the system undergoing the measurement H S and the Hamiltonian of the measurement apparatus-system interaction V. In this Section, we discuss the criteria for the quality of the quantum measurement. Let the total wavefunction be as follows: or Here, the index i refers to the (finite) number of eigenstates of the measurement apparatus, which are brought into contact with a particle, and the index j-to the potentially infinite number of eigenstates of the measured particle. P N and Q N are the orthogonal projectors on the Hilbert subspaces formed by the eigenstates of the unperturbed Hamiltonian. Interaction V is considered as perturbation. Using generalized Born rule for the transition probability, we obtain: If the measurement apparatus and the measured system were never brought in contact with each other, the internal states of measurement apparatus also would evolve but according to the formula: A natural criterion of the efficiency (quality) of our measurement would be the analog of the Kolmogorov-Smirnov distance (Shorack and Wellner, 2009): This criterion identifies the quality of measurement with the K-S distance between the distributions of the probability of internal states of the measurement device in cases of free evolution and the evolution affected by the interaction with a particle. The quality of measurement is equal to: below we shall make a useful notation We shall use this expression in the next section to prove that an arbitrarily accurate quantum measurement might take arbitrarily long time."
    },
    {
      "heading": "B. Temporal limits on the resolution of the quantum devices",
      "text": "In this section, we prove that the resolution of the quantum devices cannot be, in general, increased indefinitely if the measurement lasts a finite time. This limitation has an intimate connection with the Mandelstam-Tamm uncertainty relation. (Mandelstam, Tamm, 1945) We compare the quality of the measurement achievable by a \"perfect\" measurement device and a \"coarsened\" measurement device, in which the interaction Hamiltonian is truncated to a finite number of states. The quality of the measurement made by a perfect device is expressed by the Equation ( 18), in which the summation indexes are made explicit: The quality of measurement by the coarse device is expressed by a similar formula with different limits By construction, Q⩾ Q⩾0 . According to the triangle inequality: It can be demonstrated that, in general, the fidelity factor of the measurement F, i.e. the difference of readout for a perfect and coarse devices is infinitesimal for any finite time of the measurement procedure."
    },
    {
      "heading": "Theorem 1",
      "text": "For any ε>0 and sufficiently low correlations between the elements of the matrix there exists a numerical constant A such that The condition of Equation ( 21) on the stochasticity of the matrix elements M ij is natural to be called \"Peres condition\" after Asher Peres, who was first to connect non-integrability of the perturbation Hamiltonian with the irreversibility in quantum mechanics (Peres, 1984). This concludes our reasoning that experimental distinction between correct, i.e. information-preserving original state and its finite-dimensional approximation is a virtual impossibility. The above caveat is essential because our demonstration is provided in restrictive conditions, which can sometimes be violated. Heuristically, Theorem 1 states a rather simple fact: for a general measurement procedure adding more and more eigenstates brings diminishing returns to the Fisher information (Fröwis, 2012) obtained through that measurement. The proof requires a technical Lemma 2 (Appendix, see also Schmudgen, 2012 andDerezinski, 2013)."
    },
    {
      "heading": "Lemma 2",
      "text": "The evolution operator of Equation ( 2) is a smooth function of t in the complex band -∞<Re(t)<∞, 0≤Im(t)<u<∞. Consequence of the proof of Theorem 1 is the following inequality. (Equation (A.10) of the Appendix) Because of the convergence of the series of matrix elements, for a large enough N 1 , the infinite sum ∑ N 1"
    },
    {
      "heading": "∞",
      "text": "Ṽ ij converges to a finite limit. Then, Because the number of internal states of the measurement device is finite, so is F-fidelity of distinction between precise and coarse devices: In Equation ( 23), A ,C , C , K <∞ are numerical constants. Due to the Equation (22-22'), the quality of measurement is infinitesimal for any finite time. Note that our set of inequalities breaks down for interaction-dependent characteristic times defined by: because for the times longer than t 0 , the convexity of the sin(x) breaks down. The result is that, in general, one cannot make a distinction between \"coarse\" and \"perfect\" measurement device during a finite time of arbitrary experiment. Together with the conclusions of the Section 1, we deduce that the distinction between unitary operator on a Hilbert space and its finite-dimensional approximation (having infinite-dimensional kernel) is impossible."
    },
    {
      "heading": "Conclusion",
      "text": "We proved, albeit in a very simplified and restrictive framework, that within the confines of non-relativistic quantum mechanics, the distinction between a unitary operator and its finite-dimensional approximations cannot, in general, be observable. Relativistic framework intuitively seems only to complicate matters with the observability. However, it seems to this author that, at least, the demonstration where t is not a parameter but a coordinate on the future space-time cone can be instructive. While the information is preserved during unitary quantum-mechanical evolution, in general there is no experimental possibility to reconstruct an original unitary operator from the values of any observable during a finite time of measurement. The loss of information about initial quantum state is inevitable. Yet, the existence of symbolic Peres condition (stochastic distribution of eigenvalues, Section 2B) demonstrates that this conclusion is not universal and in some, well-designed experiments, complete reconstruction of an original unitary operator and backdating of a quantum state to its origin may be possible. Whether it is possible with all naturally occurring astrophysical systems is another question entirely. ∥ ∫ -∞ -λ 0 e -λ t ( V -i λ I ) -1 d λ∥+∥ ∫ λ 0 ∞ e -λ t ( V -i λ I ) -1 d λ∥<ε (A.5) For the n-th derivative, λ 0 can be replaced by λ 0 + 2n log λ 0 with the preservation of the same inequality. Jourdan's lemma assures the convergence of (A.4) in the complex band. Proof of Theorem 1 Separating, as usual, Hermitian and anti-Hermitian part of the interaction evolution operators (Loudon, 2000) we obtain an equality: .8)   where we have used the operator identity ĉos 2 X + ŝin 2 X = 1 and the mutual orthogonality of the wave function systems of the apparatus {ψ i (0)}, i=1, N and the particle {ψ j ( 0)} , j= N +1, ∞ . This situation will be discussed below. Because of the convexity of the sin(x) function in the first quadrant 0≤x≤π, for sufficiently small t, we can apply Mond-Pečaric theorem (Theorem 91, p. 62, Dragomir (2011)). The theorem places limitations on the convex functions of operators with the spectrum, which is concentrated on the closed interval on the real axis. The inequality in (A.8) can be replaced by the inequality containing the absolute values of matrix elements V ij> N 1 :"
    }
  ]
}