{
  "paperid": "1409.7769v2",
  "title": "Quantum teleportation of multiple degrees of freedom in a single photon",
  "authors": [
    "Wang",
    "Cai",
    "Su",
    "Chen",
    "Wu",
    "Li",
    "Liu",
    "Lu",
    "Pan",
    "Bennett",
    "Briegel",
    "Dur",
    "Cirac",
    "Zoller",
    "Kimble",
    "Gottesman",
    "Chuang",
    "Knill",
    "Laflamme",
    "Milburn",
    "Bouwmeester",
    "Marcikic",
    "De Riedmatten",
    "Tittel",
    "Zbinden",
    "Gisin",
    "Takeda",
    "Mizuta",
    "Fuwa",
    "Van Loock",
    "Furusawa",
    "Krauter",
    "Riebe",
    "Barrett",
    "Pfaff",
    "Steffen",
    "Wei",
    "Barreiro",
    "Kwiat",
    "Nagali",
    "Weinfurter",
    "Pan",
    "Jacobs",
    "Pittman",
    "Franson",
    "Kwiat",
    "Barreiro",
    "Langford",
    "Peters",
    "Kwiat",
    "Mair",
    "Vaziri",
    "Weihs",
    "Zeilinger",
    "Hong",
    "Ou",
    "Mandel",
    "Barreiro",
    "Wei",
    "Kwiat",
    "Nagali",
    "Leach",
    "Fickler",
    "Hayashi",
    "Hashimoto",
    "Horibe",
    "Gühne",
    "Toth",
    "Zukowski",
    "Zeilinger",
    "Horne",
    "Ekert",
    "Graham",
    "Barreiro",
    "Mohseni",
    "Kwiat",
    "Slussarenko",
    "Andrews",
    "Babiker",
    "Jack",
    "Leach",
    "Ritsch",
    "Barnett",
    "Padgett",
    "Franke-Arnold",
    "Pan",
    "Gasparoni",
    "Aspelmeyer",
    "Jennewein",
    "Zeilinger",
    "Zhang",
    "Yin",
    "Bouwmeester",
    "Ma",
    "Lu",
    "Pan",
    "Prevedel"
  ],
  "year": 2024,
  "abstract": "Quantum teleportation 1 provides a \"disembodied\" way to transfer quantum states from one object to another at a distant location, assisted by priorly shared entangled states and a classical communication channel. In addition to its fundamental interest, teleportation has been recognized as an important element in long-distance quantum communication 2 , distributed quantum networks 3 and measurement-based quantum computation 4,5 . There have been numerous demonstrations of teleportation in different physical systems such as photons 6-8 , atoms 9 , ions 10,11 , electrons 12 , and superconducting circuits 13 . Yet, all the previous experiments were limited to teleportation of one degree of freedom (DoF) only. However, a single quantum particle can naturally possess various DoFs-internal and external-and with coherent coupling among them. A fundamental open challenge is to simultaneously teleport multiple DoFs, which is necessary to fully describe a quantum particle, thereby truly teleporting it intactly. Here, we demonstrate the first teleportation of the composite quantum states of a single photon encoded in both the spin and orbital angular momentum. We develop a method to project and discriminate hyper-entangled Bell states exploiting probabilistic quantum non-demolition measurement, which can be extended to more DoFs. We verify the teleportation for both spin-orbit product states and hybrid entangled state, and achieve a teleportation fidelity ranging from 0.57 to 0.68, where | 0 s  and |1 s  denote horizontal and vertical polarization of the SAM, and | 0 o  and |1 o  refer to right-handed and left-handed OAM with  , respectively, and  ,  ,  and  are complex numbers satisfying 2 2 2 2 1         . To do so, they first need to share a hyperentangled photon pair 2-3, which is simultaneously entangled in both the SAM and OAM: 23 23 23 2 3 2 3 2 3 2 3Such a process is referred as hyper-entangled Bell state measurement (h-BSM). After the h-BSM that projects the two photons 1 and 2 onto the state 12 |   , quantum physics dictates that photon 3 will be projected onto the initial state of photon 1:both the SAM and OAM are required to be taken into account as a molecular-like coupled state.A detailed mathematical treatment is presented in Methods, showing that the PBS and two polarizers select the 4 following states out of the total 16 hyper-entangled Bell states:12 12",
  "sections": [
    {
      "heading": "",
      "text": "above the classical limit. Our work moves a step toward teleportation of more complex quantum systems, and demonstrates an enhanced capability for scalable quantum technologies. Quantum teleportation is a linear operation applied to the quantum states, thus teleporting multiple DoFs should be possible in theory 1 . Suppose Alice wishes to teleport to Bob the composite quantum state of a single photon (see Fig. 1a), encoded in both the spin angular momentum (SAM) and the orbital angular momentum (OAM): A crucial step in the teleportation is to perform a two-particle joint measurement of photon 1 and 2, projecting them onto the basis of the 16 orthogonal complete hyper-entangled Bell states, and discriminating one of them, e.g. With an equal probability of 1/16, photons 1 and 2 can also be projected onto one of the other 15 hyper-entangled Bell states (Methods). The h-BSM results can be broadcast as a 4-bit classical information, which will allow Bob to apply appropriate Pauli operations to perfectly reconstruct the initial composite state of photon 1. Experimental realization of the above teleportation protocol poses significant challenges in coherent control of multiple particles and multiple DoFs simultaneously. The most difficult task is to implement the h-BSM, because it would normally require coherently controlled gates between independent qubits of different DoFs. Moreover, with multiple DoFs, it is necessary to measure one DoF without disturbing another one. With linear operations only, previous theoretical work 14 has suggested that it was impossible to discriminate the hyper-entangled states unambiguously. This challenge has been overcome in our work. Figure 1 illustrates our linear optical scheme for teleporting the spin-orbit composite state. The h-BSM is implemented in a step-by-step manner. First, the two photons, 1 and 2, are sent through a polarizing beam splitter (PBS), an optical device that transmits horizontal polarization (| 0 s  ) and reflects vertical polarization ( |1 s  ). After the PBS, we post-select the events that there is one and only one photon in each output. Such events is possible only if the two input photons have the same SAM-both are transmitted ( . It should be noted that the PBS is not OAM-preserving 15 , as the reflection on the PBS flips the sign of the OAM qubit, that is, Unfortunately, the above two interferometers cannot be simply cascaded. The working of the interferometers rests on the assumption that two input photons are from different path. When directly connected, the 50% chance of both photons coalescing into a single output spatial mode after the first interferometer would remain undetected (no \"coincidence\" event is known), and would further induce erroneous coincidence event after the second interferometer, thus failing both BSMs. This is a ubiquitous and important problem in linear optical quantum information processing 5,17 . Our remedy is to exploit quantum non-demolition (QND) measurement-seeing a single photon without destroying it and keeping its quantum information intact. Interestingly, quantum teleportation itself can be used for probabilistic QND detection 7,18 . As shown in Fig. 1b, another pair of photons entangled in OAM is used as ancillary. The procedure is a standard teleportation: If there is an incoming photon, a two-photon coincidence detection behind a BS can happen with a 50% efficiency, triggering a successful BSM, which heralds the presence of the incoming photon and meanwhile faithfully teleports the quantum state of the incoming photon to a freely propagating photon. In the case of no incoming photon, two-photon coincidence behind the BS never happen, in which case we will know and ignore the out-going photon. Thus, using the QND measurement, the BSM interferometers can be concatenated. Note that using a QND in one of the arm of the BS is sufficient due to the conserved total number of eventually registered photons. Our protocol can identify two hyper-entangled Bell states with an overall efficiency of 1/32 (Methods). The QND method is also applicable to boost the efficiency of photonic quantum logic gates in the Knill-Laflamme-Milburn scheme for scalable optical quantum computing 5 . Figure 2 shows the experimental setup for the realization of quantum teleportation of the spin-orbit composite state of a single photon. Passing a femtosecond pulsed laser through three type-I β-barium borate (BBO) crystals generates three photon pairs [19][20][21] , engineered in different forms (Methods). From the first photon pair (1-t) , triggered by the detection of its sister photon (t), a heralded single photon to be teleported is prepared in the spin-orbit composite state |  . The second pair (2-3) is created in the hyper-entangled state To demonstrate that teleportation works universally for arbitrary quantum superposition states, we test the following five representative initial states: . These states can be grouped into three categories. The first two, A |  and B |  , are product states of the both DoFs in the computational basis. C |  and D |  are products states of both DoFs in the superposition basis. The last one, E |  , is a spin-orbit hybrid entangled state. The four product states are prepared by independent single-qubit rotations, using wave plates for SAM and spiral phase plate (SPP) or binary phase plate (BPP) for OAM, respectively. The entangled state is generated by counter-propagating a SPP inside a Sagnac interferometer (Methods). The implementation of the h-BSM and QND measurement requires Hong-Ou-Mandel 22 type interference of two indistinguishable single photons with good spatial and spectral overlap. To make the independent photons 1, 2, 4, and 5 indistinguishable, their arrival time is matched to be within 10 fs , much smaller than the coherence time of the down-converted photons The final verification of the teleportation results relies on the coincidence detection counts of the six photon encoded in both DoFs, which would suffer from a low rate. It should be noted that all the pervious experiments 15,20,21,[23][24][25][26] with OAM states have never gone beyond two single photons. We overcome this challenge by preparing high-brightness hyper-entangled photons and designing dual-channel and high-efficiency OAM measurement devices (Methods). To evaluate the performance of the teleportation, we measure the teleported state fidelity , defined as the overlap of the ideal teleported state (|  ) and the measured density matrix (  ). Conditioned on the detection of the trigger photon t and the four-photon coincidence after the h-BSM, we register the photon counts of the teleported photon 3 and analyse its composite state. The fidelity measurement for the product states are straightforward as we can measure the SAM and OAM qubits separately. We measure the final state in the | 0 / |1 s s   and | 0 / |1 o o   basis for the A |  and B |  teleportation, in the (| 0 |1 ) / 2 s s    and (| 0 |1 ) / 2 o o    basis for the C |  teleportation, and in the (| 0 |1 ) / 2 s s i    and (| 0 |1 ) / 2 o o i    basis for the | D  teleportation, respectively. From our data shown in Fig. 3, the teleportation fidelities for A |  , B |  , C |  and D |  yield 0.68 0.04  , 0.66 0.04  , 0.62 0.04  and 0.63 0.04  , respectively. For the entangled state E | where the SAM and OAM qubits are not separable, its fidelity can be decomposed as 1 ˆˆˆˆˆˆ[ ( )] 4 s o s o s o E x x yy zz F Tr I            , where x  , y  and z  are the Pauli operators. The expectation values of the joint observables, ˆŝ o x x   , ˆŝ o y y   and ˆŝ o z z   , can be obtained by local measurements in the corresponding basis for the two DoFs, (| 0 |1 ) / 2   , (| 0 |1 ) / 2 i    , and | 0 / |1   , respectively. Our experimental results on the three different basis are presented in Fig. 4a-c, from which we determine a teleportation fidelity of 0.57 0.02  for the entangled state. We note that all reported data are without background subtraction. The main sources of error include double pair emission, imperfection in the initial states, entangled photons 2-3 and 4-5, two-photon interferences, and OAM measurement. We note that the teleportation fidelity of the states in the three categories are affected differently by the error sources (Methods). The measured fidelities of the five typical teleported states (summarised in Fig. 4d) are all well beyond 0.40-the classical limit, defined as the optimal state estimation fidelity on a single copy of a two-qubit system 27 . These results prove the successful realization of quantum teleportation of the spin-orbit composite state of a single photon. Furthermore, for the entangled state E | , we emphasize that the teleportation fidelity exceeds the threshold of 0.5 for proving the presence of entanglement 28 , which demonstrates that the hybrid entanglement of different DoFs inside a "
    },
    {
      "heading": "Figures:",
      "text": "3 3 12 12 3 3 12 12 3 3 3 12 12 3 3 3 12 12 3 3 3 12 12 3 3 12 12 3 3 3 12 12 where ˆs x  , ˆs y  and ˆs z  ( ˆo x  , ˆo y  and ˆo z  ) are the Pauli operators for SAM (OAM) qubits. It indicates that, regardless of the unknown sate 1 |  , the 16 measurement outcomes are equally likely, each with a probability of 1/16. By carrying out the hyper-entangled Bell state measurement (h-BSM) on photons 1 and 2 to unambitiously distinguish one from the group of 16 hyper-entangled Bell states, Alice can project photon 3 onto one of the 16 corresponding states. After Alice tells Bob her h-BSM result as a 4-bit classical information via a classical communication channel, Bob can convert the state of his photon 3 into the original state by applying appropriate two-qubit local unitary transforms ˆˆˆˆ[(I, , , ) (I, , , )]"
    },
    {
      "heading": "Two-photon interference of spin-orbit composite state on a PBS",
      "text": "The input and output of two photons 1 and 2 encoded in SAM and OAM on a polarizing beam splitter (PBS) as shown in Fig. 1 can be summarised as follows: Note that PBS is not OAMpreserving, as the reflection flips the sign of OAM. Therefore, the output state for each of the input 16 hyper-entangled Bell states can be listed below: (S1.9)"
    },
    {
      "heading": "BSM and teleportation of OAM qubits",
      "text": "Having measured and filtered out the SAM qubit, next we perform BSM on the OAM qubit. Dealing with a single degree of freedom is more straightforward, which can be implemented by a beam splitter (BS). Similar to PBS, BS is also not OAM-preserving, as the reflection on the BS will also flip the sign of OAM. Therefore, the transform rules on a BS for the four OAM Bell states are: We can see that only the Bell state 12 |    will result in one and only one photon in each output, whereas for the three other Bell states, the two input photons will coalesce into a single output mode. Among these three Bell states, the state 12 |    can be further distinguished by measuring two single photons in either output with OAM orthogonal basis | 0 / |1 o o   . Thus, this would allow us to unambiguously discriminate 2 from the 4 Bell states. Experimentally, we design dual-channel OAM readout devices to measure the | 0 o  and |1 o  simultaneously. Therefore, the efficiency for both QND and BSM on OAM is 1/2. The overall efficiency of h-BSM combing all the three steps is 1/ 8 1/ 2 1/ 2 1/ 32    ."
    },
    {
      "heading": "Generating three photon pairs:",
      "text": "Ultrafast laser pulses with an average power of 800 mW, central wavelength of 394 nm, pulse duration of 120 fs, and repetition rate of 76 MHz, successively pass through three BBO crystals (Fig. 2) to generate three photon pairs through type-I spontaneous parametric down-conversion (SPDC). The first and the third crystal are 2-mm thick BBOs, whereas the second one consists of two 0.6-mm thick contiguous type-I BBO crystals with optic axes aligned in perpendicular planes. All the down converted photons have central wavelength at 788 nm. The first photon pair 1-t is initially prepared in the zero-order OAM mode with a coincidence count rate of We note that the whole conversion process is deterministic."
    },
    {
      "heading": "Dual-channel and efficient OAM measurement:",
      "text": "One of the most frequently used OAM measurement devices in the previous experiments is offaxis hologram gratings 21,23,24,31 , which however typically have a practical efficiency (p) of about 30% 31 . This low efficiency would cause an extremely low six-photon coincidence count rate that scales as 6 p , more challenging than the scaling ( 2 p ) in the previous two-photon OAM experiments. To overcome this challenge, we use two different types of devices for efficient OAM readout. The first type is what we refer to as \"dual-channel\" OAM measurement devices, used after the two BSs. The strategy is to transfer the OAM information to the photon's SAM, and measure it using a PBS with two output channels. The method is as follows: After the BS, each photon passes through a HWP and is preared in the state (| 0 |1 ) / 2 s s    . They are then sent into Sagnac interferometers with a Dove prism inside 32 (see Fig. 2), which is placed with a / 8  angle with respect to the interferometer plane. The photon is rotated by an / 4  ( / 4   ) angle for the | 0 s  (|1 s  ) SAM component when forward (backward) passing through the Dove prism. Considering an OAM state | 0 o  (|1 o  ) with a phase i e  ( i e   ), where  is the azimuth angle in the polar system passes through a Dove prism rotated at / 8  , it will be rotated by an angle of / 4  and the phase will be changed to ( /4) i e    [ ( /4) i e     ]. Therefore, two opposite phase /4 i e  and /4 i e   will be added to the two orthogonal OAM modes. Finally, the output photon is transformed into the| 0 s  (|1 s  ) polarization using a QWP. The overall transformation can be summerised as a CNOT gate between the OAM and SAM: |1 s  HWP Sagnac QWP /4 /4 HWP Sagnac QWP /4 /4 | 0 | 0 (| 0 |1 ) | 0 / 2 (| 0 |1 ) | 0 / 2 | 0 | 0 , | 0 |1 (| 0 |1 ) |1 / 2 (| 0 |1 ) |1 / 2 |1 |1 s o s s o i s s o i s o s o s s o i s s o i s o e i e e i e     Effectively, the OAM qubit is deterministically and redudantly encoded by the SAM qubit, i.e., the SAM becomes idential to the OAM state. Thus, by measuring the SAM using a PBS with two output channel, we can derive the informaiton of the OAM with a high efficiency of ~97%. In our experiment, four such Sagnac interferometers are utilized in the h-BSM. In this way, two out of the four OAM Bell states can be discriminated using a BS. While the first type is like a two-channel readout device (like a PBS for SAM), the second type is like a one-channel readout device (like a polarizer for SAM), and is used in the final stage of state verification after teleportation. The strategy for the projective OAM measurement is by transforming it into the zero-order OAM mode so that the photon can be coupled into a singlemode fibre, while all other higher-order OAM modes will be rejected. Here we use SPP 33 and BPP 33 for efficient OAM readout. SPP 33 is designed with a spiral shape to create a vortex phase of il e  , where l is an integer and referred to as topological charge. SPP can attach a vortex phase il e  ( il e  For the coherent transformation between the OAM zero mode and the superposition states , a 2-phase level BPP 33,34 is used with an efficiency of ~80%. These high-efficiency OAM measurement devices boost the six-fold coincidence count rate in our present experiment by more than two orders of magnitudes, compared to the previous use of hologram gratings."
    },
    {
      "heading": "Error budget",
      "text": "The sources of error of our experiment include: 1. Double pair emission in spontaneous parametric down conversion; 2. Partial distinguishability of the independent photons interfered on the PBS (~5%) and BSs (~5%); 3. State measurement error due to zero-order OAM leakage (~2%); 4. Fidelity imperfection of the entangled photons 2-3 (~5%) and 4-5 (~9%); 5. Fidelity imperfection of the to-be-teleported single-photon hybrid entangled state (~8%). Some error sources affect all the teleported states. First, the double pair emission contributed ~15% background to the overall six-fold coincidence counts. If this is subtracted, the average teleportation fidelity would be improved to ~0.74. Second, the imperfectly entangled photon pair 4-5 and the imperfect two-photon interference at the BS1 and BS2 (for QND and OAM Bell-state measurement, respectively) degrades the teleportation fidelity for all states by ~13%. Third, the imperfect state measurements mainly due to the zero-order OAM leakage cause another degradation of ~2%. We analyse that some error sources can affect differently on different teleported states. The imperfect two-photon interference at the PBS degrades the teleportation fidelity for the states highest. This is in consistent with the observation of the previous results: for the experiments using a PBS [35][36][37] , the teleportation fidelities in the H/V basis is higher than those in the (H+V)/(H-V) and (H+iV)/(H-iV) basis); whereas for the experiments 38,39 using a non-polarising BS, the teleportation fidelities in all polarization basis are largely unbiased. We note that the teleportation fidelity for the hybrid entangled state These noise can be in principle eliminated using various methods in the future experiments. For instance, deterministic entangled photons 40 can avoid the problem of double pair emission. We also plan to develop bright OAM-entangled photons with higher fidelity, and more precise 32phase level SPP for the next experiment of hyper-entanglement swapping."
    },
    {
      "heading": "A universal scheme for teleporting N DoFs",
      "text": "We illustrate in Extended Data Figure 2 a universal scheme for teleporting N DoFs of a single photon. For simplicity, we discuss an example for three DoFs (Extended Data Figure 2b), labelled as X, Y, and Z. There are in total 64 hyper-entangled Bell states: the products of the Bell states of each DoF, as defined below: The aim is to perform an h-BSM, identifying 1 out of the 64. The required resources include: photon pairs entangled in the Z DoF, hyper-entangled in the Y-Z DoFs, and hyper-entangled in the X-Y-Z DoFs, filters for the three DoFs that can project the state to 0 or 1 (with a functionality similar to the polarizers for SAM), qubit flip ( x  ) operations for the DoFs, 50:50 non-polarising BS, and single-photon detectors, all of which are commercially available or have been experimentally demonstrated previously. It has been known that if two single photons are superposed on a BS, only asymmetric quantum states can lead to the case that one and only one photon exits from each output of the BS. In the simplest case of one DoF, this is the asymmetric   state. As now we have three DoFs, we have to consider the combined, molecular-like quantum states. There are in total 28 possible combination that are asymmetric states, as listed below: After passing through the first BS, we can filter out these 28 from the total 64 hyper-entangled Bell states conditioned on seeing one and only one photon in each output of the BS. Next, we apply two filters in the two output of the BS to project the X DoF into   . One filter is set to pass the 1 state and the other is set to pass 0 state. This results in the below 16 filtered states from the 28, as listed below: We perform a bit-flip operation on the X DoF on one of the arms, erasing the information on the X DoF. We then pass them into the second BS, filtering out the asymmetric 6 combinations: We emphasize that, before sending the photons to the seond BS, due to the same reason discussed in the main text, we use teleportation-based QND measurement to ensure the two photons can be further fed into the following cascaded interferometers. Here, the QND should preserve the quantum information in the Y and Z DoF. Thus, a quantum teleportation of two DoFs of a single photons is required as a key module (Extended Data Figure 2a), which is exactly what we have demonstrated in the experiment presented in the main text. After that, we again pass them through two filters on the Y DoF, one set in the 1 and the other one set in the 0 state, which leaves 4 asymmetric combinations: Similarly, we perform a bit-flip operation on the Y DoF on one of the arms, erasing the information on the Y DoF. We then do a QND measurement on the Z DoF, and pass the two photons into the third BS, finally filtering out the only remaining asymmetric state: By detecting one and only one photon out of the third BS, we can thus discriminate this particular hyper-entangled state from the 64 hyper-entangled Bell states on three DoFs. To experimentally demonstrate the teleportation of three DoFs, the scheme would need in total 10 photons (or 5 entangled photon pairs from SPDC), which is within the reach of near future experimental abilities given the recent advances in high-efficiency photon collection and detection. It is obvious that the above protocol can be extended to more DoFs as displayed in Extended Data Figure 2c."
    },
    {
      "heading": "Feed-forward scheme for spin-orbit composite states",
      "text": "To realize a deterministic teleportation, feed-forward Pauli operations on the teleported particle based on the intrinsically random Bell-state measurement results are essential. In our present experiment, no feed-forward has been applied. Here we briefly describe how this can be done for the spin-orbit composite state. For the SAM qubits, active feed-forward has been demonstrated before using fast electro-optical modulators (EOMs) 39,41 . To take advantage of this existing technology with demonstrated high-speed operation and high gate fidelity, we employ a coherent quantum SWAP gate between the OAM and SAM qubits. The SWAP gate is defined as: The operation sequence for the feed-forward operation on the spin-orbit composite states is shown in the Extended Data Figure 3a. First, the SAM feed-forward is done with an EOM. Second, the SAM and OAM qubits undergo a SWAP gate. Third, an EOM is used to operate on the \"new\" SAM that is converted from the OAM. Note that the EOM doesn't affect the OAM, so that the previous operation on the SAM is unaffected. Lastly, a final SWAP gate convert the SAM back to OAM, which completes the feed-forward for spin-orbit composite states. The SWAP gate is composed of three CNOT gates (see the Extended Data Fig. 3b). In the first and third CNOT gate (blue shading), the SAM qubit is the control qubit that acts on the OAM as target qubit, realized by sending a photon through, and recombined on a PBS. On the reflection arm only, a Dove prism is inserted to induce an OAM bit flip. In the second CNOT (yellow shading), the control (target) qubit is the SAM (OAM), as explained in the Methods (parallel SAMs, see solid circles). We measure each single photon from the two outputs of the PBS in the 1' 2' D D basis (1' and 2' denote the output spatial modes). At zero delay where the photons are optimally overlapped in time, the orthogonal SAM input yields an output state of conditioned on a coincidence detection, which can be decomposed in the diagonal basis as , thus showing an enhancement. For the parallel SAM input, the output stat is could be implemented based on the three principles: (1) BS could post-select the asymmetric hyper-entangled Bell states in N DoFs which contain odd numer of asymmetric Bell state in one DoF, (2) two filters and one bit flip operation will erase the information on the measured DoF and further post-select asymmetric states, (3) teleportation-based QND in less DoFs will enable one and only one photon pass through the next BS, which will allow the connection of the cascaded interferometers. Extended Data Figure 3 | Active feed-forward for spin-orbit composite states. a, The active feed-forward scheme. This composite active feed-forward could be completed in a step-by-step manner. First, we use a EOM to implement the active feed-forward for SAM qubits. Second we employ a coherent quantum SWAP gate between the OAM and SAM qubits. The orignal OAM will be converted into the \"new\" SAM, which active feed-foward will be completed by a second EOM. Then the OAM and SAM qubits will undergo a second SWAP gate and be converted to the orginal DoFs. Because EOM doesn't affect OAM, the first EOM completes the active feedforward for the original SAM and the second EOM is utilized for the \"new\" SAM corresponding the orginal OAM. Therefore, two EOMs and two SWAP gates will enable the active feed-forward for spin-orbit composite states. b, The quantum circuit for a SWAP gate between the OAM and SAM qubits. The SWAP gate is composed of three CNOT gates: in the first and the third CNOT gates, the SAM qubit acts as the control qubit and the OAM qubit is the target qubit, while in the second CNOT gate, the OAM (SAM) acts as the control (target) qubit. Extended Data Figure 2 Extended Data Figure 3 Single photon state encoded in 3 DOFs Alice 1 2 3 BS1 Bob Filter Hyper-entanglement source in 2 DOFs U A U B BS2 QND h-BSM 2 DOFs Bit flip a Alice 1 2 3 BS1 Bob Hyper-entanglement source in 3 DOFs BS2 QND in 2 DOFs h-BSM 3 DOFs BS3 QND Classical information Classical information Single photon state encoded in DOFs N Alice 1 2 3 BS1 Bob Hyper-entanglement source in DOFs N BS2 QND in -1 DOFs N h N -BSM DOFs Classical information BS3 QND in -2 DOFs N …… b c BSN Single photon state encoded in 2 DOFs U A U B U C U j N EOM SAM OAM b SWAP SWAP OAM SAM SAM OAM a EOM SWAP SAM OAM SAM OAM Comp. Dove PBS HWP QWP"
    }
  ]
}