{
  "paperid": "1809.05685v1",
  "title": "Commentary on Quantum-Inspired Information Retrieval",
  "authors": [
    "Ashoori",
    "Rudolph",
    "Abramsky",
    "Coecke",
    "Arafat",
    "Baeza-Yates",
    "Ribeiro-Neto",
    "Barnum",
    "Wilce",
    "Barrett",
    "Bartlett",
    "Rudolph",
    "Spekkens",
    "Busemeyer",
    "Pothos",
    "Franco",
    "Trueblood",
    "Caves",
    "Fuchs",
    "Caves",
    "Fuchs",
    "Schack",
    "Coecke",
    "Coecke",
    "Coecke",
    "Moore",
    "Wilce",
    "Coecke",
    "Sadrzadeh",
    "Clark",
    "Deutsch",
    "Eisenberg",
    "Barry",
    "Frommholz",
    "Larsen",
    "Piwowarski",
    "Lalmas",
    "Ingwersen",
    "Van Rijsbergen",
    "Harrigan",
    "Rudolph",
    "Harrigan",
    "Spekkens",
    "Huertas-Rosero",
    "Azzopardi",
    "Van Rijsbergen",
    "Kantor",
    "Kirkpatrick",
    "Law",
    "Klobučar",
    "Pipan",
    "Leong",
    "Vetere",
    "Howard",
    "Melucci",
    "Melucci",
    "Van Rijsbergen",
    "Pavlovic",
    "Piwowarski",
    "Frommholz",
    "Lalmas",
    "Van Rijsbergen",
    "Piwowarski",
    "Lalmas",
    "Randall",
    "Foulis",
    "Rieffel",
    "Spekkens"
  ],
  "year": 2013,
  "abstract": "There have been suggestions within the Information Retrieval (IR) community that quantum mechanics (QM) can be used to help formalise the foundations of IR. The invoked connection to QM is mathematical rather than physical. The proposed ideas are concerned with information which is encoded, processed and accessed in classical computers. However, some of the suggestions have been thoroughly muddled with questions about applying techniques of quantum information theory in IR, and it is often unclear whether or not the suggestion is to perform actual quantum information processing on the information. This paper is an attempt to provide some conceptual clarity on the emerging issues.the retrieved list, the user may provide feedback to the system by distinguishing documents that are relevant or modifying his/her initial information need. That is, IR is an interactive process -the behaviour of the user modifies the system.For several years the IR community has been considering some of the techniques and mathematical structures that have been used in quantum theory to model their tasks at hand. These mathematical structures have typically been used by analogy, however, some of these approaches generate confusion. At least two papers have been written, targeting the IR community, to highlight some of the concerns about this program of research (Kantor, 2007;Rieffel, 2007). However, on the basis of our observations of both the IR and Quantum Information communities, those who have a deep understanding of the physics of quantum theory and those who know merely the mathematical framework of quantum theory, tend to develop very different understanding of what has and has not been done in quantum-inspired IR. This paper is an introductory attempt to clarify the emerging issues and the authors hope it can benefit both communities.The paper is organised as follows. Section 2 discusses what IR researchers expect from Quantum Theory. In Section 3, we provide a warning about the difference between storing information in a classical computer and storing quantum information on a quantum computer.Sections 4 and 5 describe various fundamental and advanced elements of QM, comparing them with their classical counterparts and discussing various proposed IR equivalences. The final discussion section lays out a number of challenges for this program of research if it is going to be successfully pursued.2 What do IR researchers want from Quantum Theory?In this section we present our understanding of what IR researchers want from QM.IR arose as a field driven by pragmatic considerations. Unlike other areas of classical computer science, finding a fundamental axiomatic formulation of the field has proven tricky, perhaps because of the intrinsic role humans play in the process and because information has proven considerably easier to capture mathematically than \"meaning\". Quantum-inspired IR (QIIR) is an attempt to lay such a foundation. The starting point can be traced back to viewing the field by the founder of QIIR, van Rijsbergen (1989), as a form of inference (from a document to a",
  "sections": [
    {
      "heading": "Introduction",
      "text": "This paper comments on the recent approaches referred to as \"quantum-inspired\" in Information Retrieval (IR) research. IR is an area of classical computer science which covers problems related to the effective and efficient access to large amounts of stored information, where this information can be text documents, images, video, audio, etc (Baeza-Yates & Ribeiro-Neto, 1999). In ad-hoc information retrieval, which is the most common situation with which an IR system is concerned, input documents are transformed into a suitable representation for the IR system by an indexing process. A user expresses an information need in the form of a request that is formalised into a query by the IR system. The IR system compares the query against each document representation using a matching function determined by the adopted IR model. As a result of this comparison, the IR system produces a list of documents that are ranked from the most relevant to the least relevant, and this list is displayed to the user. This list reflects those documents that the IR system thinks are about the query. In IR aboutness is a semiformalised notion which \"arises from an attempt to reason abstractly about the properties of documents and queries in terms of index terms\" (van Rijsbergen, 2004, p.19). After examining query or from a query to a document). That is, a document is relevant to a query if it logically implies the given query and a measure of uncertainty is associated with such an implication. The uncertainty of implication is used to model the uncertainty of relevance. This unifying viewpoint was motivated from prior work re-expressing three standard retrieval models (Boolean, Probabilistic and Co-ordination) in terms of uncertain implication (van Rijsbergen, 1986). In this proposal, it was suggested that accepting retrieval as inference allows us to \"speak quite clearly about theories of IR\". Theories themselves were described as \"a language together with axioms and rules of inference\", which provide a logic to perform this implication, and a measure of uncertainty of this implication (van Rijsbergen, 1989). Van Rijsbergen (1981, 2004) proposed to use the mathematical language of quantum mechanics, to describe the objects and processes in IR. It was also suggested that \"quantum mechanics provides a ready-made interpretation of this language. It is as if in physics we have an example semantics for the language, and as such it will be used extensively to motivate a similar but different interpretation for IR\" (van Rijsbergen, 2004, preface). While these intuitions are, at first glance, quite reasonable, there are difficulties in particulars. There is an indication of such from the outset (van Rijsbergen, 2004, preface): \"The important notions in quantum mechanics, state vector, observable, uncertainty, complementarity, superposition and compatibility readily translate into analogous notions in information retrieval, and hence the theorems of quantum theory become available as theorems in IR\". However, when we encounter some of the proposed IR-equivalences in Sections 4 and 5, we will see that the majority do not admit a concrete or clear analogy which leads us to one of the main points of the paper: One should be very cautious about using the theorems of quantum theory as theorems in IR. In this suggested quantum representation for IR, objects are represented within a Hilbert space, and a user can interact with these objects through measurement. Measurement here is defined as application of linear operators (observables) to objects (See Section 4.2). The outcome of this measurement is considered to be potentially probabilistic. One aim for using this mathematical language was \"to apply the quantum theoretic way of looking at measurement to the finding of relevance in IR\" (van Rijsbergen, 2004, p.17). The essence of this proposal is the claim that using the mathematics of Hilbert space, which is also used by quantum theory, one can find a way of looking at information retrieval problems while being able to address questions of logic, probability and vector spaces within one framework. Where does the logic of inference come from? The properties of observables on Hilbert space form a non-Boolean lattice, which induces a non-Boolean logic; accordingly, the outcome of applying observables to these objects is controlled by this logic (van Rijsbergen, 1996). The outcomes of measurement have associated with them a probability as specified by the Gleason's Theorem (See van Rijsbergen (2004) for further details). Further motivations for suggesting such a program were to model the complex notion of relevance (van Rijsbergen, 2004), to capture the interaction between users and a retrieval system particularly with respect to the fact that both user and the IR system are allowed to evolve (Piwowarski & Lalmas, 2009) and to capture the user's context to help users finding information (Melucci, 2008). In the rest of this paper we provide some perspective on the above, our first step will be to clarify the difference between classical and quantum information processing. 3 Warning: QIIR involves no physical quantum information A warning similar to what we address in this section was raised in Rieffel (2007) wherein the author briefly addressed \"what is and isn't quantum information processing\". We believe that it is well worth elaborating on this in the context of QIIR. Mathematically a quantum state is a normalized vector of complex entries. The quantum state of even a small number of particles is vastly too large to \"write down\" as classical bits. For example, a generic state of 50 two-level quantum systems (photons, atoms, spins etc) is represented by 2 50 complex numbers, which if stored using single precision floating-point numbers (32-bit) would require 8192TB of space (about 10 12 pieces of paper!) to store as a vector on a classical computer. Observables or unitary transformations to act on the state require even more than this. If we do have a lot of memory available and we write down the state of a number of particles then we have represented the quantum state by classical information. For such a classical representation of a quantum state we can of course read out any element of the state vector we choose, something we shall see is very different to how real quantum states are accessible in the physical world. In the real world we can in principle physically prepare 50 or more particles in a quantum state, despite normally not being able to write this state down classically. The preparation is not performed by somehow coupling a 8192TB hard drive to the particles and somehow copying in the elements of the desired state onto the systems! Rather, instructions on how to physically prepare the desired quantum state must be written on (a small number of) pieces of paper and passed on to a PhD student, who implements them in a lab. The instructions are classical information, they concern how to arrange pieces of equipment, and since they are also classical and on a small number of pages they could not contain 2 n parameters for any reasonably large n. We say they contain polynomial in n (poly(n)) parameters. 1Now, once the student has followed the instructions and prepared the particles in some quantum state we cannot then interact with those systems and simply \"read out\" any particular entry of the state vector we choose. If we could do so we would, in fact, have extraordinary computational power (see Appendix A for further details). The problem is that as soon as we interact with the systems we obtain indeterministic data and moreover we destroy the quantum state of the systems in so doing. So this is a big difference between a classical representation of a quantum state (the main focus of IR) and a genuinely quantum representation of a quantum state (which is a bunch of particles prepared to actually be in that state). In fact, even though we might know the instructions the student followed to prepare the state, in general we cannot efficiently (i.e. using an algorithm on a classical computer that requires only poly(n) space and time) calculate the probabilities of measurement observables on this state. These points are subtle even to practitioners of quantum physics and so bear some elucidation. So one might hope that perhaps the subset of quantum states which are prepared in physics labs might be a subset we can both efficiently represent on a classical computer (for instance by storing just the instructions we gave the student!) and then be able to compute (classically) the probabilities of measurement outcomes for a specified observable on such a state. The observables themselves need to be ones that can be efficiently written down and parsed into experimental instructions too of course. The whole field of quantum information and computation is premised on the supposition (for which there is extremely good evidence) that this is not the case. We really do nee"
    },
    {
      "heading": "Structural elements of QM and various proposed IR equivalences",
      "text": "The aim of this section and the next section is to give a clear picture of the basic elements of QM and suggested IR analogous notions. We also compare these elements with their classical counterparts. We do not provide judgement on whether these analogies are sensible and concrete or not. The authors by no means claim that the list is exhaustive; These are merely a selected subset of features sufficient for the purpose of this commentary."
    },
    {
      "heading": "Systems and States",
      "text": "The status of the quantum state in physics is contentious. However all interpretations of quantum mechanics agree that quantum states are inferential objects: they at least play a role of allowing us to predict the probabilities of future experimental outcomes. A Bayesian view of quantum mechanics (Caves, Fuchs, & Schack, 2002) suggests that this is all they are (or ever can be), but there are certainly opposing opinions (Valentini, 2009;Deutsch, 1999). In classical physics the line is clear: epistemic states (states of knowledge/information) are probability distributions over some space, the points of which -the 'ontic' or real states -encode the physical properties of the system. For instance; a single particle's ontic states are points in phase space, namely a position and a momentum. However, it is plausible an agent does not know the exact position or the exact momentum of a particle and so assigns a probability distribution (known in physics as a Liouiville distribution) over the phase space based on their information. Note that it is not impossible to think of quantum states in a similar way, but it does lead to some unusual looking descriptions of 'underlying reality' and so it is not adopted by most physicists (Harrigan & Rudolph, 2007;Harrigan & Spekkens, 2010). Given that quantum states are inferential objects, we point out at this juncture that we could use a complete list of all probabilities of all possible measurement outcomes as a description of the state of the quantum system -an infinite list -but because of relationships between those probabilities we find using a finite vector in Hilbert space allows just as good inferences in a more compressed form. Why are state vectors called inferential objects? This is because QM does not allow us to read out any specific entries of the state vector we choose, and accordingly we need to perform measurement to predict the probabilities of future experimental outcomes from this inferential object. We now turn to proposed analogous IR notions to quantum systems and quantum states of which several appear in IR literature. However, we refer to two of the most developed ones, namely, representing the state of a document or the state of a query as an inferential object. In the first approach, a given document is regarded as a quantum system and the problem of representing or indexing this document is considered analogous to that of representing quantum states of a physical system (Huertas-Rosero et al., 2008). The state of a document is therefore considered the inferential object. In IR vocabulary, this inferential object \"encapsulates the answers to all possible queries\" (van Rijsbergen, 2004). In principle the state assigned to the document could just be represented as a list of the probabilities (likelihoods) associated to every query -ie the queries play the role of measurement. However a more compressed version is obviously desirable. In the second approach, a user's information need is considered as a quantum system and the state of this information need -the query -is the inferential object (Piwowarski & Lalmas, 2009) analogous to the quantum state, which can be used to calculate the outcome probabilities for all possible different measurements (documents) that may be performed."
    },
    {
      "heading": "Measurement Observables",
      "text": "Measurements are described mathematically in quantum theory via applying an observable, that is, a Hermitian (self-adjoint) operator, or more precisely the projectors onto the eigenvectors of the observable in question, onto the state of a given system. Both the probabilities of an outcome and the post measurement state form part of the formalism and are deducible given a specific state and observable pair. Both classical epistemic and quantum states are disturbed by a measurement -they both 'collapse'. In the classical case this is not mysterious -when one gains information one changes the probability one assigns to a physical situation instantly. In the quantum case whether this is mysterious or not depends on whether one takes a Bayesian view or one's interpretation of the quantum state, an issue we are avoiding (Caves et al., 2002). What is certainly clear is that the disturbance in the quantum case is more radical due to the possibility of incompatible measurements. Incompatible measurement refers to observables which are not jointly measurable, i.e. can not be measured at the same time, and measurement of one of them causes a disturbance to one's ability to predict the outcome of the other. Classical measurements are always compatible, quantum measurements can be either compatible or incompatible. Interestingly, incompatible measurement is not always specific to quantum theory. There exist toy theories (Spekkens, 2007;Bartlett, Rudolph, & Spekkens, 2011) which have incompatible measurements. These theories generate features people think of as typically quantum but the fact is that they are a restricted version of a classical theory. Another example of classical systems with incompatible variables can be found in Kirkpatrick (2003). We will elaborate more on incompatibility in Section 5.2. We now return back to the question of what do we need to infer from a given system's state in IR? Several possibilities come to mind. If the task is finding documents relevant to a query, and the state of documents are considered as the inferential objects, then it seems natural that what should replace the role of measurements on the quantum system is a query (van Rijsbergen, 2004). The user of the IR system will then be the person who chooses a measurement to perform -i.e. who chooses one from a set of possible queries to make. Posing a query by the user is regarded as applying a measurement operator onto the state of a given system. We need to assume that the query applied to any document yields a real number from 0 to 1, a number that, in the quantum case, is the probability of that outcome. These numbers are considered as indicative of likelihoods of user satisfaction. Thus the simple binary query to a document \"I am interested in pictures of an elegant motorcycle, do you contain one?\" should yield a real number p ∈ [0; 1] which is higher if the document contains a picture that the user will likely find elegant. From this perspective the person who mathematically requires the inferential object is not the user per se, rather it is the person who is programming the IR system -the system programmer wants to infer whether any given document has a high or low likelihood of satisfying the user, given a future query to be chosen by users. Note that in this scenario we have separated the role of measurer from that of inferrer, which typically we do not bother doing in QM, but which here seems necessary. For a single-term query, an observable corresponds to a yes/no question. For multi-term queries, the entire query is considered to be an observable which can be reduced to a combination of yes/no questions using the spectral decomposition theorem (van Rijsbergen, 2004). In the second approach, queries are considered as states of a quantum system, and then documents correspond to the role of measurement, e.g. (Piwowarski, Frommholz, Lalmas, & van Rijsbergen, 2010)."
    },
    {
      "heading": "Dynamics",
      "text": "First we look at a closed quantum system which does not interact with any observer. A given quantum system evolves in time in a manner that depends both on intrinsic (internal) features and extrinsic (things nearby) ones. In this case the system changes continuously and the evolution operator is represented by the Schrödinger equation. This time evolution operator satisfies a number of criteria, including being a linear unitary operation, deterministic and differentiable in time. In quantum dynamics we are not free to choose whatever rules we wish to represent this time evolution. This evolution is in marked contrast to the already mentioned fact that upon measurement a quantum system's state changes discontinuously -it collapses into one of the observable's eigenstates with some probability (itself dependent on the geometry of Hilbert space via Born's Rule). As the evolution operator must map an allowed state of the system to another allowed state (most operations would take us to invalid states) there is therefore a trade-off between the allowed states of a theory and the allowed dynamics of the theory (Barrett, 2007). Allowed state refers to those states that \"correspond to physically possible states of a system\" (Barrett, 2007). It is worth mentioning here that there exist theories that are neither quantum nor classical but their dynamic is classical (See Barrett (2007) for some examples of these theories). In the context of interactive IR, it is suggested that if a user's query is represented as a quantum state then this state evolves when the user interacts with the system. Two different dynamics are suggested (Piwowarski & Lalmas, 2009). Firstly, during the interaction of the user with the IR system, the system's understanding of user's information need changes. Secondly, a user may change his/her information need after receiving some information during the interactions with the IR system. Any interaction between the IR system and the user is modelled as a measurement, and measurement is modelled using projection operators (yes/no observable), hence following the discontinuous type of dynamics as mentioned above. In the second approach, if a document is represented as a quantum state then this state may need to be evolved discontinuously (by the inferrer) when the user provides feedback on the relevance of the given document (Arafat, 2008)."
    },
    {
      "heading": "Quantum Phenomena",
      "text": "In this section we survey some of the more controversial quantum mechanical concepts which induce confusion within the quantum-inspired IR approaches. We take a closer look at the IR-theoretic analogue(s) of the notions of randomness and incompleteness, incompatibility, statistical mixture and superposition, non-orthogonality, and quantum interference. We end this section by representing some issues with the use of quantum logic for IR."
    },
    {
      "heading": "Randomness and Incompleteness",
      "text": "In this section we compare the notion of classical and quantum randomness, and highlight few questions regarding the application of quantum viewpoint of information processing in IR. The intention of authors here is neither to define any quantitative measure of randomness, nor to defend the usefulness of randomness as a resource in IRfoot_1 . Classically the randomness (unpredictability) of the measurement outcome is viewed as observer's ignorance about some pre-determined properties, i.e. it reflects the incomplete knowledge of the observer about the system. This knowledge can be improved or even completed via further measurements and the acquisition of more information. In the quantum case, the outcome of a specific quantum measurement is unpredictable, however this unpredictability may or may-not be considered to reflect a lack of knowledge about some hidden variables according to one's interpretational leanings. Within the framework of pure quantum theory we can say only that given a pure quantum state, predictability cannot be improved. But of course the predictability is only perfect for a small set of the possible measurements, for most of them the outcomes are probabilistic. And attempts to further refine that information -as can be done classically -run into the problem of incompatibility. There is some maximum amount of information that we can have about a quantum system, but this does not give us the complete information that would be necessary to predict the outcome of any measurement: maximum information about a quantum system as represented by a pure quantum state vector is not necessarily complete information (Caves et al., 2002;Caves & Fuchs, 1996;Spekkens, 2007). To understand the nature of unpredictability in IR, we are required to answer the following question: Is a user's searching for information as intrinsically unpredictable as that encountered in QM or is IR randomness simply related to the classical concept of incomplete knowledge? In other words, whether we have a more concrete analogy between IR and an incomplete knowledge classical system as opposed to a quantum system. The answer will depend in some circumstances on whether there is a natural notion of incompatible measurements in IR (see next section). If the answer is positive, then IR notion of randomness is a sensible analogous notion to quantum randomness. Otherwise, we are associating an inherent randomness to a system, only because the system is complex and we do not have complete knowledge about it. 3In QIIR the probabilities of quantum theory are generically carried over to relate in some manner to 'document rankings' -to the likelihood of user satisfaction with a documentfoot_3 . This inferential uncertainty is basically uncertainty about a user's preferences, goals and judgements. In fact, several studies showed that users' relevance criteria fluctuate depending on their interests, intentions and goals (Law, Klobučar, & Pipan, 2006). This implies that each time a user judges whether a document is relevant to a given query, he or she may provide a different judgement depending on the relevance criteria at the time. Does it follow that the user's behaviour is completely unpredictable and we cannot know the user at all? As the users of an IR system are diverse in goals, intentions, and many other factors, one research question to investigate here is to what extent we can acquire the maximal information about user(s) of an IR system, of course considering the variety of information retrieval tasks. In this sense we are treating the users as a system -there is a sample space of all possible users. If a (classical or quantum) state is meant to capture our uncertainty about the outcomes of future experiments then from this perspective one can consider associating states to users and not to queries (or documents)."
    },
    {
      "heading": "Incompatibility",
      "text": "The notion of incompatible measurement refers to observables which are not simultaneously measurable, measuring one of them causes a random disturbance in the other -so different outcomes will be obtained depending on which is measured first. Quantum incompatibility is manifested mathematically by the non-commutativity of the observables, which means the order of successive measurements affects the outcome of the measurements. Before referring to possible benefits of using incompatibility in IR, it should be noticed that the notion of incompatibility does not exclusively belong to quantum theory. An example of a classical system with incompatible variables is already addressed in Kirkpatrick (2003), and example of classical non-commutativity of measurements can be found in the Toy Theory of Robert W. Spekkens (2007) and classical Liouville mechanics with an epistemic restriction (Bartlett et al., 2011). If the state (i.e. inferential object) refers to a document and a query to measurement, an intuitive use of incompatibility in IR is where a document passes through a sequence of queries in which reversing the order does not lead to the same results. A supporting evidence for the existence of such queries refers to a study (Busemeyer, Pothos, Franco, & Trueblood, 2011) in which a story (i.e. a document) is represented to a user and then successive queries are answered by the user about the likelihood of certain statements about the story. The order of these questions has been shown to be significant. An example suggested in van Rijsbergen (2004) refers to treating the relation between aboutness and relevance of a query as incompatibility between observables. It has been argued that incompatibility between predicates happens because of interaction, e.g. if one asks an observer questions regarding aboutness and sequentially a question about its relevance, by repeating the first question one might get a different answer than when it was originally asked. If the state refers to a query and a document to measurement, one suggestion for using incompatibility in IR is where a user is provided with two different documents, d 1 and d 2 . The user may first study d 1 and then d 2 and if we again ask user's opinion about d 1 , the opinion may have been changed. This implies that the order of documents matters and the 'observables' correspond to reading each of these documents do not always commute, e.g. (Piwowarski & Lalmas, 2009). A supportive evidence for the influence of presentation order on user judgments can be found in Eisenberg & Barry (1988). One fundamental question to investigate would be whether we have enough examples of incompatibility in IR and if we can provide a strong case to justify this analogy. As classical logic is all about compatible observables, finding appropriate answer to the above research question will have a great impact on another question which will come up about incompatible observables and that is to what extent we need to use quantum logic for IR."
    },
    {
      "heading": "Statistical Mixture and Superposition",
      "text": "Mixed and superposed quantum states are two of the other notions from quantum theory that are suggested to have IR analogous notions. First let recall what is a mixed state in Quantum Mechanics."
    },
    {
      "heading": "Mixed states",
      "text": "Assume that the only information an observer knows about a given system is that the system is in state A with probability P A and in state B with probability P B . This uncertain information about the state of the system can be represented by a mixed state. A mixed state is represented by a density matrix which is a mathematical object that allows to represent experimental scenarios involving a randomization in choice of measurement, preparation of states, etc. A mixed state corresponds to a classical probability distribution over a set of pure quantum states in which a pure states refer to a state that can not be represented as a mixture of other quantum states. Until one is clear about the role of pure states within QIIR it is somewhat difficult to be sure about the role of mixed states. An intuitive suggestion to use the concept of mixed states in IR is to represent an inferential object with some inherent uncertainty. One scenario would be the representation of a single-term query that involve a randomization in choice of query terms. This scenario refers to the case where the user's query is a single-term query but the inferrer is not aware of the exact query term that the user is asking. As an example consider a user who randomly chooses query term t 1 with probability p 1 , query term t 2 with probability t 2 , and t 3 with probability p 3 as his/her information need. In this scenario the inferrer who is not aware of the exact query term that the user is asking, uses a mixed state to represent the user's query. As a result of this representation, the probability that the inferrer will measure for each document would be the convex combination of the three cases. This scenario is close to what mixed states are used for in QM and can be extended to mixtures of superposed quantum states as addressed in Piwowarski et al. (2010). Another suggestion in IR is to use the concept of mixed states to represent a set of infer-ential objects, each with its own importance degree (van Rijsbergen, 2004). One such scenario would be the representation of multi-term queries, i.e. combinations of query terms with weight coefficients. An example is where the user's query contains three query terms \"t 1 t 2 t 3 \", associated with importance degree of p 1 , p 2 , p 3 , respectively. According to the suggested approach, the inferrer assigns a mixture representation to this query. However, any attempt to interpret this representation under the light of the mixed state used in QM would mean that the system (i.e. query) is just in state t 1 with probability p 1 , in state t 2 with probability p 2 and in state t 3 with probability p 3 . This interpretation differs from the expectation in IR that the user's query is meant to address all three query terms at once. Accordingly this suggestion reflects a fundamental difference with the concept of mixed states in QM. Other examples of exploiting this scenario in IR include representing documents in a cluster (van Rijsbergen, 2004) and representing the set of documents that user judges as relevant (van Rijsbergen, 2004). The message to be noticed here is that mixed states are merely a classical distributions over a set of quantum states, and if the goal is to adopt the quantum viewpoint of information processing, a concrete analogy with the concept of mixed states in QM is expected. One question to investigate here is to what extent the uncertainty inherent in density operators matches with the type of mixture we need in IR."
    },
    {
      "heading": "Superposition",
      "text": "In quantum theory one can create superposition states of a single quantum system. For example a given system can be in a superposed state |φ = α|A + β|B , where |. denotes a state vector in the Hilbert space and refers to the Dirac notation used in QM, α * α + β * β = 1, and * denotes complex conjugate. It is crucial to note that the system in a superposed state is in a genuinely new state. It is fundamentally different from a system that is in state |A or one in state |B . But it is also fundamentally different from a system that is just 'in state |A with probability p and in state |B with probability 1p'. That situation is the case of a mixed state, referred to above. Superposition is an operation that takes in two (or more) states and combines them into a completely different state within the Hilbert space. Inferences from this new state differ from those we make from |A and |B . A superposition of two (or more) possibilities is not the conjunction (and) of those possibilities nor the disjunction (or) of those possibilities. It should also be pointed out that the same state can be written as a coherent superposition of many different pairs of states. In IR, there are two different viewpoints towards the significance of the concept of superposition. In a first view, van Rijsbergen mentioned that \"it is not clear whether the difference between a superposition and a mixture of states plays a significant role in IR\" (van Rijsbergen, 2004, p.95). Given that van Rijsbergen also mentioned (van Rijsbergen, 2004, preface) that the important quantum phenomena including superposition readily translates into analogous notions in IR, this viewpoint is a somehow contradictory view since it is the difference between superposition and mixture that differentiates classical from quantum physics. Several other IR researchers do, however, consider the concept of superposition a significant concept for IR. There are several attempts to provide analogous notions to superposition, but these approaches generally address a concept which is very different than quantum superposition. One such attempt is to use the notion of superposition in query representation (Piwowarski et al., 2010). An example of this attempt is when the query \"Pizza delivered in Cambridge (UK)\" would be represented by a (normalised) linear combination (or, as it was claimed, 'superposition') of the state vectors associated with \"I want a pizza\", and the one associated to \"I want it to be delivered in Cambridge (UK)\". As we addressed before, a weighted coherent superposition of two possibilities is not the and of those possibilities nor the or of those possibilities. Accordingly in this example, the advantage of calling this combination as 'superposition' is not clear. Other suggested analogue(s) of the notion of superposition can be found in Melucci & van Rijsbergen (2011). A final point to note about superpositions is the following. If quantum states |A and |B are orthogonal, the state α|A + β|B is not orthogonal to either. Is there a QIIR analogue of non-orthgonality to help us identify a QIIR analogue of superposition? If we are associating states to documents then two such states would be orthogonal if there is a query that yields a relevance of 1 on the one document and 0 on the other. Conversely, if we are associating states to queries then orthogonal queries are ones for which there is some document that is completely relevant for one and irrelevant for the other. The non-orthogonal combination of the documents or queries should be something that yields some relevance in-between 0 and 1 for such cases. It seems plausible that QIIR examples of such phenomena could be found. There is a catch however. Non-orthonality arises even in classical probability theory. It arises for overlapping distributions. That is, there are points in the sample space which can be associated with more than one probability distribution. Overlapping probability distributions share many features of quantum non-orthogonality. They cannot be distinguished perfectly, they cannot be cloned (identically copied) and so on. The toy theories mentioned above (Spekkens, 2007;Bartlett et al., 2011) all make extensive use of this feature. Determining what is genuinely quantum about non-orthogonality is subtle -if one claims that there would be some quantitative benefits for using quantum states in IR, first should show that the same outcomes can not be achieved using classical non-orthogonality. To conclude, in order to investigate whether the difference between a superposition and a mixture of states plays a significant role in IR we suggest that there should be a clear concept of interference -the fundamental phenomenon that is a consequence of this difference."
    },
    {
      "heading": "Quantum Interference",
      "text": "Quantum interference is a phenomenon in which the probability of two mutually exclusive events A and B, is not P A + P B (the sum of their individual probabilities) but is rather P A + P B + f (P A , P B , θ) where f is some function of P A , P B , and some set of other parameters (denoted θ) that are either part of the quantum state or are part of the measurement. A simple interference commonly encountered has f To what does quantum interference correspond in IR? Let us focus on the case where we are assigning states to documents for concreteness. In some sense it should be a process of document merging which says something like: Combining two possible inferential objects associated with a document yields an inferential object such that new queries have outcomes that are not formed by probabilistic mixture of the likelihoods for the previous inferential objects. That is, sometimes the best new inferential object lies in-between the original two in a non-classical manner. Here is an example of our own devising. Consider some ancient manuscript, such as the Bible, for which the oldest known pieces are fragmentary. D1 could be one such piece, and D2 another. The 'real' document -the system -is the original Bible, based on D1 and D2 we might assign different indexes and inferential objects -'states' -according to which we answer questions about whether the bible will satisfy some need of the user. Typically we find that D1 and D2 agree on the text in many places, however both have text which is not contained in the other. Moreover, in places where they disagree, scholarly input is required to analyse the context, to look for possible scribal errors and so on. Therefore the final reconstructed document D3 is close to D1 and D2, but it is not a simple merging of them. Consider now someone making a series of queries on the documents. It is perfectly possible that the likelihood they assign to D3 satisfying the users information need is not simply a simple probabilistic mixture of the likelihood for D1 and D2 individually -it is not as if the scholar who produced D3 did so by, wherever there was discrepancy, choosing D1 with probability 2/3 and D2 with probability 1/3 say. Therefore we have a concrete situation where the inferential object we would associate with D3 may well be \"non-orthogonal\" (in the operational quantum sense) to that associated with D1 and D2. Of course the functional form of the interference is unlikely to follow that of QM!. Other proposed analogous notions to interference could be along the lines that the information in two documents conflicts (or corroborates), so returning both of them might result in lower (or higher) user satisfaction than returning each of them individually (Zuccon & Azzopardi, 2010). Similarly, the information in two topics, in a long document or document containing multiple topics or subtopics, may conflict (Wang, Song, Zhang, Hou, & Bruza, 2010). Similar analogies can be formed on the query side as well, e.g. merging two query terms together (Piwowarski & Lalmas, 2009). In quantum mechanics there is a specific functional form that interference takes, due to the geometry of Hilbert space. If we wish to push for a specific type of interference such as those above then the next step is to justify its specific mathematical structure. There are many general probabilistic theories manifesting interference phenomena in different formseven within physics it is hard to justify why nature took the specific functional form it did. It therefore seems extremely unlikely that interference in QIIR can easily justify it; if it did we would surely gain new knowledge about quantum physics! The discussion section details about using alternative theories to model interference and other quantum effects. 5.5 A framework to combine Probability, Logic and Vector Spaces? One of the main motivations for suggesting to use quantum theory in IR was using its underlying mathematical language as a framework to combine probability, logic and vector spaces in one formalism (van Rijsbergen, 2004). The suggestion refers to the fact that Quantum Theory provides this framework via its standard version of quantum logic and via Gleason's theorem. The standard version of quantum logic refers to the set of all closed subspaces of a Hilbert space or the set of all orthogonal projection operators (the 2-valued observables) which constitute an orthomodular lattice which is not distributive. This orthomodular lattice determines a sort of logic and a probability measure can be specified on this lattice of subspaces using the Gleason's theorem. Many researchers refer to this version as a failed program of research. It is certainly no longer heavily pursued in physics. For a list of some of these reasons see Coecke (2008). One particularly relevant issue, addressed first by Foulis and Randall (1979), relates to describing a composite system via a tensor product. A composite quantum system involves more than one subsystem, wherein the Hilbert space for this system is represented as the tensor product of the Hilbert spaces for each subsystem. Foulis and Randall showed that it is not possible to formulate a tensor product for orthomodular lattices. This means that the tensor product of orthomodular lattices is not necessarily an orthomodular lattice. It would seem inevitable that for something to be useful as an axiomatic foundation for IR that it be able to deal with the case of multiple systems (regardless of whether 'the system' refers to documents, queries or something else). As a natural consequence of the failure of standard quantum logic for composite systems, some of the suggestions for using tensor products in IR, e.g. combining different representations of a given document by means of tensor products and using the notion of non-separable states to formalise the complex interdependent relationships among the different representations (Frommholz et al., 2010) are not necessarily compatible with some of the underlying motivations for the program. More general mathematical structures developed later in the area of quantum logic in search for a genuine version of quantum logic for quantum theory, including orthoalgebras (a generalization of orthomodular lattices), effect algebras (a generalization of orthoalgebra) and category theoretic structures (Coecke, 2009;Abramsky & Coecke, 2004) foot_4 . For a review and a list of references showing the development of quantum logic, including orthoalgebras and effect algebras consult Coecke, Moore, & Wilce (2000). The potential benefits of these alternative logics for IR remain to be seen. 6 Discussion and suggestions for future research In this paper we surveyed some of the elements of QM and various proposed IR equivalences. The main weakness of such proposals as discussed in Sections 4 and 5 is that they do not have a convincingly concrete analogy with elements of QM. This implies a challenge for this program of research to identify what are the requirements for IR to have a concrete analogy with QM, and to investigate whether assuming those requirements for IR problems are reasonable. Even if we come up with a concrete analogy between IR and quantum phenomena, e.g. strong cases for the existence of incompatibility in measurement, sufficiently similar types of randomness, etc, and we are looking for a theory to reproduce those phenomena, then it should be noted that the mathematics of Hilbert space and its induced logic is merely a tool to perform further foundational research in IR, and one may always expect that a more appropriate tool could arise. Van Rijsbergen in a keynote talk at SIGIR 2006(van Rijsbergen, 2006) addressed that the elements of logic in this tool can be challenged. He mentioned that \"The assumption that closed linear subspaces will be the elements of our logic can be challenged, as perhaps a construction with different elements is possible\". One can consult Section 5.5 for examples of some of these alternative tools, wherein we referred to some of the existing replacements for the standard quantum logic. We would like to point out that the probabilistic framework in this tool can also be challenged. There are many general probabilistic theories manifesting features very similar to quantum phenomena that can possibly also be used to help formalise the foundations of IR. We now briefly introduce some of the possible alternatives for the probabilistic framework. As finding the simplest theory for IR uses would be desirable, being aware of such theories is useful. Although in physics none of these theories have been explored as rigorously as QM, nothing stops IR researchers from exploring the options to find the most appropriate solution for IR. The first category of theories refers to In-Between Theories which are theories that are closer to classical theory as opposed to quantum theory, and have no connections with physics but reproduce a great number of quantum phenomena"
    }
  ]
}