{
  "paperid": "1903.10209v4",
  "title": "Capacity of Quantum Private Information Retrieval with Multiple Servers",
  "authors": [
    "Song",
    "Hayashi",
    "Chor",
    "Goldreich",
    "Kushilevitz",
    "Sudan",
    "Cachin",
    "Micali",
    "Stadler",
    "Lipmaa",
    "Beimel",
    "Stahl",
    "Devet",
    "Goldberg",
    "Heninger",
    "Kerenidis",
    "Wolf",
    "Kerenidis",
    "Wolf",
    "Olejnik",
    "Gall",
    "Kerenidis",
    "Laurière",
    "Gall",
    "Rennela",
    "Baumeler",
    "Broadbent",
    "Aharonov",
    "Brakerski",
    "Chung",
    "Green",
    "Lai",
    "Sattath",
    "Sun",
    "Jafar",
    "Tian",
    "Sun",
    "Chen",
    "Sun",
    "Jafar",
    "Chan",
    "Ho",
    "Yamamoto",
    "Freij-Hollanti",
    "Gnilke",
    "Hollanti",
    "Karpuk",
    "Banawan",
    "Ulukus",
    "Kumar",
    "Lin",
    "Rosnes",
    "Graell I Amat",
    "Lin",
    "Kumar",
    "Rosnes",
    "Graell I Amat",
    "Holzbaur",
    "Freij-Hollanti",
    "Hollanti",
    "Sun",
    "Jafar",
    "Rabin",
    "Even",
    "Goldreich",
    "Lempel",
    "Kilian",
    "Ishai",
    "Prabhakaran",
    "Sahai",
    "Gertner",
    "Ishai",
    "Kushilevitz",
    "Malkin",
    "Kobayashi",
    "Matsumoto",
    "Cleve",
    "Hoyer",
    "Toner",
    "Watrous",
    "Reichardt",
    "Unger",
    "Vazirani",
    "Hayashi",
    "Ding",
    "Quek",
    "Shor",
    "Wilde",
    "Wilde",
    "Tomamichel",
    "Bennett",
    "Shor",
    "Smolin",
    "Wang",
    "Hayashi",
    "Song",
    "Hayashi"
  ],
  "year": 2021,
  "abstract": "We study the capacity of quantum private information retrieval (QPIR) with multiple servers. In the QPIR problem with multiple servers, a user retrieves a classical file by downloading quantum systems from multiple servers each of which contains the copy of a classical file set while the identity of the downloaded file is not leaked to each server. The QPIR capacity is defined as the maximum rate of the file size over the whole dimension of the downloaded quantum systems. When the servers are assumed to share prior entanglement, we prove that the QPIR capacity with multiple servers is 1 regardless of the number of servers and files. We construct a rate-one protocol only with two servers. This capacity-achieving protocol outperforms its classical counterpart in the sense of the capacity, server secrecy, and upload cost. The strong converse bound is derived concisely without using any secrecy condition. We also prove that the capacity of multi-round QPIR is 1.",
  "sections": [
    {
      "heading": "I. INTRODUCTION",
      "text": "Introduced by the seminal paper [1], Private Information Retrieval (PIR) finds efficient methods to download a file from non-communicating servers each of which contains the copy of a classical file set while the identity of the downloaded file is not leaked to each server. This problem is trivially solved by requesting all files to one of the servers, but this method is inefficient. Finding an efficient method is the goal of this problem and it has been extensively studied in many papers [2]- [5]. Moreover, the papers [6]- [12] have studied the Quantum PIR (QPIR) problem where the user downloads quantum systems instead of classical bits to retrieve a classical file from the servers. In classical PIR studies, the paper [13] started the discussion of the PIR capacity. The PIR capacity is defined by the maximum rate of the file size over the download size when the numbers of the servers and the files are fixed. In the definition of the PIR capacity, the upload cost, i.e., the total size of the queries, is neglected since it does not scale with the file size which is allowed to go infinity. When each of the n servers contains a copy of the f files, the paper [13] showed that the PIR capacity is (1 -1/n)/(1 -(1/n) f ). Moreover, the paper [14] proposed a capacity-achieving protocol with the minimum upload cost and minimum file size in a class of PIR protocols. Furthermore, after [13], several PIR capacities have been studied under different problem settings. Symmetric PIR is the PIR with server secrecy that the user obtains no more information than the target file, and the capacity of the symmetric PIR is 1n -1 [15]. Another extension is the PIR with coded databases [16]- [21], where the files are coded and distributed to the servers. When the files are coded by an (n, k) Maximum Distance Separable (MDS) code, the PIR capacity is (1 [18]. Multi-round PIR has also been studied in [22] and the capacity was proved to be the same as the PIR capacity derived in [13]. On the other hand, the QPIR problem is rarely treated with multiple servers and there is no study on the capacity of the QPIR problem. Though the papers [6], [7] treated the QPIR problem with multiple servers, they evaluated the communication complexity which is the sum of upload and download costs required to retrieve a one-bit file instead of the capacity. In this paper, as quantum extensions of the classical PIR capacities [13], [15], [22], we show that the capacities of QPIR, symmetric QPIR, and multi-round QPIR are 1. We derive the QPIR capacity when a user retrieves a file secretly from non-communicating n servers each of which contains the whole set of f files by downloading quantum states under the assumption that an entangled state is shared previously among all servers. We evaluate the security of a QPIR protocol with three parameters: the retrieval error probability, the user secrecy that the identity of the queried file is unknown to any individual server, and the server secrecy that the user obtains no more information than the target file. As a main result, we show that the QPIR capacity is 1 regardless of whether it is of exact/asymptotic security and with/without the restriction that the upload cost is negligible to the download cost. We propose a rate-one QPIR protocol with perfect security and finite upload cost. We prove the converse bound that the rate of any QPIR protocol is less than 1 even with no secrecy, no upload constraint, and any error probability. Moreover, we show that the capacity of multi-round QPIR is 1. We prove the weak converse bound of the multi-round QPIR capacity, i.e., the upper bound when the error probability is asymptotically zero. Our capacity-achieving protocol has several remarkable advantages compared to the protocol [14] with the minimum upload cost and the minimum file size (see Table I). First, our protocol is a symmetric QPIR protocol which guarantees the server secrecy, i.e., the user obtains no information of files other than the retrieved one. This contrasts with the protocol in [14] that retrieves some information of the other files. Secondly, our protocol keeps the secrecy against the malicious user and servers. That is, the user cannot obtain more information than the target file even if the user sends malicious queries to the servers, and the servers cannot obtain the identity of the user's target file even if the servers answer malicious file information. Thirdly, the rate 1 of our protocol is greater than the rate (1n -1 )/(1n -f ) of the protocol in [14]. Fourthly, our protocol achieves the capacity 1 only with two servers. That is, in the sense of the QPIR capacity, there is no benefit to using more than two servers. On the other hand, in the protocol in [14], the capacity is strictly increasing in the number of servers and strictly decreasing in the number of files, and an infinite number of servers are needed to achieve the capacity 1. Fifthly, our protocol needs the upload of 2f bits whereas the protocol in [14] needs (n(f -1) log n)-bit upload. Lastly, our protocol is defined when the file size m is the square of any integer, but the protocol in [14] requires the file size m to be the (n -1)-th power of any integer. The converse proofs of the QPIR capacities are much simpler than those of the PIR capacities [13], [15], [22]. Whereas the papers [13], [15], [22] used several entropic inequalities based on the assumptions on the PIR problem, our converse bounds are concisely derived without using any secrecy conditions but only by focusing on the download step of QPIR protocol. It should be noted that our QPIR protocol can be considered as a distributed version of Oblivious Transfer (OT) [23], [24]. OT is equivalent to the symmetric PIR with one server and therefore, the symmetric PIR with multiple servers can be considered as a distributed version of OT. OT is an important cryptographic protocol because the free uses of an OT protocol construct an arbitrary secure multiparty computation [25], [26]. Unfortunately, the symmetric classical PIR cannot be constructed without shared randomness among servers [27]. On the other hand, the paper [7] showed that the two-way quantum communication between the user and the servers enables the symmetric PIR without shared randomness. Our result extends the result [7] so that the symmetric PIR can also be constructed without shared randomness even for the case of classical upload, quantum download, and prior entanglement among the servers. Note that if the quantum upload is allowed to our model, we do not need the assumption of the prior entanglement because the user can upload an entangled state to all servers. We assume that the servers share an entangled state before the protocol starts, but do not communicate. Similarly, the prior entanglement by non-communicating multiple parties has been assumed in another quantum protocol, called Multiprover Quantum Interactive Proof (MQIP) [28]- [30]. In MQIP, to solve a computational problem, a computationally-limited verifier sends queries to multiple provers who do not communicate with each other and have quantum computers, receives answers from them, and then verifies whether the answers from the provers give a correct solution of the problem. Similarly to our assumption, the MQIP studies [28]- [30] assumed that the provers share an entangled state before the protocol starts, but do not communicate with each other. However, even if the assumption of shared entanglement is similar, our communication model is different from those in [28]- [30]: the papers [28], [30] treated the quantum queries and quantum answers, and the paper [29] treated the classical queries and classical answers, but our paper treats classical queries and quantum answers. The remaining of this paper is organized as follows. Section II presents the formal definition of the QPIR protocol and the QPIR capacity and proposes the QPIR capacity theorem. Section III constructs the rate-one QPIR protocol and analyzes the security of our protocol against the malicious user and servers. Section IV proves the converse bound. Section V extends the result to the capacity of multi-round QPIR. Section VI is the conclusion of this paper. Notations: For any set T , we denote by |T | the cardinality of the set T and by I T (or I) the identity operator on T . For any matrix B, we denote by B the complex conjugate of B and B † := B⊤ . The set of integers is denoted by Z, and User Target Index: K ∈ {1, . . . , f} Fig. 1. Quantum private information retrieval protocol with multiple servers. The composite system of the servers is initialized to an entangled state ρperv. Z d := Z/dZ for any integer d. Pr X [A] denotes the probability that the variable X satisfies the condition A. For any quantum system A, we denote the set of all quantum states on A by S(A)."
    },
    {
      "heading": "II. QPIR PROTOCOL AND MAIN THEOREM",
      "text": "In this section, we formally define the QPIR protocol and its capacity and presents the main theorem of the paper. For preliminaries on quantum information theory, see Appendix A."
    },
    {
      "heading": "A. Formal definition of QPIR protocol",
      "text": "In this paper, we consider the QPIR with multiple servers described as follows. Let n, f, m be integers greater than 1. The participants of the protocol are one user and n servers. The servers do not communicate with each other and each server contains the whole set of uniformly and independently distributed f files W 1 , . . . , W f ∈ {0, . . . , m -1}. Each server serv t possesses a quantum system Ãt and the n servers share an entangled state ρ prev ∈ S( n t=1 Ãt ). The user chooses the target file index K to retrieve the K-th file W K , where the distribution of K is uniform and independent of the files W 1 , . . . , W f . To retrieve the W K , the user chooses a random variable R user in a set R user and encodes the queries by user encoder Enc user : where Q t is the set of query symbols to the t-th server for any t ∈ {1, . . . , n}. The n queries Q 1 , . . . , Q n are sent to the servers serv 1 , . . . , serv n , respectively. After receiving the tth query Q t , each server serv t applies a Completely Positive Trace-Preserving (CPTP) map Λ t from Ãt to A t depending on Q t , W 1 , . . . , W f and sends the quantum system A t to the user. With the server encoder Enc serv t , the map Λ t is written as and the received state of the user is written as where W := (W 1 , . . . , W f ) and Q := (Q 1 , . . . , Q n ). Next, the user retrieves the file W K by a decoder which is defined depending on K, Q as a Positive Operator-Valued Measure (POVM) Dec(K, Q) := {Y M } m M=0 . The protocol outputs the measurement outcome M ∈ {0, . . . , m} and if M = m, it is considered as the retrieval failure. 1) Protocol: When the numbers n and f of servers and files are fixed, a QPIR protocol of file size m is formulated by the 4-tuple Ψ (m) QPIR := (ρ prev , Enc user , Enc serv , Dec) of the shared entangled state ρ prev in the servers, the user encoder Enc user , the collection of the server encoders Enc serv := (Enc serv1 , . . . , Enc servn ), and the decoder Dec. 2) Security: For any t ∈ {1, . . . , n}, let user(Ψ (m) QPIR ) and serv t (Ψ (m) QPIR ) be the information of the user and the server serv t at the end of the protocol Ψ (m) QPIR , respectively. The security of a QPIR protocol Ψ (m) QPIR is evaluated by the error probability, the server secrecy, and the user secrecy defined as where I(•; •|•) denotes the conditional mutual information and QPIR ) = 0, the non-targeted files W K c are independent of the user information. Similarly, if S user (Ψ (m) QPIR ) = 0, the target file index K is independent of any individual server information. 3) Costs, rate, and capacity: Given a QPIR protocol Ψ (m) QPIR , we define the upload cost, the download cost, and the QPIR rate by The upload cost, the download cost, and the QPIR rate evaluate respectively the size of the whole query set , and the efficnecy of the protocol. When the base of the logarithm is two, the QPIR rate means the number of retrieved bits per one qubit download. The QPIR capacity is the optimal QPIR rate when the numbers of servers and files are fixed, and we define it with constraints on the security parameters and upload cost. The asymptotic security-constrained capacity and the exact security-constrained capacity are defined with α ∈ [0, 1) and where the supremum is taken for sequences {m ℓ } ∞ ℓ=1 such that lim ℓ→∞ m ℓ = ∞ and for sequences {Ψ ℓ=1 of QPIR protocols to satisfy either (8) or (9) given by lim sup and It is trivial from the definition that for any α ∈ [0, 1) and"
    },
    {
      "heading": "B. Main Result",
      "text": "The main theorem of this paper is given as follows. Theorem II.1. When servers can share prior entanglement, the capacity of the quantum private information retrieval for f ≥ 2 files and n ≥ 2 servers is Proof. In Sections III and IV, we will prove C 0,0,0,0 exact ≥ 1 and C α,∞,∞,∞ asymp ≤ 1 for any α ∈ [0, 1), respectively. Then, the inequality (10) implies the theorem. Note that the capacity does not depend on the number of files f and the number of servers n. This contrasts with the classical PIR capacity [13], which is strictly decreasing for f and strictly increasing for n. Moreover, the capacity does not depend on the security constraints, i.e., there is no trade-off between the capacity and the constraints α, β, γ, θ. Furthermore, the theorem implies that the symmetric QPIR capacity is 1. Remark II.1. In our QPIR model, we assumed that the files W 1 , . . . , W n are uniformly random and mutually independent. However, the assumption is necessary only for proving the converse bounds. Without the assumption, our QPIR protocol has no error and achieves the perfect server and user secrecies."
    },
    {
      "heading": "III. CONSTRUCTION OF PROTOCOL",
      "text": "In this section, we construct a rate-one two-server QPIR protocol with the perfect security and negligible upload cost. Our protocol is constructed if the file size m is the square of an arbitrary integer ℓ. Then, by taking m ℓ = ℓ 2 , the sequence {Ψ ℓ=1 of our protocols achieves the rate 1 with the perfect security and negligible upload cost, which implies In the following, we give preliminaries on quantum operations and states in Section III-A and construct the QPIR protocol in Section III-B."
    },
    {
      "heading": "A. Preliminaries",
      "text": "For an arbitrary integer ℓ ≥ 2, let A be an ℓ-dimensional Hilbert space spanned by an orthonormal basis {|0 , . . . , |ℓ -1 }. Define a maximally entangled state |Φ on A ⊗ A by For a, b ∈ Z ℓ , the generalized Pauli operators on A are defined as where ω = exp(2π √ -1/ℓ), and the discrete Weyl operators are defined as These operators satisfy the relations For any matrix T := ℓ-1 i,j=0 t ij |i j| on A, we define the state |T in A ⊗ A by With this notation, the maximally entangled state is written as With the basis given in the following proposition, we construct the measurement in our QPIR protocol. Proposition III.1. The set Proof. Since W(a, b) ⊗ I is a unitary matrix for any a, b ∈ Z ℓ , all elements in B are unit vectors. Then, it is sufficient to show that every different two vectors in B are mutually orthogonal: ), the left-hand side of ( 13) is written as Moreover, for any x, z ∈ Z ℓ , we have Thus, Eq. ( 13) holds for any (a, b) = (c, d), which implies the desired statement."
    },
    {
      "heading": "B. Rate-one QPIR protocol",
      "text": "In this section, we propose a rate-one two-server QPIR protocol with the perfect security and negligible upload cost. This protocol is constructed from the idea of the classical twoserver PIR protocol in [1,Section 3.1]. In this protocol, a user retrieves a file W K from two servers serv 1 and serv 2 . Each server contains a copy of the files W 1 , . . . , W f ∈ {0, . . . , ℓ 2 -1 =: m ℓ -1} for an arbitrary integer ℓ. By identifying the set {0, . . . , ℓ 2 -1} with Z 2 ℓ , the files W 1 , . . . , W f are considered to be elements of Z 2 ℓ . We assume that serv 1 and serv 2 possess the ℓ-dimensional quantum systems A 1 and A 2 , respectively, and the maximally entangled state |Φ in A 1 ⊗ A 2 is shared at the beginning of the protocol. 1) Protocol: The QPIR protocol for retrieving W K is described as follows. Step 1. Depending on the target file index K, the user chooses a subset R user of {1, . . . , f} uniformly. Let Q 1 := R user and Step 2. The user sends the queries Q 1 and Q 2 to serv 1 and serv 2 , respectively. Step 3. ℓ and applies W(H 1 ) on the quantum system A 1 . Similarly, serv 2 calculates H 2 := i∈Q2 W i and applies W(H 2 ) to the quantum system A 2 . The state on Step 4. serv 1 and serv 2 send the quantum systems A 1 and A 2 to the user, respectively. Step 5. The user performs a POVM otherwise. The user obtains the measurement outcome (a, b) as the retrieval result. 2) Security: We analyze the security of the protocol, i.e., the error probability, the server secrecy, and the user secrecy. The protocol has no error as follows. Note that = where and the equality ( 18) is from (12). Therefore, in Step 5, the measurement outcome is ℓ with probability 1. The perfect server secrecy is obtained because the received state (W(±W K ) ⊗ I)|Φ of the user is independent of the files W 1 , . . . , W K-1 , W K+1 , . . . , W f . The perfect user secrecy follows from that of the protocol [1, Section 3.1]. Note that even if the collection of Q 1 and Q 2 depends on K, each of Q 1 and Q 2 is individually independent of the index K. Thus, the perfect user secrecy is obtained. 3) Upload cost, download cost, and rate: The upload cost is U (Ψ (m ℓ ) QPIR ) = 2f log 2 since two subsets Q 1 and Q 2 of {1, . . . , f} are uploaded and each subset of {1, . . . , f} is expressed by f bits. The download cost is D(Ψ and U (Ψ"
    },
    {
      "heading": "C. Security against malicious operations",
      "text": "In the previous subsection, we showed that the protocol in Section III-B has the perfect security when the user and the servers follow the protocol. In this subsection, we prove that the protocol in Section III-B also guarantees the server and user secrecies even if the servers or the user apply malicious operations. Namely, we consider two malicious models: the malicious server model and the malicious user model. The malicious server model considers the case that the servers apply malicious operations to obtain the target file index K but the user follows the protocol, i.e., the query generation and the recovery by the user are the same as the protocol in Section III-B. Our protocol is secure against this model since each of Q 1 and Q 2 is individually independent of the index K and the servers obtain no more information from the user except for Q 1 and Q 2 . Therefore the servers cannot obtain any information of K by malicious operations. The second security model is the malicious user model, where the user sends malicious queries to the servers to obtain the non-targeted file information in addition to the target file W K . That is, the user sends malicious queries Q = (Q 1 , Q 2 ) to retrieve both of the file W K and some information of Similarly to the malicious server model, we assume that the servers do not deviate from the protocol. Our protocol is also secure against this model since the user downloads the m ℓdimensional quantum system and the user is assumed to obtain W K ∈ {0, . . . , m ℓ -1}. That is, the user cannot obtain more information than W K . This security is precisely proved by the following relation: where Proof of Eq. (19). Since the user obtains the file W K , we have where H(•|•) ρ is the quantum conditional entropy defined in Appendix B. Eq. ( 20) is equivalent to The relation (21) implies the following relations: The equality in (24) follows from the condition (21), the independence between W K and (K, Q), and the uniform distribution of W K . The last inequality in (24) follows from dim A = log m ℓ . Therefore, we have which implies (19)."
    },
    {
      "heading": "IV. CONVERSE",
      "text": "In this section, we prove the converse bound for any α ∈ [0, 1). By replacing the notation of ρ W,Q defined in (1), let ρ w,z be the quantum state on the composite system n t=1 A t , where w is the file to be retrieved and z := (w c , q) for the collection w c of other m -1 files and the collection q of queries. Applying [31, (4.66)] to the choice σ z = (1/m) m-1 w=0 ρ w,z , for any s ∈ (0, 1), we have where P err,z (Ψ (m) QPIR ) is the error probability when z is fixed. For the completeness of the proof, we give the derivation of (27) in Appendix C. Furthermore, we can bound the RHS of ( 27) as for d = n t=1 dim A t . Here, since x → x 1-s is concave, the maximum max p d i=1 p 1-s i is realized by the uniform distribution, which shows the equation (a). Combining ( 27) and ( 28), the error probability is upper bounded as For any sequence of QPIR protocols {Ψ for any sufficiently large ℓ, we have Hence, by ( 30), 1 -P err (Ψ (m ℓ ) QPIR ) approaches zero, which implies (26)."
    },
    {
      "heading": "V. CAPACITY OF MULTI-ROUND QPIR",
      "text": "In this section, we prove that the multi-round QPIR capacity is 1. First, as a generalization of the protocol description in Section II-A, we formally define the multi-round QPIR. Then, we propose the capacity theorem and the proof of the weak converse bound. Since the protocol in Section III-B has the QPIR rate 1, this protocol also achieves the multi-round QPIR capacity. The result in this section includes the result in the previous sections as the one-round QPIR."
    },
    {
      "heading": "A. Formal Definition of Multi-Round QPIR Protocol",
      "text": "For any positive integer r, we give the formal description of the r-round QPIR protocol Ψ (m,r) QPIR . The information flow of the quantum systems is depicted in Fig. 2. When r = 1, the protocol description is equivalent to the protocol defined in Section II-A. Let n, f, m be integers greater than 1. Each of the servers serv 1 , . . . , serv n contains the whole copy of the uniformly and independently distributed f files W = (W 1 , . . . , W f ) ∈ {0, . . . , m -1} f . The t-th server serv t possesses a quantum system B t as local quantum register and the n servers share an entangled state ρ prev on the quantum system The user chooses the target file index K ∈ {1, . . . , f} uniformly and independently of the files W 1 , . . . , W f . The user prepares the query"
    },
    {
      "heading": "Enc",
      "text": "(1),Q [1] ,W serv ,Q [2] ,W serv B, W, Q [2]   W K Fig. 2. The information flow in 2-round QPIR protocol. The servers have all files W = (W 1 , . . . , W f ) and the user retrieves the K-th file W K . The user has a local quantum register C where the state is initialized depending on K and Q 1 . For i ∈ {1, . . . , r}, the i-th round is described as follows. Let Q i t be the query to serv t at round i, and we denote . The query Q i for round i is determined at round i -1. The user sends Q i t to the t-th server serv t . Depending on Q t and W , each server serv t applies a CPTP map That is, when the collection of the encoders is written as W on B is encoded as Each server transmits the system A i t to the user and the received state of the user is the reduced state If i < r, the user applies a quantum instrument is the set of queries at round i + 1 and Q i+1 is the measurement outcome. Then round i ends and round i + 1 starts. If i = r, i.e., at the final round, the user applies a POVM Dec (r),K,Q [r] = {Y M } m M=0 on A r ⊗C depending on K and Q [r] and outputs the measurement outcome M ∈ {0, . . . , m}. If M = m, it is considered as the retrieval failure. Similarly to Section II-A, the security of the protocol is evaluated by the the error probability, the server secrecy, and the user secrecy defined by Given the QPIR protocol Ψ (m,r) QPIR , we define the upload cost, the download cost, and the QPIR rate by Now, we define the r-round QPIR capacities with four parameters as follows. For an error constraint α ∈ [0, 1), server secrecy constraint β ∈ [0, ∞], user secrecy constraint γ ∈ [0, ∞], and upload constraint θ ∈ [0, ∞], the asymptotic security-constrained r-round capacity and the exact securityconstrained r-round capacity are defined as where the supremum is taken for sequences {m ℓ } ∞ ℓ=1 such that lim ℓ→∞ m ℓ = ∞ and for sequences {Ψ ℓ=1 of r-round QPIR protocols to satisfy either (8) or (9) given by lim sup and The multi-round QPIR capacity is derived as follows. Theorem V.1 (Multi-round QPIR capacity). Let r be any positive integer. When servers can share prior entanglement, the r-round QPIR capacity for f ≥ 2 files and n ≥ 2 servers is Proof. Eq. ( 38) is proved by the following inequalities: The first inequality holds by applying the rate-one QPIR protocol in Section III-B repetitively r times. The second, third, and fourth inequalities follow from the definition of the capacities. The last inequality is proved in Section V-B. Therefore, we obtain the theorem."
    },
    {
      "heading": "B. Weak converse bound of multi-round QPIR capacity",
      "text": "We prove the converse bound Our proof comes from the fact that the multi-round QPIR protocol can be considered as a case of the Classical-Quantum (CQ) channel coding with classical feedback [32]. In the CQ channel coding with classical feedback, the sender encodes a classical message W as a quantum state and sends the state over a fixed channel N . The receiver performs a decoding measurement on the received state and returns the measurement outcome to the sender. The sender and the receiver iterate this process r times while using the previous measurement outcomes for encoding and decoding. At the end of the protocol, the receiver receives the classical message W . The paper [32] proved that the capacity of this problem when the sender and the receiver have their local quantum registers, respectively. More specifically, the paper [32] also considered the energy constraint E that for a given Hamiltonian H on the input system of N , the input states ρ 1 , . . . , ρ r to N should satisfy r i=1 Tr ρ i H ≤ E. The CQ channel capacity is characterized by the following proposition. Proposition V.1 ( [32, Theorem 4]). Let N be a quantum channel, r be the number of communication rounds, m be the size of the message set, H be the Hamiltonian on the input system of N , E be the energy constraint, and ε be the error probability. Suppose the sender and the receiver have local quantum registers, respectively. Then, for the CQ channel coding with classical feedback and energy constraint, we have the following inequality: The multi-round QPIR protocol can be considered as a case of this problem where the channel N is the identity channel and there is no energy constraint. To see this fact, we consider the the collection of the servers as the sender and the user as the receiver of the CQ channel coding, and focus on the communication of a classical message from the collection of the servers to the user. The servers sends to the user the systems A i over the identity channel and the user sends queries Q i to the servers as the measurement outcome on A i . The servers and the user have B and C as local quantum registers, respectively. At the end of the protocol, the user obtains the classical target file W K . Therefore, we can consider the multiround QPIR protocol as a CQ channel coding with classical feedback. By the similar proof of [32, Theorem 4], we have the following proposition. Proposition V.2. Consider the CQ channel coding of a classical message W ∈ {0, . . . , m -1} from the sender to the receiver by sending quantum systems A 1 , . . . , A r sequentially over the identity channel and assisted by classical feedback. We assume that the sender and the receiver have local quantum registers, respectively. Let ρ A i W be the state on A i . For the uniformly chosen message W and the decoding output M , we define the error probability ε := Pr[M = W ]. Then we have the following inequality where h 2 (•) is the binary entropy function. For the completeness of our paper, we give a proof of Proposition V.2 in Appendix D. Remark V.1. Proposition V.2 is slightly different from [32,Theorem 4]. First, whereas [32,Theorem 4] considers an energy constraint on the quantum channel, Proposition V.2 assumes no energy constraint. Second, whereas [32,Theorem 4] considers the repetitive uses of a fixed quantum channel N , Proposition V.2 considers each use of the identity quantum channels over A 1 , . . . , A r . Even with these differences, we can apply the same proof steps of [32,Theorem 4] and the first inequality of [32,Eq. (35)] is the inequality (41). Now we prove the weak converse bound. We choose an arbitrary sequence {Ψ Considering the collection of the n servers as the sender and the user as the receiver of Proposition V.2, we can apply Proposition V.2 to the r-round QPIR protocol Ψ (m ℓ ,r) QPIR with the classical message W K ∈ {0, . . . , m ℓ -1}, the transmitted quantum systems A 1 , . . . , A r , and the classical feedbacks Q 1 , . . . , Q r . In this case, ε and m of Proposition V.2 is substituted by ε ℓ and m ℓ , i.e., Eq. ( 42) is written as Therefore, we have which implies (39)."
    },
    {
      "heading": "VI. CONCLUSION",
      "text": "We have studied the capacity of QPIR with multiple servers when the servers share prior entanglement. Considering the user secrecy and the server secrecy, we defined two kinds of QPIR capacities: asymptotic and exact security-constrained capacities with upload constraint. We proved that both QPIR capacities are 1 for any security constraints and any upload constraint. We have constructed a capacity-achieving rateone protocol only with two servers when the file size is the square of an arbitrary integer. The converse has been proved by focusing on the download step of QPIR protocols. Furthermore, we have proved that the capacity of multi-round QPIR is also 1 by the weak converse bound. It is an interesting open question whether the QPIR without shared entanglement also has an advantage over the classical PIR counterparts. This paper has considered the QPIR under the assumption of the prior entanglement and the quantum capacity of this case is strictly greater than the classical PIR capacity. The QPIR capacity without shared entanglement lies between the QPIR capacity of this paper and the classical PIR capacity. Therefore, it should be studied whether the quantum PIR capacity is strictly higher than the classical PIR capacity even without shared entanglement. In this paper, we have assumed that the maximally entangled state can be shared by several servers. That is, we have made no restriction for shared entanglement. This setting is similar to the original studies [35], [36] for the entangled assisted classical capacity for a noisy quantum channel because they have no restriction for shared entanglement. The recent paper [37] derived the entanglement-assisted classical capacity for a noisy quantum channel when shared entanglement is limited. For the extension, the study [37] invented several new methods, which are essential for this restriction. Therefore, it is remained as a future problem to extend our result to the case when the shared entangled state is restricted. As another problem, we can consider the QPIR capacity when the channel from servers to user are noisy quantum channels. It is natural to apply quantum error corrections to each noisy quantum channels and apply our QPIR protocol over the virtually implemented noiseless channels by error correction. In this case, the transmission rate is given by the quantum capacity of the noisy quantum channel. For the converse part, we can easily extend the discussion of Section IV. In this extension, the obtained upper bound of the transmission rate is the classical capacity of the noisy quantum channel. Hence, this simple method does not yield the QPIR capacity with noisy quantum channels. Therefore, it is another challenging problem to calculate the QPIR capacity with noisy quantum channels."
    }
  ]
}