{
  "paperid": "1906.09697v2",
  "title": "Quantum teleportation in high dimensions",
  "authors": [
    "Luo",
    "Zhong",
    "Erhard",
    "Wang",
    "Peng",
    "Krenn",
    "Jiang",
    "Li",
    "Liu",
    "Lu",
    "Zeilinger",
    "Pan",
    "Wootters",
    "Zurek",
    "Bennett",
    "Bouwmeester",
    "Furusawa",
    "Marcikic",
    "De Riedmatten",
    "Tittel",
    "Zbinden",
    "Gisin",
    "Zhang",
    "Wang",
    "Ren",
    "Bao",
    "Riebe",
    "Barrett",
    "Pfaff",
    "Steffen",
    "Fickler",
    "Cerf",
    "Bourennane",
    "Karlsson",
    "Gisin",
    "Ali-Khan",
    "Broadbent",
    "Howell",
    "Neeley",
    "Lanyon",
    "Collins",
    "Gisin",
    "Linden",
    "Massar",
    "Popescu",
    "Krenn",
    "Xie",
    "Kues",
    "Erhard",
    "Wang",
    "Reck",
    "Weinfurter",
    "Calsamiglia",
    "Żukowski",
    "Zeilinger",
    "Horne",
    "Wang",
    "Bruß",
    "Macchiavello",
    "Ivanovic",
    "Yao",
    "Padgett",
    "Żukowski",
    "Zeilinger",
    "Horne",
    "Ekert",
    "Vé Rtesi",
    "Pironio",
    "Brunner",
    "Hensen",
    "Shalm",
    "Giustina",
    "Ací N",
    "Gisin",
    "Masanes"
  ],
  "year": 2024,
  "abstract": "Quantum teleportation allows a \"disembodied\" transmission of unknown quantum states between distant quantum systems. Yet, all teleportation experiments to date were limited to a two-dimensional subspace of quantized multiple levels of the quantum systems. Here, we propose a scheme for teleportation of arbitrarily high-dimensional photonic quantum states, and demonstrate an example of teleporting a qutrit. Measurements over a complete set of 12 qutrit states in mutually unbiased bases yield a teleportation fidelity of 0.75(1), which is well above both optimal single-copy qutrit-state-estimation limit of 1/2 and maximal qubit-qutrit overlap of 2/3, thus confirming a genuine and non-classical three-dimensional teleportation. Our work will enable advanced quantum technologies in high dimensions, since teleportation plays a central role in quantum repeaters and quantum networks. The laws of quantum mechanics forbid precise measurement or perfect cloning of unknown quantum states (1). With the help of shared entanglement and classical communication channel, however, quantum teleportation in principle allows faithful transfer of the unknown quantum states from one particle to another at a distance (2), without physical transmission of the object",
  "sections": [
    {
      "heading": "",
      "text": "itself. There have been numerous experiments on the teleportation of quantum states of single photons (3)(4)(5)(6)(7)(8), atoms (9), trapped ions (10,11), defects in solid states (12), and superconducting circuits (13). All these quantum systems naturally possess not only multiple degrees of freedom, but also, many degrees of freedom can have high quantum numbers (14) beyond the simplified two-level qubit subspace. However, all experiments to date were limited to two-dimensional subspaces, the qubits (3)(4)(5)(6)(7)(8)(9)(10)(11)(12)(13). After the teleportation of two-particle composite state (6) and two degrees of freedom (7), the teleportation of high-dimensional quantum states remained the final obstacle for teleporting a quantum particle intact. The ability of coherent control of high-dimensional (HD) quantum states is important for developing advanced quantum technologies. Compared to the conventional two-level systems, HD states can offer extended possibilities such as both higher capacity and noise resilience in quantum communications (15,16), more efficient quantum simulation (17) and computation (18), as well as larger violation of Bell inequality (19). Recent years have witnessed an increasing capability to generate and measure HD entangled states (19)(20)(21)(22)(23)(24). However, the previous work is predominantly limited in the coherent control of single particle HD state. A joint projection of two independent particles with unknown states into maximally entangled HD states, which requires some forms of controlled interactions and will play a crucial role in the HD teleportation, dense coding, and quantum computing, is more challenging and remains largely unexplored experimentally. Here, we propose an efficient and extendable scheme for teleportation of arbitrarily HD photonic quantum states, and we report the first experimental teleportation of a qutrit, which is equivalent to a spin-1 system. We start by describing our protocol of HD quantum teleportation. For the sake of simplicity, here we explain it using the example of a three-level system, where the underlying physics can be generalized to arbitrary N-level systems (25), as elaborated in detail in the supplementary materials. Suppose Alice wishes to teleport to Bob the quantum state of a single photon, where |0 , |1 , and |2 are encoded by three different paths of the photon (c.f. Fig. 1), their subscripts label the photon, and their coefficients are complex numbers that fulfil 2 2 2 0 1 2 1      . The quantum resource required for teleporting this state is a HD entangled state previously shared between Alice and Bob, for example, bc bc bc b 00 c | | 00 |11 | 22 ( ) / 3 This is one of the three-dimensional (3D) Bell states which, together with other eight orthogonal ones (25), forms a complete orthonormal basis of the bipartite 3D Hilbert space. Conceptually within the theoretical framework of Bennett et al. (2), the most crucial step for the HD teleportation is performing a joint measurement of photon a and b, a process called 3D Bell-state measurement (BSM). With equal probabilities of 1/9, the 3D-BSM projects photon a and b into one of the nine 3D Bell states randomly. Alice can then broadcast the 3D-BSM result classically, which allows Bob to accordingly apply a unitary single-particle 3D transform (26) to reconstruct the original quantum states (eqn.1) at his location (25). In general, for an N-level bipartite system, there exists Recall that in the teleportation of qubits, the four Bell states can be grouped into three symmetric and one anti-symmetric state under particle exchange, which facilitate the discrimination using linear optics (27). In the 3D case already, however, the situation becomes fundamentally more complicated. There are three Bell states that are symmetric and the other six are neither symmetric nor anti-symmetric. In theory, it was shown (28) that it is impossible to discriminate two-photon HD Bell states with linear optics only when the dimensions 3."
    },
    {
      "heading": "N ",
      "text": "To overcome such a linear optical limitation (29), here we utilize N-2 additional single photons, so-called ancillary photons, and a multiport beam splitter (BS) with N-input-N-output all-to-all connected ports (29), which is a generalisation of the quantum Fourier transform. A detailed derivation of the HD-BSM procedure is shown in (25). To get a deeper insight on how the high-dimensional Bell-state measurement works, we use the fact that in reverse a Bell state is generated. This simplifies the analysis because in this case we can focus on one specific \"click-pattern\" as an example, and send single photons backwards from these detectors. We choose to propagate three indistinguishable single photons from the output ports ' ' ' 0 1 2 { , , } a a a backwards through the multi-port, as shown in Fig. 1. Then we condition onto cases where in each input port one and only one photon exists. Due to the all-toall connection in the multi-port, the resulting state contains all length-2 permutations of the 3D states (25). Detection of the ancillary photon in the superposition state results in the obtained state (normalization omitted): The unitary transformation of this state to a target 3D Bell state (Eqn.2) requires an expanded Hilbert space of four dimensions. The extra fourth level |3 , is added to assist the physical realization of the unitary transformation (see 31 U  in Fig. 1), and erased afterwards, which leads to the target 3D Bell state (Eqn. 2) 25). The analysis holds exactly the same if the three indistinguishable photons are \"incident\" from ports Thus, in the experiment, a simultaneous click of the three detectors in the ports ' ' ' This state is already identical to the original state of photon a without the need of any additional unitary corrections. The success probability of the HD-BSM using this scheme is 1/81. Combining with active feed-forward techniques increases the success probability to 1/9 for linear optics. Figure 2 shows the experimental set-up for the 3D quantum teleportation. A femtosecond pulsed laser beam is split into two parts to simultaneously create two photon pairs. The first part of the pump beam is divided into three paths by two beam-displacers which are then focused on the same β-borate-borate (BBO1) crystal. We select the case where in total one photon pair is produced by type-II beam-like spontaneous parametric down-conversion (30) but without knowing at which one of the three paths, which generates the desired entangled state bc 00 |  used as the quantum channel for the 3D teleportation. To ensure long-term phase stability between the three paths, we specifically design and fabricate interferometers with small (4 mm) separation between the three paths. Hence, air fluctuations and disturbances act collectively on all paths such that the qutrits are effectively protected in a decoherence-free space. Before being sent to the HD-BSM, photon b from the entangled qutrits first undergoes the unitary transformation 31 U  , which is experimentally realized using a network of polarising beam splitters and half-wave plates (HWPs). The details are shown in supplementary materials (25). Another pump beam from the same laser passes through BBO2 and creates the second photon pair. One of them is used for the preparation of an arbitrary superposition of the three paths as the input state a to be teleported. The other one is used as the ancillary qutrit x in the HD-BSM. The experimental realization of the HD-BSM puts stringent technological requirements on phase stability, efficiency, and precision. To meet these demands, the HD-BSM is operated in hybrid polarisation-path encoding and employs a fully connected three-input and three-output ultra-low-loss multi-port interferometer. As shown in Fig. 2, in the input, single photons a and b are initialised in horizontal polarization, while photon x is in vertical polarization. Photon a is first combined with photon x using a PBS. The combined beams pass through a HWP set at 22.5 0 , and are superposed with photon b on a partially-polarisation-dependent beam splitter (pPDBS) which totally reflects vertically polarised photons and partially-with a ratio of 1/3reflects horizontally polarised photons. One of the output ports of the pPDBS is detected by three detectors directly, while the other port is further sent through a quarter-wave plate set at 45 0 and then split by a polarising beam splitter and detected by six detectors. It is straightforward to check that all the three photons from the inputs a, b, and x are evenly distributed to each of the output with a ratio of 1/3, realizing the most important function of the multiport. The all-to-all multiport in Fig. 2 involves three-photon nine-path Hong-Ou-Mandel interferences at the polarising beam splitter and the pPDBS. All nine paths are synchronized to arrive within ~10 fs of each other, a delay much smaller than the coherence time of the narrowband (3 nm) filtered single photons (~450 fs). The use of compact and precisely aligned beam-displacers ensures a good spatial overlap in all multi-path interferences simultaneously. Verifications of all two-photon Hong-Ou-Mandel interference combinations at the pPDBS with an average visibility of 0.82(1) are presented in supplementary materials (25). These visibilities in combination with the entanglement source (with a measured fidelity of 0.94(1)) quantify the quality of the three-dimensional teleportation experiment (25). see supplementary materials for details. It is necessary to prove that the teleportation experiment works universally for all possible superposition states in the general form of a |  (eqn. [1]) and has a performance exceeding that using only classical methods. Classically, the optimal single-copy state-estimation fidelity of a three-level quantum system (31) is 0.5 when averaging over the whole Hilbert space. Sampling only over partial state space in biased bases, however, would allow the classical strategy to make use of the biased information to obtain an average state estimation fidelity higher than 0.5. It is therefore important to carefully choose a minimal set of input states such that the random sampling of which leads to the same classical limit as sampling over the whole state space. Such a minimal set of states lies in mutually unbiased bases (32). For a threedimensional system, we need to measure 12 states from four mutually unbiased bases: (1) : (1, 0, 0), (0,1, 0), (0, 0,1) : (1,1,1), ( 1, , ), (1, , )   : ( ,1,1), (1, ,1), (1,1, )   : ( ,1,1), (1, ,1), (1,1, ) Here the vectors ( 0 1 2 ,, , where the normalising constant is omitted. We measure fidelities of the final teleported states, defined as the overlap of the experimentally measured density matrix c  with the ideal input Fig. Figure 3A shows the teleportation results of group for the teleported state |0 , |1 , and |2 , respectively. However, the measurements for the other three groups, which involves equal superpositions of all the three levels, are more complicated. To experimentally access the fidelity of these states in the general form we decompose the density matrix into three parts, 012 021 120 The decomposition unitarily transforms the qutrits into two-dimensional superposition states and one computational state. Our measurement apparatus allows a simultaneous three-outcome readout, directly accessing one of the ijk  (25). We show in Fig. 3B, C, and D the measurement results for three representative states from the group of {1,2,3} B , respectively. The other six states are presented in Figure S6. We note that all reported measurements are without background or accidental count subtraction. The fidelity imperfection is mainly from double pair emissions, spatial mode mismatch in the multi-photon multi-path interferences, and interferometric noise in the state preparation and measurements (25). The fidelities of all the 12 states are displayed in Fig. 4, which are the minimal set allowing us to faithfully derive the teleportation fidelity for the three-level quantum system. In the current experiment, the averaged fidelity is calculated to be 0.75(1), well above the classical limit of 0.5 which can be obtained with the best classical strategy. Proving the universality and non-classicality is already sufficient for teleporting qubits. However, for the N-dimensional teleportation, it is important to further verify that all Ndimensions still can form a coherent superposition and thus survived the teleportation intact. Hence, a genuine N-dimensional teleportation should be distinguished from lower-dimensional cases by excluding the hypotheses that the teleported state could be represented with less dimensions. For our specific 3D teleportation, we can calculate that the maximal overlap between any two-level superposition and the genuine three-level states is 2/3 (25). The teleportation fidelity measured in our work exceeds this threshold by 9 standard deviations, thus concl"
    }
  ]
}