{
  "paperid": "2101.09041v1",
  "title": "Quantum Private Information Retrieval for Quantum Messages",
  "authors": [
    "Song",
    "Hayashi",
    "Chor",
    "Goldreich",
    "Kushilevitz",
    "Sudan",
    "Cachin",
    "Micali",
    "Stadler",
    "Lipmaa",
    "Beimel",
    "Stahl",
    "Yekhanin",
    "Devet",
    "Goldberg",
    "Heninger",
    "Lo",
    "Gertner",
    "Ishai",
    "Kushilevitz",
    "Malkin",
    "Kerenidis",
    "Wolf",
    "Kerenidis",
    "Wolf",
    "Olejnik",
    "Baumeler",
    "Broadbent",
    "Gall",
    "Kerenidis",
    "Laurière",
    "Gall",
    "Rennela",
    "Aharonov",
    "Brakerski",
    "Chung",
    "Green",
    "Lai",
    "Sattath",
    "Song",
    "Hayashi",
    "Song",
    "Hayashi",
    "Song",
    "Hayashi",
    "Allaix",
    "Holzbaur",
    "Pllaha",
    "Hollanti",
    "Kon",
    "Lim",
    "Jozsa",
    "Schumacher",
    "Schumacher",
    "Jozsa",
    "Horodecki",
    "Horodecki",
    "Horodecki",
    "Horodecki",
    "Barnum",
    "Caves",
    "Fuchs",
    "Jozsa",
    "Schumacher",
    "Hayashi",
    "Chan",
    "Ho",
    "Yamamoto",
    "Sun",
    "Jafar",
    "Sun",
    "Jafar",
    "Sun",
    "Jafar",
    "Freij-Hollanti",
    "Gnilke",
    "Hollanti",
    "Karpuk",
    "Kumar",
    "Lin",
    "Rosnes",
    "Graell I Amat",
    "Wang",
    "Skoglund",
    "Lin",
    "Kumar",
    "Rosnes",
    "Graell I Amat",
    "Banawan",
    "Ulukus",
    "Tian",
    "Sun",
    "Chen",
    "Tandon",
    "Banawan",
    "Ulukus",
    "Holzbaur",
    "Freij-Hollanti",
    "Li",
    "Hollanti",
    "Kadhe",
    "Garcia",
    "Heidarzadeh",
    "Rouayheb",
    "Sprintson",
    "Tajeddine",
    "Gnilke",
    "Karpuk",
    "Freij-Hollanti",
    "Hollanti",
    "Bennett",
    "Wiesner",
    "Bennett",
    "Brassard",
    "Crépeau",
    "Jozsa",
    "Peres",
    "Wootters"
  ],
  "year": 2021,
  "abstract": "Quantum private information retrieval (QPIR) for quantum messages is the protocol in which a user retrieves one of the multiple quantum states from one or multiple servers without revealing which state is retrieved. We consider QPIR in two different settings: the blind setting, in which the servers contain one copy of the message states, and the visible setting, in which the servers contain the description of the message states. One trivial solution in both settings is downloading all states from the servers and the main goal of this paper is to find more efficient QPIR protocols. First, we prove that the trivial solution is optimal for one-server QPIR in the blind setting. In one-round protocols, the same optimality holds even in the visible setting. On the other hand, when the user and the server share entanglement, we prove that there exists an efficient one-server QPIR protocol in the blind setting. Furthermore, in the visible setting, we prove that it is possible to construct symmetric QPIR protocols in which the user obtains no information of the non-targeted messages. We construct three two-server symmetric QPIR protocols for pure states. Note that symmetric classical PIR is impossible without shared randomness unknown to the user.",
  "sections": [
    {
      "heading": "I. INTRODUCTION",
      "text": "A. Backgrounds: Private information retrieval (PIR) for classical messages 1) Private information retrieval (PIR): Private information retrieval is a method to retrieve a message from a server without revealing which message is retrieved. PIR has a simple solution of downloading all messages and this trivial solution is proved to be optimal [1], i.e., the optimal communication complexity is O(m), where m is the total number of bits in the messages. To improve the communication efficiency of PIR, there have been mainly two approaches: PIR with computational assumptions [2], [3] and PIR with multiple servers [4]- [6]. Recently, information-theoretic aspects of PIR has been extensively studied [27]- [41]. In this paper, we only focus on the one-server and multi-server PIRs without computational assumptions. Symmetric PIR (SPIR) is PIR in which the user obtains only the targeted message but no information of the non-targeted messages. In the one-server case, SPIR is also called oblivious transfer, which is proven to be impossible even in the quantum case [7]. In the multi-server case, Gertner et al. [8] proved that SPIR is impossible, but it becomes possible if the servers share randomness. 2) One-server quantum PIR for classical messages: PIR has also been studied when quantum communication is allowed between the user and the server(s) [9]- [20]. Hereinafter, Server User 1. message states ρ 1 , . . . , ρ f 2. target index k ∈ [f] 5. retrieval ρ k 3. queries Q (1) , . . . , Q (r)   4. answers A (1) , . . . , A (r)   Fig. 1: One-server QPIR protocol with quantum messages. At round i, the user uploads a query Q (i) and downloads an answer A (i) . we denote quantum PIR for classical messages as C-QPIR. Interestingly, when the server is honest, i.e., the server does not deviate from the protocol, Le Gall [13] proposed a C-QPIR protocol with communication complexity O( √ m), and Kerenidis et al. [14] improved this result by O(poly log m), where the communication in the quantum case is the total number of communicated qubits. However, when the server deviates from the protocol as far as its malicious operations are not revealed to the user, which is called specious adversary, Baumeler and Broadbent [12] proved that the communication complexity is at least O(m), i.e., the trivial solution of downloading all messages is optimal also for this case. When prior entanglement is allowed between the user and the server, the communication complexity is improved by O(log m) for the honest server model [14], but the communication complexity is also lower bounded by O(m) for the specious attack [15]. 3) Multi-server quantum PIR for classical messages: For multi-server C-QPIR, Kerenidis and de Wolf [10] proposed a symmetric C-QPIR protocol without shared randomness. Song and Hayashi [16] derived symmetric and non-symmetric C-QPIR capacity, which is defined similar to its classical counterpart [28], [29] as the optimal communication efficiency for arbitrary-long classical messages, and proved that symmetric C-QPIR can be constructed without any communication loss if prior-entanglement among servers is allowed. They [17], [18] and Allaix et al. [19] also considered C-QPIR with colluding TABLE I: Definition of symbols Symbol Definition m Total size of messages (states) f Number of messages (states) r Number of rounds in multi-round models n Number of servers in multi-server models servers in which secrecy of the protocol is preserved even if some servers may communicate and collude. Kon and Lim [20] constructed a symmetric C-QPIR protocol with quantumkey distribution."
    },
    {
      "heading": "B. Contribution: quantum PIR for quantum messages",
      "text": "Even if quantum PIR has been studied for classical messages, there has been no study of PIR for quantum messages, i.e., quantum states. This paper considers quantum PIR for quantum messages. Throughout this paper, we denote quantum PIR for quantum messages as QPIR. Downloading all quantum messages is also a trivial solution for QPIR. Intuitively, it seems reasonable to conjecture this trivial solution is optimal for QPIR. However, since the C-QPIR for the honest server has more efficient solutions than the trivial solution [13], [14], we cannot exclude the possibility of efficient one-server QPIR protocols. Furthermore, whereas the optimality proof of classical PIR [1] uses the communication transcript between the server and the user, we cannot apply the same technique because quantum states cannot be copied because of the nocloning theorem. Thus, the first goal is to answer whether the trivial solution is also optimal QPIR under several attack models and how we can construct more efficient protocols than the trivial solution. Furthermore, it is not unknown if symmetric QPIR (QSPIR) is possible on the multiple server model. 1) Two settings in QPIR: QPIR can be studied in two distinct settings, called the blind and visible settings, in which quantum state compression has also been extensively studied [21]- [26]. In the blind setting, the server(s) contains quantum systems X 1 , . . . , X f with the message states ρ 1 , . . . , ρ f , respectively, but does not know the states of the systems. Due to the no-cloning theorem, the server(s) cannot generate more copies of the message states and the server's operations are independent of the message states. QPIR in the blind setting is suitable for the case where the server(s) generates the message states by some quantum algorithm and performs the QPIR task. On the other hand, in the visible setting, the server(s) contains the descriptions of the message states. With the descriptions of quantum states, the servers can generate multiple copies of the quantum states, without the limitation of the nocloning theorem, and apply quantum operations depending on the descriptions of the states. Since any protocol in the blind setting can be considered as a protocol in the visible setting, we can generally expect to achieve lower communication complexity in the visible setting. Even if the description of a quantum state is classical information, it is infinitelength classical information, and therefore we cannot send this description via QPIR for classical messages. Furthermore, the visible setting is a reasonable setting for the case where the user has no ability to generate quantum states and requires the generation of the targeted state along with the QPIR task. 2) Optimality of trivial solution for one-server QPIR: Our first result is that the trivial solution is optimal for one-server QPIR for the honest server model. For the one-server case, the comparison of the our results and previous results are summarized in Table II. We first prove for the one-round case and then extend the result to the multi-round case. In the oneround case, we prove the optimality both for blind and visible settings, but in the multi-round case, we only prove for the blind setting. The entropic inequalities are the key instruments for the proof, and we prove and use a chain rule for the multi-round case. Since the honest server model is the weakest attack model, this result implies that the trivial solution is also optimal for any attack models. 3) One-server QPIR protocol with prior entanglement in blind setting: Secondly, with prior entanglement between the user and the server, we prove that there exists an efficient QPIR protocol on the honest server model. To be precise, we propose a method to construct a QPIR protocol of communication complexity O(f (m)) with prior entanglement from C-QPIR protocol of communication complexity O(f (m)) with prior entanglement. We construct the QPIR protocol by the combination of C-QPIR and quantum teleportation [43]. The proposed QPIR protocol inherits the security of C-QPIR. With this property, on the honest server model with prior entanglement, there exists a QPIR protocol of communication complexity O(log m) since there exist C-QPIR protocols of communication complexity O(log m) by Kerenidis et al. [14]. 4) Two-server QSPIR protocols for pure states in visible setting: Lastly, we prove that QSPIR is possible in the visible setting. We propose two-server QSPIR protocols for pure states in the visible setting, and the protocols work for the different classes of states. The first protocol is for pure qubit states. This protocol succeeds with probability and requires 8qubit average communication and 4-ebit average entanglement between servers (or 16-qubit communication without shared entanglement). The second protocol is for pure qudit states, where a qudit means a quantum d-level system. This protocol also succeeds with probability and requires 4d d log dqubit average communication and 2d d log d-ebit average entanglement between servers (or 8d d log d-qubit communication without shared entanglement). The last protocol is for pure states |U⟫ = s,t u st |s |t described by commutative unitary matrices U = s,t u st |s t| on qudits. This protocol succeeds deterministically with 4 log d-qubit communication and 2 log d ebits (or 8 log d-qubit communication without shared entanglement). The QSPIR protocols have the following important properties. First, the protocols delegate most of the quantum information processing to the servers. All queries of the user are classical and the only quantum resource required for the user is a measurement apparatus for a fixed basis. Second, the average quantum communication complexities of these TABLE II: Optimal communication complexity of one-server QPIR (a) One-server QPIR Messages Server Model Optimal communication complexity Ref. Classical Honest O(poly log m) [14] Classical Specious Θ(m) [12] Quantum (blind) Honest Θ(m) [This paper] Quantum (visible) Honest Θ(m) (for one-round) [This paper] (b) One-server QPIR with prior entanglement Messages Server Model Optimal communication complexity Ref. Classical Honest O(log m) [14] Classical Specious Θ(m) [15] Quantum (blind/visible) Honest O(log m) [This paper] (m: Total size of messages) protocols do not scale with the number of message states. On the other hand, as a trade-off, the size of the queries scales linearly with the number of message states. The idea of our QSPIR protocols is explained as follows. In the visible setting, we can prepare the message states |ψ ℓ by the state preparation unitaries U ℓ such that U ℓ |0 = |ψ ℓ . We can decompose any state preparation unitaries U ℓ on qudits by phase-shift operations and rotation operations, which are described classically by 2(d -1) angles. Then, with the query structure of classical PIR, the servers collectively encode the phase-shift operations and the rotation operations composing U k into the maximally entangled states, where k is the index of the targeted message state |ψ k . By the query structure of classical PIR, this encoding process can be accomplished without leaking k to each server. The user receives the maximally entangled states encoded with the phase-shift operations and the rotation operations, and finally recovers the targeted message state |ψ k by the entanglement-swapping. The QSPIR protocol for qubit states is done more efficiently since only one rotation operation is necessary for decomposing U ℓ . For qudit states for d ≥ 3, the rotation operations for decomposing U ℓ are non-commutative and this non-commutativity leads to the increased complexity. The remainder of the paper is organized as follows. Section II is the preliminaries of the paper. Section III derives the lower bound of the communication complexity for oneserver QPIR. In the blind setting, Section IV proposes an efficient one-server QPIR protocol with prior entanglement. Section V proposes an efficient QPIR protocol in the visible setting. Section VI is the conclusion of the paper."
    },
    {
      "heading": "II. PRELIMINARIES",
      "text": "We define [a : b] = {a, a + 1, . . . , b} and [a] = {1, . . . , a}. The dimension of a quantum system X is denoted by |X|. The von Neumann entropy is defined as H(X) = H(ρ X ) = Tr ρ X log ρ X , where ρ X is the state on the quantum system X. Proposition 1. The von Neumann entropy satisfies the following properties. (a) H(X) = H(Y ) if the state on X ⊗ Y is a pure state, (b) H(XY ) = H(X) + H(Y ) for product states on X ⊗ Y , (c) Entropy does not change by unitary operations, (d) H(XY ) + H(X) ≥ H(Y ), (e) H( s p s ρ s ) = s p s (H(ρ s ) -log p s ) if Tr ρ s ρ t = 0 for any s = t. The property (d) is proved as follows. Let Z be the reference system in which the state on XY Z is pure. Then, H(XY ) + H(X) = H(Z) + H(X) ≥ H(XZ) = H(Y ). Throughout the paper, we use the symbols (a), (b), (c), (d), (e) to denote which property is used, e.g., (a) = means that the equality holds from the property (a). Proposition 2. Consider two quantum systems A and B. If any pure states ρ AB and ρ ′ AB satisfy ρ A = ρ ′ A , there exists a unitary U B on B such that ρ AB = (I A ⊗ U B )ρ ′ AB (I A ⊗ U * B ). Proof. Diagonalize ρ A = s p s |s s|. When ρ AB = |ψ AB ψ AB | and ρ ′ AB = |ψ ′ AB ψ ′ AB |, we have |ψ AB = s p s |s, f (s) and |ψ ′ AB = s p s |s, g(s) , where {|f (s) } and {|g(s) } are sets of orthonormal vectors of B. Thus, U B = s |f (s) g(s)| is the desired unitary. For a d 1 × d 2 matrix we define For A ∈ C d1×d2 , B ∈ C d1×d1 , and C ∈ C d2×d2 , we have the relation We call a d-dimensional system C d a qudit. Define generalized Pauli matrices and the maximally entangled state on E (1) [ρ] A (0) User Server S (0) T S (1)   Y E Fig. 2: One-round QPIR protocol in the visible setting. qudits as where ω = exp(2πι/d) and ι = √ -1. We define the generalized Bell measurements If there is no confusion, we denote"
    },
    {
      "heading": "III. OPTIMALITY OF TRIVIAL PROTOCOL FOR ONE-SERVER QPIR",
      "text": "In this section, we prove that the trivial solution of downloading all messages is optimal for the one-server QPIR in two cases. We first prove the optimality when the user and the server communicate for one-round in Section III-A, and extends the optimality to the multi-round case in Section III-B. The multi-round case is proved only in the blind setting."
    },
    {
      "heading": "A. Optimality of trivial protocol for one-server one-round QPIR",
      "text": "In this subsection, we prove that the optimal communication complexity for one-server one-round QPIR is m, where m is the total number of qubits in the message states. The achievability part is proved by the trivial solution, which can be implemented in the blind setting, and we will prove the tight lower bound in the visible setting. Since any protocol in the blind setting can be regarded as a protocol in the visible setting, our tight lower bound in the visible setting proves that the trivial solution is optimal for both blind and visible settings. We formally describe one-server one-round QPIR protocols in the visible setting with Figure 2 as follows. The message states are given as arbitrary f states ρ = (ρ 1 , . . . , ρ f ) on quantum systems X 1 , . . . , X f , respectively, The server has the descriptions of all messages states ρ. The user chooses the index of the targeted message K ∈ [f], i.e., ρ k is the targeted quantum state when K = k. We assume that the user and the server contain local quantum registers, respectively, so that all local operations are written as unitary operations. A QPIR protocol Φ is described by three unitary maps (D (0) , D (1) , E (1) ) in the following steps. 1) Query: When K = k, the user prepares the initial state as 1) , and sends Q (1) to the server. 2) Answer: The server prepares the initial state |0 ∈ S (0) , applies a unitary map E (1) [ρ] from S (0) ⊗ Q (1) to A (1) ⊗ S (1) , and returns to the user the system A (1) . 3) Reconstruction: The user applies a unitary map D (1) from A (1) ⊗ T (1) to Y ⊗ E, and outputs the state on Y as the protocol output. The input-output relation The QPIR protocol Φ should satisfy the following conditions. • Correctness: When the output state on Y with the target index for any k and any message states ρ. • User secrecy: When the state on Q (1) with the target index , the user secrecy is for any k, ℓ. We evaluate the efficiency of a QPIR protocol Φ by the communication complexity CC(Φ) := log |Q (1) | + log |A (1) |, which is the whole dimension of uploaded and downloaded systems. The communication complexity of the trivial solution of downloading all states is The following theorem proves the optimality of the trivial solution. Theorem 1. For any one-server one-round QPIR protocol Φ, the communication complexity CC(Φ) is lower bounded as where X ℓ is the system of the ℓ-th message ρ ℓ . For the proof of Theorem 1, we prepare the following notations and lemma. Given the description of states ρ and the target index k, we denote the state on the system A (1) ⊗T (1) by ρ k,ρ A (1) T (1) . If the message states are pure states |φ 1 , . . . , |φ f , we denote ρ k,ρ A (1) T (1) by ρ k,|φ1,...,φ f A (1) T (1)   . Let d ℓ := |X ℓ | and d := f ℓ=1 d ℓ . Lemma 1. Suppose (10). For any k, ℓ ∈ [f], there exists a unitary U k→ℓ T (1) on T (1) such that for any message states ρ. ⊗ T (1) be the state on Q (1) ⊗ T (1) for user's input k ∈ [f]. From the secrecy condition (10), the state on Q (1) does not depend on the value of k. Since the state on Q (1) ⊗T (1) is a pure state, there exists a unitary U k→ℓ T (1)   on T (1) that maps ⊗T (1) by Proposition 2. This unitary U k→ℓ T (1) does not depend on the message states ρ. Since the server's operation is not applied to T (1) , the same unitary U k→ℓ T (1) satisfies (12). Proof of Theorem 1. First, we prove that is a set composed of orthogonal states. Let (s 1 , . . . , s f ), (s ′ 1 , . . . , s ′ f ) be any two different strings and k ∈ [f] be an index satisfying since the correctness condition (9) guarantees that the two states can be made orthogonal by the decoding unitary map D (1) . Furthermore, for the same (s 1 , . . . , s f ) and (s ′ 1 , . . . , s ′ f ), Eq. ( 14) implies that because there exists a unitary map U 1→k T (1) on T (1) such that from Lemma 1. Since (15) holds for any different (s 1 , . . . , s f ) and (s ′ 1 , . . . , s ′ f ), the set ( 13) is composed of orthogonal states. Next, we consider the case where the user's input is k = 1 and the server applies the CPTP map s1,...,s f which is the uniform mixture of encoding maps. Then, the state on A (1) ⊗ R (1) is and the von Neumann entropy of ρ * is where (22) follows from the orthogonality of the states in (13). Furthermore, we have ≤ log |A (1) | + log |Q (1) | (26) Combining ( 23) and ( 27), we obtain the desired inequality (11)."
    },
    {
      "heading": "B. Optimality of trivial protocol for one-server multi-round QPIR in blind setting",
      "text": "In this subsection, we extend the the optimality of the trivial solution to the case where the user and the server communicate multiple rounds in the blind setting. To be precise, we define the r-round QPIR protocol in the blind setting as follows (2round protocol is depicted in Figure 3). The message states are given as arbitrary f states The server contains the system S (0) . The user chooses the index of the targeted message K ∈ [f], i.e., ρ k is the targeted quantum state when K = k. When K = k, the user prepares the initial state as |k ⊗|0 ∈ A (0) ⊗T (0) , We assume that the user and the server contain local quantum registers, respectively, which enable that all local operations are written as unitary operations. A QPIR protocol Φ is described by unitary maps D (0) , . . . , D (r) , E (1) , . . . , E (r) in the following steps. 1) Query: For all i ∈ [r], the user applies a unitary map D (i-1) from A (i-1) ⊗ T (i-1) to Q (i) ⊗ T (i) , and sends Q (i) to the sender. 2) Answer: For all i ∈ [r], the server applies a unitary map 1) to A (i) ⊗ S (i) and sends A (i) to the user. 3) Reconstruction: The user applies D (r) from A (r) ⊗ T (r) to Y ⊗ E, and outputs the state on Y as the protocol output. The input-output relation (1) • E (1) ). The QPIR protocol Φ should satisfy the following conditions. • Correctness: When |ψ k ψ k | denotes a purification of ρ k with the reference system R k , the correctness is T (1)   User Server S A (1) A ( 2) T S (2)   Y E Fig. 3: 2-round QPIR protocol in the blind setting. for any K = k and any state ρ [f] . • User secrecy: When the state on for any k, k ′ , i. The communication complexity of the one-server multi-round QPIR is written as For any one-server multi-round QPIR protocol Φ in the blind setting, the communication complexity CC(Φ) is lower bounded by f ℓ=1 log |X ℓ |, where X ℓ is the system of the ℓ-th message ρ ℓ . For the proof of Theorem 2, we prepare the following lemmas."
    },
    {
      "heading": "Lemma 2. H(A",
      "text": "Proof. Lemma 2 is shown by the relation Proof. Given the user's input k, the state on R k ⊗ Y is a pure state, and therefore, R k is independent of any system except for Y . Thus, we have for any k. Note that the state on R [f] ⊗ S (r) does not depend on k due to the secrecy condition (28). Thus, applying (29) recursively for all k, we have Proof of Theorem 2. From Lemmas 2 and 3, we derive the following inequalities: where ( 35) is obtained by applying Lemma 2 for all i = 1, . . . , r -1, and ( 38) is from Lemma 3. Taking the maximum of H(X [f] ) over all states ρ 1 , . . . , ρ f , we obtain CC(Φ) In the previous section, we proved that the trivial solution is optimal for one-server QPIR. In this section, we show that if we allow shared entanglement between the user and the servers, we can construct a QPIR protocol with lower communication complexity than the trivial solution. The protocol satisfying Theorem 3 is a simple combination of quantum teleportation [43] and any C-QPIR protocol. For the description of the protocol, we use the generalized Pauli operators and maximally entangled state for d-dimensional systems defined in (6). We construct the QPIR protocol satisfying Theorem 3 as follows. Protocol 1. Let Φ cl be a C-QPIR protocol and d 1 , . . . , d f be the size of the f classical messages. From this protocol, we construct a QPIR protocol for quantum messages as follows. Let X 1 , . . . , X f be the quantum systems with dimensions d 1 , . . . , d f , respectively, and ρ 1 , . . . , ρ f be the quantum message states on systems X 1 , . . . , X f . The user and the server share the maximally entangled states are possessed by the user and the server, respectively. The user and the server perform the following steps. 1) For all ℓ ∈ [f], the server performs the generalized Bell measurement M XZ,d ℓ , defined in (7), on X ℓ ⊗ Y ′ ℓ , where the measurement outcome is written as 2) The user and the server perform the C-QPIR protocol Φ cl to retrieve m k = (a k , b k ). 3) The user recovers the k-th message ρ k by applying The correctness of the protocol is guaranteed by correctness of the teleportation protocol and the C-QPIR protocol Φ cl . When the ℓ-th message state is prepared as ρ ℓ and its purification |φ ℓ is denoted with the reference system R ℓ , after Step 1, the states on R ℓ ⊗ Y ℓ is To analyze the secrecy of Protocol 1, note that only Step 2 has the communication between the user and the server. Thus the secrecy of Protocol 1 is guaranteed by the secrecy of the underlying protocol Φ cl . In the honest server model, Kerenidis et al. [14] proposed a C-QPIR protocol with communication complexity O(log m) and prior entanglement O(m). Therefore, we obtain the following corollary."
    },
    {
      "heading": "Corollary 1. On the honest server model in the blind setting, there exists a QPIR protocol for quantum messages with communication complexity O(log m) and prior entanglement O(m).",
      "text": "One property of Protocol 1 is that all other states in the server are destroyed at Step 1. This is a disadvantage for the server but an advantage for the user since the user can retrieve other states ρ ℓ by retrieving classical information m ℓ ∈ [0 : V. TWO-SERVER SYMMETRIC QPIR PROTOCOLS IN VISIBLE SETTING In this section, we propose two-server one-round QSPIR protocols with classical query in the visible setting. In the multi-server model, the servers cannot communicate with each other. In the visible setting, the server has the description of quantum states instead of the states. With a description of a state ρ, the server may generate multiple copies of ρ, without limitation of the no-cloning theorem, and apply quantum operations depending on the description of ρ. Our protocols in this section are symmetric QPIR (QSPIR) in which the user only obtains the information of the targeted message state. Thus, our protocols prove that the QSPIR is possible in the visible setting."
    },
    {
      "heading": "A. Definition and main theorems",
      "text": "We propose three QSPIR protocols in the visible setting for pure states. The communication complexity of the protocols are summarized in Table III. Even if the QPIR's trivial solution of downloading all states is not a QSPIR protocol, we can evaluate the efficiency of our QSPIR protocols by comparison with the communication complexities of the QPIR's trivial solution. Compared to the communication complexity of the QPIR's trivial solution is f log d qubits, the quantum communication complexities of our protocols do not scale with the number of messages f but scale with the dimension of the systems in which the message states are prepared. Thus, when the number of messages f is sufficiently greater than the dimension, the proposed protocols are more efficient than the QPIR's trivial solution of downloading all messages. Our QSPIR protocols are included in the class of n-server QSPIR protocols in the visible setting with the classical queries described as follows. Let P(C d ) be the set of pure states in C d . We formally define a QSPIR protocol Φ for P ⊂ P(C d ). The message states are given as arbitrary f states ψ = (|ψ 1 , . . . , |ψ f ) ∈ P f and each server has the descriptions of all messages states. The user chooses the index of the targeted message K ∈ [f], i.e., |ψ k is the targeted quantum state when K = k. A protocol Φ constructed by the following steps. 1) Query: The user randomly encodes K as classical queries sends Q j to the j-th server. That is, the variable Q is subject to the conditional distribution p Q|K=k , which is chosen by the user. 2) Entanglement Sharing: Independently of the queries, the servers share an entangled state ρ init on S 1 ⊗ • • • ⊗ S n , where S j is contained in the j-th server. TABLE III: Cost of Two-Server QSPIR Protocols in Visible Setting Message States Classical Communication Quantum Communication Prior Entanglement Protocol 3 Pure qubit states 2f bits 8 qubits 4 ebits Protocol 4 Pure qudit states 2f bits 4d d log d qubits 2d d log d ebits Protocol 2 Commutative unitary 2f bits 4 log d qubits 2 log d ebits 3) Answer: For all j ∈ [n], the j-th server applies a CPTP map E j [ψ, q j ] from S j to A j and sends A j to the user when Q j = q j . 4) Reconstruction: The user performs a measurement by a POVM {M, I -M} on Y ⊂ A. If M is measured, the targeted state |ψ k is recovered correctly in Y ′ . If the reconstruction fails, i.e. I -M is measured, repeat from Step 2. The protocol Φ should satisfy the following conditions. • Correctness: At each execution of Step 4, the user recovers the targeted state |ψ k with positive probability p. • User secrecy: The user secrecy is for any distribution of K. • Server secrecy: Let ρ A (k, ψ) be the state on A with the target index k and the message states ψ = (|ψ 1 , . . . , |ψ f ). The server secrecy is for any k ∈ [f] and any states ψ = (|ψ 1 , . . . , |ψ f ), φ = (|φ 1 , . . . , |φ f ) ∈ P f such that |ψ k = |φ k . The average classical and quantum communication complexities are defined as since the classical queries are uploaded once and the quantum answers are downloaded 1/p times on average. Our protocols will be defined for n = 2 servers with the maximally entanglement states as the prior entanglement. The prior entanglement can be replaced by user's upload of the entangled states. However, we state our results with the prior entanglement because the entangled states can be prepared without any user's operation. We prove the following two theorems. The protocols for pure states are constructed by the following idea. Any pure state is written as U|0 with unitary matrices U which are decomposed by rotation operations and phase-shift operations. With this fact, the user requests the servers to apply certain rotation operations and phase-shift operations on bipartite entangled states so that the user can recover the targeted pure state after receiving the entangled state. To guarantee the user secrecy, we import to our protocols the same query structure of two-server classical PIR protocol by Chor et al. [1]. We denote by U(C d ) the unitary group on C d and define the set of pure states associated with U(C d ) as For a subset C of U(C d ), we denote We can find the following relation between QSPIR protocols for S(C) and P(C). Proof. We construct a QSPIR protocol for P(C) as follows. After applying the QSPIR protocol for S(C) whose output state is |U k ⟫ on A ⊗ B, the user performs the basis measurement {|0 , . . . , |d -1 } on A. If the measurement outcome is 0, the resultant state on B is |ψ k = U k |0 . Otherwise, repeat the process. Since the measurement outcome is 0 with probability 1/d, the expected number of trials is d. Thus, the average communication complexity is cd. We also construct a QSPIR protocol for pure states represented by commutative unitary matrices.  In the following subsections, we construct the QSPIR protocols to achieve the communication complexity of Theorems 4, 5, 6. Since the protocol for Theorem 6 is the most simplest and the similar idea is used in the other two protocols, we will first construct the protocol for Theorem 6 and then the other two protocols."
    },
    {
      "heading": "B. QSPIR protocol for pure states described by commutative unitaries",
      "text": "In this subsection, we construct a two-server QSPIR protocol in the visible setting which achieves the communication complexity in Theorem 6. Protocol 2 (Two-server QSPIR protocol for pure states described by commutative unitaries). For commutative f unitaries U 1 , . . . , U f on C d , the message states are given as When the user's target index K is k ∈ [f], i.e., the targeted state is |U k ⟫, our protocol is given as follows. 1) Query: The user sends Q and Q ′ to Server 1 and Server 2, respectively. 2) Entanglement Sharing: Let A, A ′ , B, B ′ be qudits. Server 1 and Server 2 share two maximally entangled state |I d ⟫ on A ⊗ A ′ and B ⊗ B ′ , where Server 1 (Server 2) contains A ⊗ B (A ′ ⊗ B ′ ). 3) Answer: When Q = q and Q ′ = q ′ , we define Server 1 applies on A and B, respectively, and sends A and B to the user. Similarly, Server 2 applies on A ′ and B ′ , respectively, and sends A ′ and B ′ to the user. 4) Reconstruction: The user outputs the state on Protocol 2 satisfies the correctness, secrecy, and communication complexity, desired in Theorem 6, which is shown as follows. • Correctness: Consider the case where Q k = 1. When Q = q, the state on A ⊗ A ′ after the measurement is where (58) follows from the commutativity of the unitaries U 1 , . . . , U f , q ℓ ⊕q ′ ℓ = δ ℓ,k , and (q k , q ′ k ) = (1, 0). By similar analysis, if • Secrecy: Throughout the protocol, the servers only obtain the queries, and each query is uniformly random f bits. Therefore, each server does not obtain any information of k. On the other hand, at the end of the protocol, the user obtains both of |U k ⟫ and |U † k ⟫. Although |U † k ⟫ is transmitted additionally, no information of all other message states is leaked to the user. • Communication complexity: The query is 2f bits, the communication from the server to the user is 4 qudits, i.e., 4 log d qubits, and prior entanglement is 2 copies of |I d ⟫, i.e., 2 log d ebits."
    },
    {
      "heading": "C. QSPIR protocol for pure qubit states",
      "text": "In this subsection, we construct a two-server QSPIR protocol for pure qubit states in the visible setting which achieves the communication complexity in Theorem 4. Define the rotation operation on C 2 and the phase-shift operation by for θ, ϕ ∈ [0, 2π). For any ϕ, ϕ ′ , θ, θ ′ , we have and therefore, S(ϕ) and S(ϕ ′ ) (R(θ) and R(θ ′ )) are commutative. We also have and As special cases, we have Y := XZ = R(π/2) and Z = S(π). Any pure qubit states |ψ are written with some ϕ ∈ [0, 2π) Now, we construct a QSPIR protocol in the visible setting for qubit states, which achieves the communication complexity in Theorem 4. Protocol 3 (Two-server QSPIR protocol for qubit states). For any message qubit states |ψ 1 , . . . , |ψ f ∈ P(C 2 ), we choose the parameters ϕ ℓ and θ ℓ as When the user's target index K is k ∈ [f], i.e., the targeted state is |ψ k , our protocol is given as follows. 1) Query: The same as Protocol 2. 2) Entanglement Sharing: Let A, A ′ , B, B ′ be qubits. Server 1 and Server 2 share two maximally entangled state |I 2 ⟫ on A ⊗ A ′ and B ⊗ B ′ , where Server 1 contains A ⊗ B and Server 2 contains A ′ ⊗ B ′ . 3) Answer: When Q = q, Server 1 calculates θ := f ℓ=1 q ℓ θ ℓ and φ := f ℓ=1 q ℓ ϕ ℓ , applies R(-θ) and S( φ) on A and B, respectively, and sends A ⊗ B to the user. Similarly, when Q ′ = q ′ , Server 2 calculates θ′ := f ℓ=1 q ′ ℓ θ ℓ and φ′ := f ℓ=1 q ′ ℓ ϕ ℓ , applies R(-θ′ ) and S( φ′ ) on A ′ and B ′ , respectively, and sends A ′ ⊗ B ′ to the user. 4) Reconstruction: a) The user performs the Bell measurement M XZ defined in (7) on A ′ ⊗ B ′ . Depending on the measurement outcomes (a, b) ∈ {0, 1} 2 , the user applies Y -a ⊗ Z a+b on A⊗B and performs the basis measurement {|0 , |1 } on A. b) If Q k = 1 and the measurement outcome is 0, the state on B is |ψ k . If Q k = 0 and the measurement outcome is 1, the user applies X operation on B and then the state on B is |ψ k . This process succeeds with probability 1/2. Otherwise, repeat from Step 2. Protocol 3 satisfies the correctness, secrecy, and communication complexity, desired in Theorem 4, which is shown as follows. • Correctness: When Q = q, after the operations of the servers, the states on A ⊗ A ′ and B ⊗ B ′ are = |R((-1) After the Bell measurement of the user with the measurement outcome (a, b), the state on A ⊗ B is derived from (8) as After the user applies Y -a ⊗ Z a+b on A ⊗ B in Step 4-a), the state (72) is changed as and if the basis measurement outcome in Step 4-b) is x ∈ {0, 1}, the last state on B is (R((-1) q k θ k )S((-1) If the measurement outcome x is 1 and q k = 0, the resultant state after the user's operation X is where (e) is from (61). For each execution of Step 4, the user obtains |ψ k with probability 1/2. The probability to obtain |ψ k within n repetition of Steps 3 and 4 is 1 -1/2 n , and the average number of repetitions is 2. • Secrecy: Each server does not obtain any information of k since the query is the same as Protocol 2. At each repetition of Step 4, the user obtains the states of ( 66) and ( 69), which only depends on the state |ψ k . Thus, the user obtains no information of the other states. • Communication complexity: The query is 2f bits. For each execution of Steps 2-4, necessary communication is 4 qubits and necessary prior entanglement is 2 ebits. Since the query is sent only once at Step 1, the classical communication complexity is 2f bits. Thus, the average quantum communication complexity is 8 qubits, and the average size of entanglement is 4 ebits. If we replace the prior entanglement by the transmission of |I 2 ⟫ ⊗ |I 2 ⟫ from the user to the servers, the average communication complexity is 2f bits and 16 qubits. Compared to the QPIR's trivial solution of downloading all quantum messages, which requires the communication of f qubits, the above protocol has less quantum communication on average when f > 16 even if ebits are uploaded by the user. On the other hand, our protocol requires classical communication of 2f bits."
    },
    {
      "heading": "D. QSPIR protocol for pure qudit states (d ≥ 2)",
      "text": "In this subsection, we construct a two-server QSPIR protocol for pure qudit states in the visible setting which achieves the communication complexity in Theorem 5. Similar to Protocol 3, we first consider the parameterization of pure states on d-dimensional systems. Define d×d matrices R(θ 1 , .., θ d-1 ) and S(ϕ 1 , .., ϕ d-1 ) as where R s (θ) is the rotation with respect to the two basis elements |s -1 and |s . Notice that S(ϕ 1 , . . . , ϕ d-1 ) for all ϕ 1 , . . . , ϕ d-1 (R s (θ s ) for all θ s ) are commutative but any two of R 1 (θ 1 ), . . . , R d-1 (θ d-1 ) are not in general. We also have S(ϕ 1 , . . . , ϕ d-1 ) ⊤ = S(ϕ 1 , . . . , ϕ d-1 ), R s (θ s ) ⊤ = R s (-θ s ), and d , . . . , 2(d -1)πι d . It can be easily checked that any pure state |ψ ∈ P(C d ) is written in the form |ψ = S(ϕ 1 , . . . , ϕ d-1 )R(θ 1 , . . . , θ d-1 )|0 (81) with ϕ 1 , . . . , ϕ d-1 ∈ [0, 2π) and θ 1 , . . . , θ d-1 ∈ [0, π/2]. Protocol 4 (Two-server QSPIR protocol for qudit states). For any message pure states |ψ 1 , . . . , |ψ f ∈ P(C d ), we choose the parameters ϕ 1 ℓ , . . . , ϕ d-1 ℓ and θ 1 ℓ , . . . , θ d-1 ℓ as |ψ ℓ = S(ϕ 1 ℓ , . . . , ϕ d-1 ℓ )R(θ 1 ℓ , . . . , θ d-1 ℓ )|0 . (82) When the user's target index K is k ∈ [f], i.e., the targeted state is |ψ k , our protocol is given as follows. 1) Query: The same as Protocol 2. 2) Entanglement Sharing: Server 1 and Server 2 share d copies of the maximally entangled state |I d ⟫. 3) Answer: Similar to Step 3 of Protocol 3 and as analyzed in (66) and (69), Server 1 and Server 2 can jointly generate the following quantum states and The servers generate and send these states to the user if it is requested in Step 4. The user performs the Bell measurement M XZ defined in (7) on A ′ ⊗ B ′ . If the measurement outcome is (0, α 1 ) for some α 1 , which happens with probability 1/d, the user obtains the outcome of the following conversions where → represents the state reduction by the measurement. Otherwise, the user repeats Step 4-a. b) Next, the user requests |R 2 (-θ 2 k )⟫ to the servers and performs the same measurement M XZ . If the measurement outcome is (0, α 2 ) for some α 2 , the user obtains the outcome of the following conversion: If it fails to measure (0, α 2 ), restarts from Step 4-a. Repeating the similar conversions with |R 3 (- c) The user performs Steps 4-a, 4-b with the states of (84) instead of (83). The user finally obtains d) Let X ⊗ X ′ be the system of two qudits on which the state (87) is. The user performs the basis measurement {|0 , . . . , |d -1 } on X ′ . If the measurement outcome is 0, the user applies Z -d-1 s=1 αs on X and then the resultant state on X is the targeted state |ψ k . This step is written as Otherwise, repeat from Step 4-a. Protocol 4 satisfies the correctness, secrecy, and communication complexity, desired in Theorem 5, which is shown as follows. Both Protocols 3 and 4 can be applied for QPIR of qubit states. However, the average communication complexity of Protocol 3, which is 8 qubits and 4 ebits, is less than that of Protocol 4 for d = 2, which is 16 qubits and 8 edits. The advantage of Protocol 3 comes from the commutation relation between the rotation operations R(θ) and Y = XZ = R(π/2). Since the reduced state after the Bell measurement is represented with Y, Z as (72) and Y is commutative with R(θ) for any θ, the user can reconstruct the targeted state efficiently as (73). On the other hand, the similar method cannot be applied for Protocol 4 because the rotation operations R(θ) for d > 2 are not commutative with any multiplication of X d and Z d . Thus, without using the commutative relation, Protocol 4 for d = 2 results in greater communication complexity."
    },
    {
      "heading": "VI. CONCLUSION",
      "text": "We have studied quantum private information retrieval for quantum messages in the blind and visible settings. We have proved that the trivial solution of downloading all messages is optimal for honest one-server QPIR, which is a similar result to the classical PIR but different from QPIR for classical messages. In the one-round case, the optimality is proved for both blind and visible settings, and in the multi-round case, it is proved for the blind setting. On the other hand, we have constructed efficient QPIR protocols with two cases. The first case is one-server QPIR with prior entanglement in the blind setting. We have constructed a reduction from any QPIR protocol for classical messages to a QPIR protocol for quantum messages and derived an efficient QPIR protocol from the protocol by Kerenidis et al. [14]. The second case is multi-server QSPIR in the visible setting. We have constructed three protocols for pure qubit states, pure qudit states, and pure states described by commutative unitaries. These protocols in the visible setting are symmetric QPIR protocols in which the user obtains no information other than the targeted message state. Thus, we proved that QSPIR is possible for quantum messages. Furthermore, these protocols are also more efficient than the QPIR's trivial solution when the number of messages are sufficiently greater than the dimension of quantum systems. There are many open problems related to the study of QPIR for quantum messages. Our optimality proof of the trivial one-server QPIR protocol is for the one-round visible setting and the multi-round blind setting. It is unknown whether the optimality still applies for the multi-round one-server visible setting and the multi-server blind setting. Also, we have only considered QPIR with information-theoretic security. Our result does not preclude the possibility of the non-trivial oneserver QPIR protocol with computational security. Furthermore, even if our QSPIR protocol for qudits is more efficient than the QPIR's trivial solution when the number of message states f is sufficiently large, the average communication complexity increases exponentially with the dimension d of the system. In addition, our QSPIR protocols are for pure states and it cannot be directly extended to protocols for the mixed state. Thus, more efficient QSPIR protocols for qudits and QSPIR for mixed states are also open problems. Interesting applications of our QSPIR protocols can also be considered for other communication and computation problems. We leave these questions for interested readers."
    }
  ]
}