{
  "paperid": "2205.14169v3",
  "title": "Phase-transition-like behavior in information retrieval of a quantum scrambled random circuit system",
  "authors": [
    "Zhuang",
    "Wu",
    "Duan",
    "Larkin",
    "Ovchinnikov",
    "Berry",
    "Maldacena",
    "Shenker",
    "Stanford",
    "Rozenbaum",
    "Ganeshan",
    "Galitski",
    "Roberts",
    "Yoshida",
    "Sekino",
    "Susskind",
    "Hayden",
    "Preskill",
    "Shenker",
    "Stanford",
    "Bañuls",
    "Yao",
    "Choi",
    "Lukin",
    "Cirac",
    "Swingle",
    "Zhang",
    "Pagano",
    "Hess",
    "Kyprianidis",
    "Becker",
    "Kaplan",
    "Gorshkov",
    "Gong",
    "Monroe",
    "Arute",
    "Arya",
    "Babbush",
    "Bacon",
    "Bardin",
    "Barends",
    "Biswas",
    "Boixo",
    "Brandao",
    "Buell",
    "Burkett",
    "Chen",
    "Chen",
    "Chiaro",
    "Collins",
    "Courtney",
    "Dunsworth",
    "Farhi",
    "Foxen",
    "Fowler",
    "Gidney",
    "Giustina",
    "Graff",
    "Guerin",
    "Habegger",
    "Harrigan",
    "Hartmann",
    "Ho",
    "Hoffmann",
    "Huang",
    "Humble",
    "Isakov",
    "Jeffrey",
    "Jiang",
    "Kafri",
    "Kechedzhi",
    "Kelly",
    "Klimov",
    "Knysh",
    "Korotkov",
    "Kostritsa",
    "Landhuis",
    "Lindmark",
    "Lucero",
    "Lyakh",
    "Mandrà",
    "Mcclean",
    "Mcewen",
    "Megrant",
    "Mi",
    "Michielsen",
    "Mohseni",
    "Mutus",
    "Naaman",
    "Neeley",
    "Neill",
    "Niu",
    "Ostby",
    "Petukhov",
    "Platt",
    "Quintana",
    "Rieffel",
    "Roushan",
    "Rubin",
    "Sank",
    "Satzinger",
    "Smelyanskiy",
    "Sung",
    "Trevithick",
    "Vainsencher",
    "Villalonga",
    "White",
    "Yao",
    "Yeh",
    "Zalcman",
    "Neven",
    "Martinis",
    "Gong",
    "Wang",
    "Zha",
    "Chen",
    "Huang",
    "Wu",
    "Zhu",
    "Zhao",
    "Li",
    "Guo",
    "Qian",
    "Ye",
    "Chen",
    "Ying",
    "Yu",
    "Fan",
    "Wu",
    "Su",
    "Deng",
    "Rong",
    "Zhang",
    "Cao",
    "Lin",
    "Xu",
    "Sun",
    "Guo",
    "Li",
    "Liang",
    "Bastidas",
    "Nemoto",
    "Munro",
    "Huo",
    "Lu",
    "Peng",
    "Zhu",
    "Pan",
    "Mi",
    "Roushan",
    "Quintana",
    "Mandra",
    "Marshall",
    "Neill",
    "Arute",
    "Arya",
    "Atalaya",
    "Babbush",
    "Bardin",
    "Barends",
    "Bengtsson",
    "Boixo",
    "Bourassa",
    "Broughton",
    "Buckley",
    "Buell",
    "Burkett",
    "Bushnell",
    "Chen",
    "Chiaro",
    "Collins",
    "Courtney",
    "Demura",
    "Derk",
    "Dunsworth",
    "Eppens",
    "Erickson",
    "Farhi",
    "Fowler",
    "Foxen",
    "Gidney",
    "Giustina",
    "Gross",
    "Harrigan",
    "Harrington",
    "Hilton",
    "Ho",
    "Hong",
    "Huang",
    "Huggins",
    "Ioffe",
    "Isakov",
    "Jeffrey",
    "Jiang",
    "Jones",
    "Kafri",
    "Kelly",
    "Kim",
    "Kitaev",
    "Klimov",
    "Korotkov",
    "Kostritsa",
    "Landhuis",
    "Laptev",
    "Lucero",
    "Martin",
    "Mcclean",
    "Mc-Court",
    "Mcewen",
    "Megrant",
    "Miao",
    "Mohseni",
    "Mruczkiewicz",
    "Mutus",
    "Naaman",
    "Neeley",
    "Newman",
    "Niu",
    "O'brien",
    "Opremcak",
    "Ostby",
    "Pato",
    "Petukhov",
    "Redd",
    "Rubin",
    "Sank",
    "Satzinger",
    "Shvarts",
    "Strain",
    "Szalay",
    "Trevithick",
    "Villalonga",
    "White",
    "Yao",
    "Yeh",
    "Zalcman",
    "Neven",
    "Aleiner",
    "Kechedzhi",
    "Smelyanskiy",
    "Chen",
    "Landsman",
    "Figgatt",
    "Schuster",
    "Linke",
    "Yoshida",
    "Yao",
    "Monroe",
    "Li",
    "Fan",
    "Wang",
    "Ye",
    "Zeng",
    "Zhai",
    "Peng",
    "Du",
    "Gärttner",
    "Bohnet",
    "Safavi-Naini",
    "Wall",
    "Bollinger",
    "Rey",
    "Meier",
    "Ang'ong'a",
    "An",
    "Gadway",
    "Wei",
    "Ramanathan",
    "Cappellaro",
    "Eisert",
    "Friesdorf",
    "Gogolin",
    "Hosur",
    "Qi",
    "Roberts",
    "Yoshida",
    "Shen",
    "Zhang",
    "You",
    "Zhai",
    "Wu",
    "Duan",
    "Deng",
    "Garcia",
    "Bu",
    "Jaffe",
    "Yao",
    "Grusdt",
    "Swingle",
    "Lukin",
    "Stamper-Kurn",
    "Moore",
    "Demler",
    "Huang",
    "Zhang",
    "Chen",
    "Keyserlingk",
    "Rakovszky",
    "Pollmann",
    "Sondhi",
    "Page",
    "Couch",
    "Eccles",
    "Nguyen",
    "Swingle",
    "Xu",
    "Iyoda",
    "Sagawa",
    "Holevo",
    "Touil",
    "Deffner",
    "Yoshida",
    "Yao",
    "Qi",
    "Shangnan",
    "Yang",
    "Bao",
    "Ooguri",
    "Bao",
    "Harper",
    "Remmen",
    "Bertini",
    "Piroli",
    "Aaronson",
    "Gottesman",
    "Fattal",
    "Cubitt",
    "Yamamoto",
    "Bravyi",
    "Chuang",
    "Nahum",
    "Ruhman",
    "Vijay",
    "Haah",
    "Hunter-Jones",
    "Schumacher",
    "Nielsen",
    "Lloyd",
    "Devetak",
    "Winter",
    "Holevo",
    "Giovannetti",
    "Aharonov",
    "Ben-Or",
    "Kitaev",
    "Knill",
    "Laflamme",
    "Nebe",
    "Rains",
    "Sloane"
  ],
  "year": 2022,
  "abstract": "Information in a chaotic quantum system will scramble across the system, preventing any local measurement from reconstructing it. The scrambling dynamics is key to understanding a wide range of quantum manybody systems. Here we use Holevo information to quantify the scrambling dynamics, which shows a phasetransition-like behavior. When applying long random Clifford circuits to a large system, no information can be recovered from a subsystem of less than half the system size. When exceeding half the system size, the amount of stored information grows by two bits of classical information per qubit until saturation through another sharp unanalytical change. We also study critical behavior near the transition points. Finally, we use coherent information to quantify the scrambling of quantum information in the system, which shows similar phase-transition-like behavior.",
  "sections": [
    {
      "heading": "I. INTRODUCTION",
      "text": "Chaotic quantum systems [1][2][3][4][5] spread initially localized information over an entire system after isolated evolution [6][7][8]. Such a process is called quantum information scrambling [9,10] and lies at the heart of quantum many-body system dynamics. With the recent development of exquisite control over multi-qubit quantum information processing systems [11][12][13], the initial information encoded in a local subsystem, which will be hidden into the whole system by quantum dynamics, can now be retrieved experimentally by global operations [14][15][16][17][18][19]. This ability can provide new insights into various fields, including quantum chaos and quantum thermalization [3,20,21], black hole physics [7,8], and quantum machine learning [22][23][24]. There are various methods to quantify quantum information scrambling. One approach is to probe the spreading of an initially localized operator, as computed by the out-of-timeordered correlator (OTOC) [5,10,21,25,26]. It is central to the study of quantum chaos and quantum thermalization dynamics, for its decay rate resembles the classical Lyapunov exponent in the semi-classical limit [4]. Also it shows the light cone structure of information propagation following the geometry of the system [10,21,27]. Another possibility is to probe the scrambling dynamics by the correlation between subsystems, e.g. the entanglement entropy [28], mutual information [29], and tripartite information [30]. However, these quantities do not directly describe the amount of information that can be extracted from a subsystem and thus may not be sufficient to describe the dynamics of information flow. To study the scrambling dynamics of quantum systems directly from the quantum information perspective, we consider Holevo information, which, by definition, describes the information encoded in an ensemble of quantum states [31]. Since the Holevo information is preserved under unitary evolution, it can distinguish between the ideal case and the decoherence and thus allows us to verify information scrambling in noisy quantum systems [15,32,33]. Based on Holevo information,"
    },
    {
      "heading": "Information Scrambling",
      "text": "N qubits H bits n qubits t-layer brickwall random circuit FIG. 1. Quantum channel scenery for probing information scrambling dynamics. One encodes H-bits of information into H arbitrarily chosen qubits of an N -qubit system. Then after t layers of \"brick wall\"-structured random circuits, we retrieve information from a randomly selected n-qubit subsystem. Every \"brick\" (blue rectangle) represents a random unitary gate between two adjacent qubits. progress has been made in understanding the distinguishability of black hole microstates in black hole theory [34][35][36]. However, these works only focus on the final states of the black holes after fast scrambling, while the dynamics toward scrambling is not considered. Another related method is to apply an operator-state mapping and study the mutual information [21,32,37] or the tripartite information [21] between the input system and the output system. Here, we consider the Hovelo information under random unitary circuits in a qubit system and show phase-transitionlike behavior in the retrieved information. For long enough circuits, as the size of the subsystem increases across a threshold of one half, the retrieved information increases nonanalytically from zero to finite values, and further increases until saturation at another transition point. This phenomenon is observed from numerical simulation, and is also confirmed by analytical derivation. We examine the scrambling dynamics through the convergence of the average Holevo information toward its infinite-time limit as the circuit depth grows. We also study the critical behavior near the phase transition points. As the Hovelo information only measures the re-trieved classical information from a quantum system, finally we use coherent information to quantify scrambling of quantum information in the same system and find similar phasetransition-like behavior for the coherent information."
    },
    {
      "heading": "II. INFORMATION SCRAMBLING IN RANDOM QUANTUM CIRCUITS",
      "text": "Consider an N -qubit quantum system. As shown in Fig. 1, we store H bits of classical information by randomly selecting a subsystem of H qubits and preparing them into an ensemble of pure states p i , |ψ init i with p i = 1 2 H and |ψ init i be the 2 H orthogonal states in computational basis. The system then evolves under a randomly generated Clifford circuit U , after which one part of it E is regarded as the environment and traced out. For the remaining system Q containing n qubits, we can denote the amount of classical information that can be retrieved as χ Q , which is given by the Holevo information where is the output density matrix of the system Q, and S is the von Neumann entropy. We adopt the periodic boundary condition for the qubits and consider random circuits of the \"brick wall\" configuration, as shown in Fig. 1. The circuit comprises t layers of alternatingly layered bricks in which each brick represents a uniformly sampled two-qubit random Clifford gate. We denote U t as the set of all possible unitaries constructed in this way with t layers. Note that we choose the Clifford circuit mainly because of the convenience in numerical simulation [38,39]. Also, we specify the set of input quantum states where Q H is a randomly selected subsystem with H qubits. We can thus write the Holevo information as Note that the choices of Q and Q H are arbitrary and does not need to have any specific spatial pattern. After obtaining the Holevo information contained in a randomly selected subsystem from the above setting, we further average over all possible subsystem Q, all possible input states, and all the circuits with the same depth t to get where S k denotes the set of all subsystems with k qubits. As shown in Fig. 2, we numerically compute the long time limit of the Holevo information χ∞ n = lim t→∞ χt n by setting t = 3N . Theoretically, Ω(N ) layers are needed for the initially localized information to propagate over the whole system [7,40,41], and here, we verify the convergence of Holevo information by comparing the results at t = 3N with those at t = 4N . A phase-transition-like behavior can be observed: For small system size n, we are not able to retrieve any information; When n reaches half of the system size, information starts emerging at a constant rate of two bits of classical information per qubit; Finally, the retrievable information"
    },
    {
      "heading": "FIG. 2. Average Holevo information χ∞",
      "text": "n of an n-qubit subsystem Q in the steady state. For the later convenience to examine the behavior near the phase transition point, we choose N to be multiples of 19. For different N we fix its ratio with the encoded classical information as N : H = 19 : 8. The curve becomes sharper around the two phase transition points as N increases. Note that the behavior is similar for generic 1 ≤ H ≤ N . The inset shows the result of finite-size scaling. We focus on the difference ∆ between χ∞ n and the thermodynamic limit χ thermal n when n is chosen to be close to the phase transition point n N = 1 2 (circle) and n N = H+N 2N (cross). Specifically, for n smaller than N 2 we calculate ∆1 = χ∞ n , and for n larger than we calculate ∆2 = H -χ∞ n . The blue, red, and green lines are for three different ratios of N : H = 17 : 6, 19 : 8, 21 : 10, respectively. When n, N, H increase under a fixed ratio, ∆1 and ∆2 decay exponentially. For each data point, we sample 10 6 times. The long-time limit is approximated by choosing t = 3N as described in the main text. reaches its maximum value through another sharp nonanalytical change, indicating that all of the initially encoded information can be reliably recovered. We perform finite-size scaling near the two points to further analyze the phase-transition-like behavior. As shown in the inset of Fig. 2, by fixing a ratio at n N < 1 2 and n N > H+N 2N , respectively, and increasing n, N, H simultaneously, χ∞ n converges exponentially towards its thermodynamic limit. Note that one can get the same value of χ∞ n without averaging over the choice of Q H . This can be understood from the definition of scrambling and from the symmetry of the random unitary group [28]. Indeed, if the circuit is sampled uniformly over the Nqubit Clifford group, we can calculate theoretically the average Holevo information χ∞ n for arbitrary n, N, H, and it agrees well with the numerical result obtained above for layered random two-qubit Clifford gates. For more details, see Appendix A. Specifically, if we take the thermodynamic limit n, N, H → ∞ with the ratio n N ≡ r n , H N ≡ r H held constant, this theoretical value χ∞ n converges to This further allows us to define the critical exponent where for the first transition point and similarly for the second transition point."
    },
    {
      "heading": "III. INFORMATION SCRAMBLING DYNAMICS",
      "text": "From the evolution of the Holevo information, we can study the information scrambling dynamics of quantum systems. For example, here we study how the long-time limit of the average Holevo information is approached. We compare the average Holevo information for different subsystem sizes { χt n } N n=1 with its long-time limit. We use 2-norm to measure their difference From the numerical simulation, we plot D(t) for the system size N = 40 and H ranging from 1 to N , as shown in Fig. 3a. We observe that { χt n } N n=1 converges under time evolution roughly exponentially. Further, the decaying rate, which corresponds to the scrambling speed, varies for different initial Holevo information H. To compare the speed of scrambling between 1 ≤ H ≤ N , we extract the average slope on the semi-log plot of D(t) between time t and t as as shown in Fig. 3b. The upper and lower confidence bounds are roughly estimated by the maximum and minimum slope in the region. For the same set of circuits, the scrambling rate slows down when an increasing amount of information is encoded into the system until close to H N ∼ 1 where the tendency reverses, which may be caused by the finite size effect. We further study the information scrambling behavior of individual realizations U of random circuits by comparing the Holevo information distribution χ Q,Q H (U ) with the average value over different realizations. We characterize it by the standard deviation As shown in Fig. 3c, we numerically compute its long time limit σ ∞ n = lim t→∞ σ t n by setting t = 3N . The ratio N : H = 19 : 8 is set in accordance with Fig. 2. As we can see, σ ∞ n is asymptotically zero not only in the region n N < 1 2 and n N > N +H 2N , where χ∞ n already saturates, but also in the region 1  2 < n N < N +H 2N . This suggests that information almost fully scrambles even for a single typical random circuit. Only at the two phase transition points can we get finite standard deviations, which do not increase with N , H and n so the relative fluctuation is decreasing for larger systems."
    },
    {
      "heading": "IV. SIMILAR PHASE-TRANSITION-LIKE BEHAVIOR FOR COHERENT INFORMATION",
      "text": "After studying the information scrambling dynamics by the classical information, a natural next step is to consider if the same scrambling dynamics can be probed by quantum information as well, particularly if the same phase-transition-like behavior persists. Coherent information [42][43][44] quantifies the remaining quantum information after a state goes through a quantum channel, with similar properties as the mutual information in classical communication. The coherent information is also related to the reversibility of the quantum channel [45] and the condition of quantum error correction [42], thus lies at the heart of understanding the difference between classical and quantum information communication. As shown in the inset of Fig. 4, similar to the model for Holevo information, we encode quantum information of C in N qubits with periodic boundary conditions, apply random Clifford circuit U ∈ U t and regard a randomly selected subsystem E as the environment to be traced off. The difference is that the system's initial state Q init would be an ensemble where Q C represents a subsystem of randomly selected C qubits. This ensemble can be seen as a mixture of |ψ init i with equal probabilities. We write the final state of the n-qubit system Q as ρ Q . The circuit, together with tracing out the environment E, forms a quantum channel C. The coherent information can thus be calculated as [42][43][44] where S(ρ, C) is the entropy exchange. By definition, to calculate S(ρ, C), we need to purify Q init using a reference system R init before applying the quantum channel. Then we get S(ρ, C) = S(ρ QR ). Similar to what we have done for Holevo information, we write η Q (ρ init , C) ≡ η Q,Q H (C) and average over the system Q, the input states and the circuit to get Finally, the long-time limit η∞ n is approximated by t = 3N . The results for various system sizes are shown in Fig. 4 which has a phase-transition-like behavior similar to that of the Holevo information, although the phase transition points are at n N = N -C 2N , n N = N +C 2N . To see how these transition points correspond to those for the Holevo information, note that the second transition point n N = N +C 2N is the same for both cases. On the other hand, when n N < N -C 2N , all the information goes into the environment, making the coherent information saturate to its lower bound , respectively. The inset shows an illustration of the numerical scheme. The initial state, encoded as an ensemble into Q init , is purified by R init . After a random circuit U ∈ Ut, part of the system E is traced out as the environment. Together they form a quantum channel C. The coherent information encoded in the system Q can thus be computed with the help of the reference system R. transition point at n N = N -C 2N thus corresponds to that of the Holevo information in the environment E rather than in the system Q. Finally, when n < N 2 we have negative η∞ n , indicating that no quantum information can be retrieved from the output system. This is in agreement with the result for Holevo information."
    },
    {
      "heading": "V. DISCUSSIONS",
      "text": "In summary, in this work we use the spatial distribution of Holevo information to characterize the information scrambling process. The information converges to zero in the thermodynamic limit when we consider subsystem sizes smaller than half the system. When exceeding this threshold, the extractable classical information increases by two bit per added qubit until its saturation to the total encoded information. This can serve as a scrambling criterion, and its comparison with others, including Haar scrambled [7] and Page scrambled [6] criteria, is of great interest. We study how the system approaches the long-time limit and how the convergence speed varies with the amount of encoded information. We also find that variation around the average behavior is vanishingly small almost everywhere apart from the two phase transition points, which implies that in the thermodynamic limit, almost all random circuits would meet the scrambling criteria. Finally, we find that the coherent information possesses a similar phasetransition-like behavior. One can regard the discarded environment in our model as the qubit loss error from the quantum error correction (QEC) perspective [46,47]. Thus the phase transition point n N = N +C 2N of coherent information would correspond to the condition of perfect decoding. Specifically, our model uses the random circuit to encode C logical qubits in N physical qubits. This code can tolerate the loss of N -C 2 located qubits which saturates the quantum Singleton bound [48]. Although here we restrict the calculation to Clifford gates for numerical convenience, this method using Holevo information to characterize information scrambling should largely be applicable to generic quantum systems. Specifically, this process of encoding information by a set of initial states and calculating the Holevo information of a selected subsystem in the final states does not require any special property of the intermediate quantum dynamics. We can thus easily extend the unitary evolution to arbitrary quantum channels, although the detailed late time physics may depend on specific models and remains an open direction for future research. Therefore it may provide a universal tool for probing quantum information scrambling dynamics."
    },
    {
      "heading": "Outline of the Proof",
      "text": "Any state ρ h that satisfies S(ρ h ) = x can be transformed by a local Clifford unitary U ∈ G = {U (n) ⊗ U (m)} to ρ x h which we write under the stabilizer formalism [38,39] where n + m = N , x = n -l 1 and the number of stabilizer operators We can constraint the four parameters by We can further simplify our question by This can be given by directly using the common state Eq. A2 that all the states with the same entropy can reach by local unitaries. Based on basic combinatorics, we have from Sec. A. 3 where When n, h, N is fixed, the order of the orbit can be determined by the four parameters Recall that x = n -l 1 , we have where the sum is over all possible k 1 , k 2 , l 1 , l 2 under the constraint Eq. (A4). By setting h = 0 and h = H, this gives both the terms in Eq. (A1). For specific values of n, H, N , the calculation agrees well with our numerical result in the main text, as shown in Fig. 5 To further prove Eq. (3) in the main text, we first observe that t k1,k2,l1,l2 is varying in an exponential way for different k 1 , k 2 , l 1 , l 2 . When n, N, H is large, the expected value of n -l 1 would correspond to k 1 , k 2 , l 1 , l 2 where t k1,k2,l1,l2 reaches maximum. Assuming k 1 , k 2 , l 1 , l 2 → ∞ and ignoring constant terms, we can convert the question of where log 2 t k1,k2,l1,l2 reaches maximum to be where f (k 1 , k 2 , l 1 , l 2 ) reaches maximum, here Combining with the constraints in Eq. (A3) and Eq. (A4), the proof is given in Sec. A. 4 By Eq. (A9) we get Finally the Holevo information We count the number of elements in G that makes ρ x h invariant. Every non-trivial elements in the G = {U (n) ⊗ U (m)} maps the set of stabilizer operators in Eq. A2 to a new one. We count how many of the resulting stabilizer operators form a equivalent state to the original. Two sets of stabilizers are equivalent if they are the same under standard stabilizer multiplication operations. Below we split Eq. (A7) into factors and explain them respectively. • k1 j=1 4 j -1 4 j 2 2 2k1(k2+l1) 2 2k1l2 . For the first 2k 1 stabilizers, the two in each pair do not commute with each other in two subsystems. This property would preserve for arbitrary local transformation. • 2 k2 2 2k2 2 1 2 k2(k2+2l1+1) 2 1 2 k2(k2+2l2+1) 4 h1k2 4 h2k2 k2-1 j=0 2 k2 -2 j 2 l1k2 2 l2k2 . For the next k 2 stabilizers, the combination of arbitrary elements in l 1 + l 2 stabilizers are reachable by G. • 2 l1+ 1 2 l1(l1+1) l1-1 j=0 2 l1 -2 j 4 h1l1 . The local unitaries in G can only bring l 1 stabilizers which is local in Q to another local stabilizer in Q. • 2 l2+ 1 2 l2(l2+1) l2-1 j=0 2 l2 -2 j 4 h2l2 . The same as l 1 • Cl(h 1 ). After determining all the stabilizers above, there still exists h 1 degrees of freedom in Q. This corresponds to Cl(h 1 ) elements. • Cl(h 2 ). The same as h 1 . 4. Proof of Eq. (A10) ) is a concave function for k 1 , k 2 , l 1 . This can be seen from its Hessian matrix   -8 -4 -6 -4 -7 -3 -6 -3 -6   At Eq. (A10), we only need to prove that f achieves its local maximum to prove that it also achieves global maximum over the convex region defined in Eq. (A4). Further, we observe that the condition in Eq. (A10) coincides with the boundaries of the region. To verify them as local maximum, we can compare the gradient ∇f =   with the orientation of boundaries g i ≤ 0. Specifically, we solve and verify µ i ≥ 0 ∀i. When n < N -h 2 , the constraints are . Solving Eq. (A13) we get"
    }
  ]
}