{
  "paperid": "2303.12456v4",
  "title": "Teleportation of Post-Selected Quantum States",
  "authors": [
    "Collins",
    "Bennett",
    "Brassard",
    "Crepeau",
    "Jozsa",
    "Peres",
    "Wootters",
    "Boschi",
    "Branca",
    "De Martini",
    "Hardy",
    "Popescu",
    "Bouwmeester",
    "Pan",
    "Mattle",
    "Eibl",
    "Wein-Furter",
    "Zeilinger",
    "Pirandola",
    "Eisert",
    "Weedbrook",
    "Furusawa",
    "Braunstein",
    "Aharonov",
    "Bergmann",
    "Lebowitz",
    "Aharonov",
    "Popescu",
    "Tollaksen",
    "Vaidman",
    "Brunner",
    "Acin",
    "Collins",
    "Gisin",
    "Scarani",
    "Hong",
    "Mandel",
    "Aharanov",
    "Albert",
    "Vaidman",
    "Vaidman",
    "Hosten",
    "Kwiat",
    "Dixon",
    "Starling",
    "Jordan",
    "Howell",
    "Silva",
    "Guryanova",
    "Short",
    "Skrzypczyk",
    "Brunner",
    "Popescu",
    "Aharonov",
    "Colombo",
    "Popescu",
    "Sabadini",
    "Struppa",
    "Tollaksen",
    "Aharonov",
    "Popescu",
    "Rohrlich",
    "Skrzypczyk",
    "Vaidman",
    "Nevo",
    "Lloyd",
    "Maccone",
    "Garcia-Patron",
    "Giovannetti",
    "Shikano",
    "Ishizaka",
    "Hiroshima",
    "Ishizaka",
    "Hiroshima",
    "Beigi",
    "Koenig",
    "Buhrman",
    "Czekaj",
    "Grudka",
    "Horodecki",
    "Horodecki",
    "Markiewicz",
    "Speelman",
    "Strelchuk",
    "Pirandola",
    "Laurenza",
    "Lupo",
    "Wang",
    "Braunstein",
    "Studzinski",
    "Strelchuk",
    "Mozrzymas",
    "Horodecki",
    "Mozrzymas",
    "Studzinski",
    "Strelchuk",
    "Horodecki",
    "Mozrzymas",
    "Studzinski",
    "Horodecki",
    "Christandl",
    "Leditzky",
    "Majenz",
    "Smith",
    "Speelman",
    "Walter",
    "Kopszak",
    "Mozrzymas",
    "Studzinski",
    "Horodecki",
    "Studzinski",
    "Mozrzymas",
    "Kopszak",
    "Horodecki",
    "Mozrzymas",
    "Studziński",
    "Kopszak",
    "Landau",
    "Peierls",
    "Henrik",
    "Bohr",
    "Rosenfeld",
    "Aharonov",
    "Albert",
    "Aharonov",
    "Albert",
    "Aharonov",
    "Albert",
    "Aharonov",
    "Albert",
    "Aharonov",
    "Albert",
    "Vaidman",
    "Popescu",
    "Vaidman",
    "Groisman",
    "Vaidman",
    "Groisman",
    "Reznik",
    "Vaidman",
    "S R Clark",
    "Connor",
    "Jaksch",
    "Popescu",
    "Gonzales",
    "Chitambar",
    "Silva",
    "Guryanova",
    "Brunner",
    "Linden",
    "Short",
    "Popescu",
    "Sedlak",
    "Bisio",
    "Ziman",
    "Vaidman"
  ],
  "year": 2024,
  "abstract": "Teleportation allows Alice to send a pre-prepared quantum state to Bob using only pre-shared entanglement and classical communication. Here we show that it is possible to teleport a state which is also post-selected. Post-selection of a state Φ means that after Alice has finished her experiment she performs a measurement and only keeps runs of the experiment where the measurement outcome is Φ. We also demonstrate pre and postselected port-based teleportation, and use it as a quantum memory for such states. Finally we use these protocols to perform instantaneous non-local quantum computation on pre and post-selected systems, and significantly reduce the entanglement required to instantaneously measure an arbitrary non-local variable of spatially separated pre and post-selected systems.",
  "sections": [
    {
      "heading": "Introduction",
      "text": "Learn to see things backwards, inside out, and upside down The Tao of Leadership John Heider Teleportation is one of the most surprising and fundamental protocols of quantum mechanics. In classical mechanics Alice can send a state to Bob without having any prior knowledge of it by measuring it as accurately as desired, sending the measurement results in a classical message to Bob, and having Bob recreate the state. However in quantum mechanics the uncertainty relation limits the accuracy to which one can simultaneously measure all components of the state. Thus it appears as if the only way to transfer the state from Alice to Bob is by transferring a particle explicitly carrying the state, e.g. by a fibre optic cable which sends polarized photons from Alice to Bob, and which maintains coherence between different polarizations for each photon. To great surprise it was shown by Bennett et al. [1] that a state can be faithfully transferred from Alice to Bob without transferring any quantum particles, by using pre-shared entanglement, local measurements, classical communication and local unitary operations. This has been experimentally performed many times starting with [2,3] (see [4] for a review). Teleportation is now used as a fundamental building block for many tasks in quantum information and computation. Usually when we talk about states in quantum mechanics we are thinking of states which are prepared in advance, i.e. pre-selected. However Aharonov et al. [5,6] showed that quantum mechanics also allows a post-selection of the state, which behaves quite differently to any postselection in classical mechanics. Post-selection means that we run an experiment on a system which ends with some sort of measurement, and only look at runs of the experiment where the measurement gives a particular outcome. This post-selection is quite natural, e.g. we send photons through some optical circuit and only keep results where one of the final detectors receives a photon, we may select one polarization more than another through Polarization Dependent Loss [7]. However it gives us information about the system at intermediate times which is impossible with pre-selection alone. For example if we pre-select a particle with a well defined position and postselect it with a well defined momentum we will be able to predict the outcome of a position or momentum measurement of the particle at intermediate times with arbitrary accuracy, i.e. better than the uncertainly principle allows for preselected states. This is quite different to deterministic classical mechanics, where all the information about a system can be pre-selected, and a post-selection is equivalent to a pre-selection. Having post-selected on a particular state, we can then evolve this final state backwards in time, and use it to retrodict the outcomes of measurements at earlier times. We don't have to do this: we can make the same predictions using the usual pre-selected states, evolving the system forwards in time and conditioning on the final measurement. However we find this time reversed method of thinking useful, and believe it allows us to more easily find interesting physics. Post-Selection is a key part of the single photon source used for many quantum optic experiments [8], internally creating a pair of photons via spontaneous parametric down-conversion, then postselecting on one photon from the pair being detected, leaving the other as a single photon. Combined with weak measurements [9], post-selected states led to a method for improving the precision of certain measuring devices [10] which was used in the first observation of the spin Hall effect of light [11], and to measure the linear travel of a piezoelectric actuator down to the diameter of a Uranium nucleus [12]. Process matrices are equivalent to certain quantum systems between definite pre and post-selected states [13]. Postselected states are also used for the intuition behind several curious paradoxical effects, e.g. the quantum pigeonhole principle [14] and the quantum cheshire cat [15]. In this paper we describe teleportation of a post-selected state. It was previously known [16] that this could be accomplished for a 2 dimensional system with probability 1/4. However like the original teleportation, we shall show that this can be done with certainty. We then extend this to pre and post-selected states. This is a fundamental protocol, which can then be used as a building block for more complex tasks. We also extend port-based teleportation to pre and post-selected states, show how this can be used as a quantum memory for such states, and discuss instantaneous measurements and computation of pre and post-selected states. Note that if teleportation was a unitary operation, we could reverse the unitary to teleport the post-selected state backwards in time. However since teleportation involves measurements and classical communication which cannot be sent backwards in time we cannot simply time-reverse the usual teleportation. Also note that a paper with a related title, \"Quantum mechanics of time travel through postselected teleportation\" [17], creates a loop in time by post-selecting on one particular outcome of the regular (pre-selected) teleportation protocol, so that the current (pre-selected) state of a particle was sent into its past. Here we teleport a postselected state to a different location. Port-Based Teleportation, introduced by Ishizaka and Hiroshima [18,19], is one of the most useful and surprising variants of teleportation. In normal teleportation Bob initially receives Alice's state scrambled by a unitary σ i , and has to wait for Alice's classical message i before he can unscramble it. This means that he cannot use Alice's state in any further experiments (measurements, computations, etc) without waiting for that message (except for the rare cases where his experiment commutes with σ i ). Port-Based teleportation instead uses n entangled pairs (ports) between Alice and Bob, and teleports Alice's state unscrambled into Bob's i th port, where i is known to Alice. Bob can run his further experiments without waiting for Alice so long as he does it n times: once on each port. Then when he receives Alice's message he can classically select which set of experimental results to keep. Port-Based Teleportation has proved useful for a variety of tasks, for example it was used to make a universal programmable quantum processor [18], for instantaneous non-local quantum computation, instantaneous non-local measurements and new attacks on position-based cryptography [20], for proving any communication complexity problem with a large quantum advantage gives rise to a Bell Inequality [21], and for limitations on quantum channel discrimination [22]. It can be done either deterministically as described above, where the state is always teleported but with some error, or probabilistically where the state is either teleported perfectly or the teleportation fails with an error message. [19]. The choice of shared entangled state used for the teleportation and the measurement have been optimized in [23,24,25,26,27]. A multiport variation allowing teleportation of many states simultaneously into different ports was introduced in [28,29,30]. We show how to port-based teleport a pre and post-selected state. This can be done either deterministically or probabilistically. We show how to use this as a quantum memory for the state. We then show how to perform instantaneous non-local computation of pre and post-selected systems. Instantaneous means that we perform the quantum parts of the experiments simultaneously at spatially separated locations, and then use classical communication to select the final results. Finally, we demonstrate one use of this to significantly reduce the amount of entanglement required to show that any verification measurement of spatially separated pre and post-selected systems may be performed instantaneously. A verification measurement is one which gives the same results as a normal measurement, only it may leave the system in any output state, potentially destroying it completely. Whether an arbitrary non-local variable of pre-selected spatially separated systems is measurable has been debated since Landau and Peierls [31] in 1931, and is important in demonstrating in a direct fashion that an entangled state is a good description of a spatially separated system in a given relativistic frame at a given time. After significant progress in [32,33,34,35,36,37,38,39,40], Vaidman [41] showed that any non-local verification measurement can be performed instantaneously on an arbitrary preselected state. The procedure used enormous amounts of entanglement, which was significantly reduced in [42,20,43]. It was extended to pre and post-selected systems in [16], which we improve upon here."
    },
    {
      "heading": "Pre and Post-Selected Teleportation",
      "text": "Time Bell Measurement Ψ⟩ A B a Φ + ⟩ Classical Measurement Result i Ψ⟩ Bob applies unitary σ i to system B Alice Bob B Figure 1: Teleportation of a pre-selected state |Ψ⟩ from A to B. Vertical arrows indicate the flow of the state. First we review how to teleport a pre-selected state, shown diagrammatically in Fig 1. For simplicity we start with a qubit which has been pre-prepared in an unknown pure state, say where α and β are complex and |α| 2 + |β| 2 = 1. Alice and Bob also pre-share a maximally entangled state The joint state |Ψ⟩ A Φ + aB can be written as which can also be written as where i ∈ {0, 1, 2, 3}, and σ i is a unitary operation which flips |0⟩ and |1⟩ if i ∈ {2, 3} and applies a phase of -1 to To teleport Alice measures the joint system Aa in the Bell Basis σ a i Φ + Aa and sends the measurement outcome i to Bob via 2 bits of classical communication. Bob then applies σ i to his system B to recreate Alice's original state |Ψ⟩ in system B. He can then perform whatever experiment on the state he desires, and will get the same outcomes as if he started with |Ψ⟩ B . A procedure to teleport a post-selected state ⟨Φ| should work as follows. Alice starts with a post-selected state. What that means is that she starts with a system in the totally uncertain pre-selected density matrix 1/d where d is the dimension of the system. Next she does the teleportation. Finally she does the post-selection by performing a measurement which with some probability has outcome Φ, and Alice and Bob only keep the experimental results for runs with that outcome. Bob will also have a system which starts in the pre-prepared density matrix 1/d. He wants to be able to run experiments on his system and know that so long as the post-selection succeeds, his system will behave with the same post-selection as if he had applied it directly himself. Further, the probability of the post-selection succeeding is the same as if he applied it himself. This is what we mean by the teleportation succeeding with certainty. To do this may at first appear impossible, since if Bob performs the Bell measurement from the usual teleportation on a joint system bB he has no opportunity to apply σ i on B to correct for any outcome other than Φ + . Our main result is a protocol to teleport with certainty, as shown in Fig 2. Similar to the usual teleportation of preselected states, Alice and Bob pre-share the maximally entangled state Φ + Ab . Bob has another system B which will end up in the post-selected state. This time Bob performs the Bell Measurement, which he does on on the joint system bB after he's finished his experiments on B. He then sends the classical measurement result to Alice, who performs the correction σ i on her system A. Finally Alice applies the post-selection. This procedure guarantees that B was in the post-selected state ⟨Φ| prior to the Bell Measurement. In the usual teleportation one can think of the movement of the state as starting with Alice, going forward in time in system A until the Bell Measurement, then going backward in time (scrambled by σ i ) in system a until getting to the entangled state, then going forward in time in B until σ i is applied after which the state is successfully teleported. In the teleportation of a postselected state one can think of the state starting with Alice, going backwards in time in system A with σ i applied, then backwards further until the entangled state, then forwards in time in system b until the Bell Measurement which undoes σ i , and finally backwards in time in system B as the successfully teleported state. The teleportation actions in the two procedures are the same if we swap the roles of Alice and Bob, and hence the equations of the postselected teleportation work in the same way as the pre-selected teleportation. One way to check this mathematically starts by noting that the Bell Measurement with outcome i is a projection onto the state bB Φ + σ b i which occurs with probability Working backwards in time, the post-selected teleportation does: as desired. In the second line the Bell measurement acts as the preparation of a post-selected state. This procedure is optimal in its usage of entanglement and classical communication, as proved in Appendix A. The extension to higher dimensions is straightforward and follows the method in [1]. Entanglement swapping and teleportation of mixed states work as usual. Teleporting a pre and post-selected state from A to B is essentially a matter of combining the previous two protocols, as shown in Fig 3 . \nThe only minor change is that here we used Swap(A, ã) to move the entangled state Φ + ãb into Ab for the post-selected teleportation. This teleportation works for entangled pre and post-selected states, e.g. , and for mixed pre and post-selected states [44]. It straightforwardly generalizes to higher dimensions."
    },
    {
      "heading": "Port-Based Teleportation",
      "text": "Here we show how to port-based teleport a postselected state, and then a pre and post-selected state. We then use this as a quantum memory for such states. We start by reviewing port-based teleportation of a pre-selected state, as shown in Fig 4. Alice and Bob pre-share n entangled states Φ + a i B i , with i = 1..n. Alice performs a POVM on the joint system Aa 1 ..a n . The outcome i tells her that |Ψ⟩ A has been teleported into |Ψ⟩ B i . There are two main variations of the port-based teleportation. In the deterministic version, the teleported state is unmodified, except for some noise which can be made arbitrarily small with sufficiently large n. In the probabilistic version, the teleportation either succeeds perfectly or with an arbitrarily small probability Alice's POVM gives a failure outcome, 0. Unlike usual teleportation there are several POVMs and initial entangled states which could be used, and the most efficient procedures do not use the maximally entangled state. However schematically the procedure is always the same. In all cases Bob can perform his further experiments, n times in parallel, without waiting for Alice to perform the quantum part of the teleportation. After the quantum part is finished Alice can send i as a classical message to Bob to tell him which of his results to keep. This will take some time as it's limited by the speed of light. In the post-selected teleportation described in section 2, Bob performs his experiments at the start, but Alice cannot apply the post selection without waiting for Bob's classical message. Suppose the system A will be post-selected into A ⟨Φ|. Alice and Bob have a pre-shared entangled state Φ + Ab . Bob has systems B i where i = 1..n (the n ports), and in each of them runs his experiment. He then applies the usual portbased teleportation POVM on the joint system bB 1 B 2 ..B n . POVM outcome i tells him that the post-selected state was teleported into system B i (up to the usual port-based error in the deterministic version, and perfectly unless we get the failure outcome 0 in the probabilistic version), and so his experiment was run with that post-selection. Unlike most teleportation protocols, it seems as though Bob does not need any classical communication from Alice. However he does need one message: that the post selection succeeded. Finally, note that the POVM is a method for transforming a pre-selected state into a post-selected state in channel i without any scrambling, which we shall use as a primitive in later protocols. Next we do port-based teleportation on a pre and post-selected state A ⟨Φ| |Ψ⟩ A , as shown in Fig 6 . We cannot simply do pre-selected teleportation followed by post-selected teleportation, as the pre and post-selections could end up in different ports. We thus need to somehow move the pre and post-selected states together. For this we will use pre-selected port-based teleportation on a d 2 dimensional system, where d is the dimension of the Hilbert space of A. In stages: 1. Alice converts her pre and post-selected state A ⟨Φ| |Ψ⟩ A into a pre-selected state |Φ * ⟩ A 1 |Ψ⟩ A 2 by swapping |Ψ⟩ A into |Ψ⟩ A 2 and then preparing Φ + AA 1 . Here \" * \" means complex conjugation in the |0⟩ / |1⟩ basis. 2. Alice pre-selected port-based teleports the joint system |Φ * ⟩ A 1 |Ψ⟩ A 2 to Bob, and it arrives in port i (the outcome of her POVM) as |Φ * ⟩ b i |Ψ⟩ bi . 3. For each i Bob performs the port-based P OV M i , with outcome j(i), to convert this into the post-selected state B i,j ⟨Φ| b i,j ⟨Ψ * | in port (i, j). 4. Bob transforms each (i, j) into the original pre and post-selected state B i,j ⟨Φ| |Ψ⟩ B i,j by pre-preparing the state Φ + B i,j b i,j , and leaving system b i,j otherwise untouched. 5. Alice sends i to Bob using classical communication, and Bob picks out the results from port (i, j). Thus we have teleported a pre and postselected state from A into port B i,j with i known to Alice and j(i) known to Bob. Neither Alice nor Bob have to wait for one another before completing the quantum part of their experiments, including the post-selection. As before, these methods work for entangled and mixed pre and postselected states. As the protocols are built upon the usual port-based teleportation POVM and pre-shared entangled state, we can use whichever port-based variant we like, deterministic or probabilistic, or multi-port. One use of this protocol is as a quantum memory for (pre and) post-selected states. We may be given a state, and wish to store it for later use with a quantum channel which we can use multiple times. This is in a sense a time-reversed application corresponding to the storage of a quantum channel for usage later on a pre-selected quantum state, for which the optimal protocol is described in [45]. We can store the pre and postselected state by following Alice's steps in the port-based teleportation protocol just described in Fig 6 . Later on, when we have the channel ready to use, we perform Bob's steps of the teleportation protocol, applying the channel in every single port B i,j . Finally we read out the results from port (i, j). Depending upon whether we use deterministic or probabilistic port-based teleportation, this will have the same noise or probabil- Swap(b, B) Bob can perform any computation or measurement on the joint system, doing it n 2 times (once on each port). We have omitted the other ports and POVMs from the picture for compactness. ity of failure as our teleportation protocol, which can be made as small as desired by increasing the number of ports. We do not claim this protocol is optimal, and leave such an investigation for future work."
    },
    {
      "heading": "Instantaneous Non-Local Computation and Measurement",
      "text": "We show in Fig 7 how to perform an arbitrary instantaneous quantum computation or measurement on two spatially separated pre and postselected systems, generalizing the result for preselected systems in [20]. \"Instantaneous\" means that we perform the quantum parts of the experiments simultaneously at spatially separated locations, and then use classical communication to select the final results. Whilst the quantum part is instantaneous, the classical communication takes time. The protocol can be extended to any number of parties. Suppose Alice and Bob wish to perform a joint computation on systems A and B which are in a pre and post-selected state A ⟨Φ| |Ψ⟩ A for Alice and B ⟨Ω| |Υ⟩ B for Bob. They could try to use a port-based teleportation from Bob's system B to Alice's ancilla system a i to move the whole state together on Alice's side to allow her to perform the computation. However this puts the state into the system Aa i where i is known only to Bob, and Alice cannot make an arbitrary bipartite measurement simultaneously on Aa 0 , Aa 1 etc as they will disturb each another on A. In- stead they could try (non-port based) teleporting Bob's state to Alice (without initially doing any unscrambling as that requires waiting for classical communication), and then port-based teleporting the joint state back to Bob. However both ⟨Φ| and |Ψ⟩ are scrambled, and Bob only knows how to unscramble |Ψ⟩. Instead they skip the step causing the scrambling of |Ψ⟩, which gives the successful protocol shown in Fig 7. Alice and Bob 1. Start by bringing Alice and Bob's systems together on Alice's side as a 4 system pre-selection |Φ * ⟩ A 1 |Ψ⟩ A 2 σ A 3 k |Υ⟩ A 3 |Ω * ⟩ A 4 , where |Υ⟩ is scrambled by σ k known to Bob. 2. Alice port-based teleports this joint state to Bob as a single d 4 dimensional system into port i, |Φ * ⟩ b i 1 , where i is known to Alice."
    },
    {
      "heading": "Bob applies σ k on b i",
      "text": "3 for each i to unscramble 4. For each i Bob performs the port-based P OV M i , with outcome j(i), to convert this into the post-selected state ⟨Ω| in port (i, j). 5. Bob transforms each (i, j) into the original pre and post-selected state and leaving systems b i,j 1 and b i,j 2 otherwise untouched. Bob can perform whatever computation or measurement, von Neumann or POVM, he wants on the joint pre and post-selected system B ij 1 B ij 2 , repeating it for all ports (i, j). If he wishes he can use pre and post-selected port-based teleportation to send all the systems B ij 1 back to Alice, using the multi-port variation [28,29,30] for efficiency. At the end Alice knows i and Bob knows j(i), so they can pick the right results via classical communication. That completes the protocol, which again works on arbitrary initial entangled states, pure or mixed. This port-based protocol is exponentially more efficient in terms of entanglement than the previously known instantaneous measurement protocol for pre and post-selected states [16]. This exponential gap was shown in [20] for the preselected case. The ebits of entanglement used to instantaneously measure a system of m qubits for Alice (i.e. dimension d = 2 m ) and m for Bob, whilst making the probability of failure less than ϵ, scales with m as shown in table 1. Our protocol is more efficient still for POVMs as it uses the same entanglement as a von Neumann measurement, whereas the previous protocol requires writing the POVM as a von Neumann measurement using an ancilla, then teleporting the ancilla and system to be measured together back and forth as one higher dimensional system."
    },
    {
      "heading": "Protocol Type",
      "text": "Original Port-Based Pre 4m2 ln(1/ϵ)4m2 4m -6m (2m/ϵ)2 4m Pre&Post 8m2 ln(1/ϵ)8m2 8m -14m (4m/ϵ)2 8m Table 1: Approximate entanglement (ebits) used to perform an instantaneous measurement on m qubits for Alice and m for Bob with ϵ probability of success. The port-based numbers are an upper bound. The portbased scheme is exponentially better in m. To calculate that upper bound of the entanglement usage for the port-based instantaneous measurement for pre-selected systems, we start from the optimal probability of success of portbased teleportation, given by theorem 4 in [24], as p = 1 -(d 2 -1)/(n + d 2 -1), where n is the number of ports. The measurement protocol first teleports m qubits from Bob to Alice, using m ebits. Then it port-based teleports all 2m qubits back from Alice to Bob as a single d = 2 2m dimensional system in n ports, using at most 2mn ebits (the optimal port-based teleportation uses a non-maximally entangled state whose entanglement will be upper bounded by this). Setting p = 1 -ϵ, ϵ small so we can ignore the entanglement usage of the original teleportation, and ignoring terms which are small compared to 2 4m , we have an upper bound on the entanglement usage of (2m/ϵ)2 4m . The entanglement usage of measuring m pre and post-selected qubits is similar, with m replaced by 2m, as each pre and post-selected qubit is mapped into 2 pre-selected qubits before being port-based teleported. To calculate the entanglement usage of the original (Vaidman) protocol to measure m preselected qubits for Alice and m for Bob, we follow section 1.3 of [20]. The probability of success in each round of the protocol is 2 -4m (except for the first round, which is 2 -2m ). Then the number of rounds, r, needed to make the probability of failure equal to a given ϵ is roughly ln(1/ϵ)2 4m , where ln is the natural logarithm. The entanglement usage of round r (after the first couple of rounds) is roughly 4m2 4m(r-2)+2m . Putting these together gives the result in table 1. The entanglement usage of the original protocol for pre and post-selected qubits [16] was calculated along similar lines."
    },
    {
      "heading": "Conclusion",
      "text": "We have shown how to teleport pre and postselected states with certainty. We have also shown how to teleport them port-based. We then showed how to perform instantaneous non-local quantum computation on a pre and post-selected state. This allows us to store a post-selected state in a quantum memory for later usage, and to perform the quantum part of any non-local verification measurement instantaneously using exponentially less entanglement than the previous protocol. We believe that these protocols will prove useful for other quantum information processing tasks. which described post-selected teleportation, similar to our section 2. Our paper goes further, extending the results to post-selected port-based teleportation, and using it as a quantum memory for post-selected states, instantaneous computation, and instantaneous measurement. states\". J. Phys. A: Math. Theor. 40, 3275-3284 (2007). [47] Charles H. Bennett and Stephen J. Wiesner. \"Communication via one-and two-particle operators on einstein-podolsky-rosen states\". Phys. Rev. Lett. 69, 2881-2884 (1992)."
    },
    {
      "heading": "A Optimality of Resources",
      "text": "Here we prove that the post-selected teleportation described in Fig 2 is optimal in terms of entanglement and classical communication resource. First to prove that a maximally entangled pair Φ + AB is necessary, we show how to use the postselected teleportation to create a maximally entangled pair Φ + AB between Alice and Bob. As entanglement cannot be created by local operations and classical communication, it must have been there initially. Suppose we start with an entangled pair on Alice's side Φ + Aa 1 , another on Bob's side Φ + bB and teleport system a 2 of the post-selected state a 1 a 2 Φ + to system b. This gives us a 1 b Φ + Φ + Aa 1 Φ + bB = Φ + AB (6) i.e. the same entanglement as we used in the teleportation. The post-selection may not always succeed, so we apply it by performing the Bell Measurement with outcome j on a 1 a 2 , and teleporting whichever Bell state is the outcome of the measurement. Alice can then apply a local rotation σ j to turn this into Φ + AB , completing the proof. To prove the teleportation is optimal in using two bits of classical communication from Alice to Bob, we shall show Bob can communicate two bits to Bob using Super Dense Coding [47]. We start with an an entangled pair on Alice's side Φ + a 1 a 2 , and an entangled pair between Alice and Bob Φ + AB . Bob can encode his message i by applying σ B i to system B. They teleport Alice's system a 3 in the post-selection a 2 a 3 Φ + to system B. After the teleportation Alice will have She can perform a Bell measurement on Aa 1 to read the message. The post-selection may not always succeed, so we perform it by applying the Bell measurement on a 2 a 3 . Getting different outcomes of the Bell measurement on a 2 a 3 simply permutes the outcomes of the Bell measurement on Aa 1 in a deterministic way, so Alice will always be able to read the message and receive 2 bits from Bob."
    }
  ]
}