{
  "paperid": "2308.10883v1",
  "title": "Quantum Symmetric Private Information Retrieval with Secure Storage and Eavesdroppers",
  "authors": [
    "Aytekin",
    "Nomeir",
    "Vithana",
    "Ulukus",
    "Chor",
    "Kushilevitz",
    "Goldreich",
    "Sudan",
    "Sun",
    "Jafar",
    "Sun",
    "Jafar",
    "Sun",
    "Jafar",
    "Wang",
    "Skoglund",
    "Wang",
    "Sun",
    "Skoglund",
    "Yang",
    "Shin",
    "Lee",
    "Jia",
    "Sun",
    "Jafar",
    "Yao",
    "Liu",
    "Kang",
    "Banawan",
    "Ulukus",
    "Banawan",
    "Ulukus",
    "Banawan",
    "Ulukus",
    "Banawan",
    "Ulukus",
    "Attia",
    "Kumar",
    "Tandon",
    "Banawan",
    "Arasli",
    "Wei",
    "Ulukus",
    "Raviv",
    "Tamo",
    "Yaakobi",
    "Banawan",
    "Arasli",
    "Ulukus",
    "Siavoshani",
    "Shariatpanahi",
    "Ali Maddah-Ali",
    "Wei",
    "Banawan",
    "Ulukus",
    "Wang",
    "Ulukus",
    "Vithana",
    "Banawan",
    "Ulukus",
    "Heidarzadeh",
    "Kadhe",
    "Rouayheb",
    "Sprintson",
    "Tajeddine",
    "Gnilke",
    "Rouayheb",
    "Ulukus",
    "Avestimehr",
    "Gastpar",
    "Jafar",
    "Tandon",
    "Tian",
    "Song",
    "Hayashi",
    "Song",
    "Hayashi",
    "Song",
    "Hayashi",
    "Allaix",
    "Song",
    "Holzbaur",
    "Pllaha",
    "Hayashi",
    "Hollanti",
    "Yang",
    "Yang",
    "Xu",
    "Zhou",
    "Shi",
    "Song",
    "Hayashi",
    "Saarela",
    "Allaix",
    "Freij-Hollanti",
    "Hollanti",
    "Allaix",
    "Holzbaur",
    "Pllaha",
    "Hollanti",
    "Allaix",
    "Lu",
    "Yao",
    "Pllaha",
    "Hollanti",
    "Jafar",
    "Nielsen",
    "Chuang"
  ],
  "year": 2023,
  "abstract": "We consider both the classical and quantum variations of X-secure, E-eavesdropped and T -colluding symmetric private information retrieval (SPIR). This is the first work to study SPIR with X-security in classical or quantum variations. We first develop a scheme for classical X-secure, E-eavesdropped and T -colluding SPIR (XSETSPIR) based on a modified version of cross subspace alignment (CSA), which achieves a rate of R = 1 -X+max(T,E) N . The modified scheme achieves the same rate as the scheme used for X-secure PIR with the extra benefit of symmetric privacy. Next, we extend this scheme to its quantum counterpart based on the N -sum box abstraction. This is the first work to consider the presence of eavesdroppers in quantum private information retrieval (QPIR). In the quantum variation, the eavesdroppers have better access to information over the quantum channel compared to the classical channel due to the over-the-air decodability. To that end, we develop another scheme specialized to combat eavesdroppers over quantum channels. The scheme proposed for X-secure, E-eavesdropped and T -colluding quantum SPIR (XSETQSPIR) in this work maintains the super-dense coding gain from the shared entanglement between the databases, i.e., achieves a rate of RQ = min 1, 2 1 -X+max(T,E) N .",
  "sections": [
    {
      "heading": "I. INTRODUCTION",
      "text": "In the private information retrieval (PIR) problem introduced in [1], a user wishes to retrieve a message out of K messages stored in N databases without revealing the index of the required message to any of the databases. The optimal rate of PIR with N databases and K replicated messages is shown to be C(N, K) = (1 + 1 N + . . . + 1 N K-1 ) -1 in [2]. Subsequently, several variations of this problem have been studied with different requirements for the databases and the user. In [3], symmetric PIR (SPIR) is introduced, where the user is not allowed to obtain any information about the message set other than the required message. The capacity of SPIR is shown to be 1 -1 N in [3], which is also C(N, ∞). In [4], T -colluding PIR is introduced where any T databases can share the queries received from the user to learn the required message index. The capacity of T -colluding PIR is shown to be (1 + T N + . . . + T K-1 N K-1 ) -1 in [4], which is also C( N T , K). T -colluding SPIR is considered in [5] and its capacity is shown to be 1 -T N , which is C( N T , ∞). In [6], the E-eavesdropped, T -colluding SPIR is introduced. In this setting, there is an eavesdropper that can listen to all answers from any E databases to the user. The capacity for this case is shown to be 1 -max(T,E) N in [6]. The problem of X-secure PIR is introduced in [7], where the messages need to be hidden from the databases themselves even when X databases share their complete datasets. In [8], the asymptotic capacity of Xsecure T -colluding PIR, i.e., the capacity when K → ∞, is shown to be 1 -X+T N . Some other variations of the PIR and SPIR problems have been studied and different applications have been introduced in [9]- [23]; see also [24]. The problem of quantum PIR (QPIR) is recently introduced in [25]. In this model, the message bits are sent over a quantum channel from the databases to the user, and the databases can share entanglement between them. [25] shows that the capacity of symmetric QPIR (SQPIR) is 1 when the number of databases is N ≥ 2. Variations of QPIR include T -colluding QPIR with and without coded storage [26]- [28], QPIR with noisy channels [29], and several other variations analogous to their classical counterparts [30]- [32]. Most recently, [33] has proposed a mathematical abstraction for the entanglement between transmitters sending information to a common receiver over separate quantum channels. The work in [33] shows that the entanglement between N transmitters that use Pauli operators to encode classical messages to quantum states can be represented mathematically as a multiple input multiple output (MIMO) multiple access channel (MAC) with 2N inputs and N outputs, i.e., a matrix with N × 2N dimensions. In addition, this matrix must have elements from a finite field, and must satisfy the strong self orthogonal (SSO) property. Using these properties, [33] shows that the rate of X-secure T -colluding QPIR for their proposed scheme is In this paper, we focus on both classical and quantum variations of the SPIR problem with a passive eavesdropper which listens to queries and answers going into and out of any of the E databases. In addition, up to T databases collude, and up to X databases communicate. This is the first work that considers X-secure SPIR in general, even in the classical domain, and even without E-eavesdropped and Tcolluding databases. We show that the rate of the modified CSA scheme (modified for the symmetric privacy) R is the same as the rate of the CSA scheme proposed in [8] with the extra benefit of symmetric privacy, i.e., R = 1 -X+max(T,E) N . In addition, this is the first work to consider the presence of eavesdroppers in QPIR. We develop a QPIR scheme that maintains privacy and security against eavesdroppers, colluding databases and communicating databases. Our proposed quantum scheme achieves the maximum super-dense coding gain when an entangled state is shared between the databases, i.e., R Q = min 1, 2 1 -X+max(T,E) N . The QPIR problem with eavesdroppers is more complex compared to the classical PIR problem with eavesdroppers due to the over-theair decodability imposed by the N -sum box abstraction. The quantum scheme we propose in this work achieves double the rate of its classical counterpart."
    },
    {
      "heading": "II. PRELIMINARIES",
      "text": "In this section, we state some important definitions related to quantum physics and quantum information theory [34]. We use these quantities subsequently to formulate the X-secure E-eavesdropped T -colluding QSPIR. Definition 1 (Quantum density matrices) For a general quantum system A, that can be in the state |ψ j with probability p j , the quantum density matrix ρ A is defined as, with p j ≥ 0, j p j = 1. Definition 2 (Von Neumann entropy) For the density matrix ρ, Von Neumann entropy is defined as, where tr(.) is the trace operator, Λ are the eigenvalues of ρ, and H(•) is the Shannon entropy. For a quantum system A with density matrix ρ A , we define S(A) = S(ρ A ). Definition 3 (Quantum relative entropy) The relative entropy between two density matrices ρ and σ is defined as, Definition 4 (Quantum conditional entropy) The conditional entropy of a quantum system A with respect to a system B is defined as, Definition 5 (Quantum mutual information) The quantum mutual information between two quantum systems A and B is defined as, In the next section, we formulate the problem in both classical and quantum variations."
    },
    {
      "heading": "III. PROBLEM FORMULATION",
      "text": "The system consists of N databases and a user who wants to retrieve a message. Out of the N databases, T are allowed to collude, i.e., share the user's queries, and X are allowed to communicate, i.e., share their storage to decode the messages. In addition, any E links are accessible to the eavesdroppers that can listen to E of the user's queries and databases' answers. The system contains K messages, W 1 , . . . , W K , of equal length L, that are independent and identically distributed (i.i.d.). The messages are generated uniformly at random from the field F q , with q = p r , where p is any prime number. Thus, The messages W [1:K] need to be secure against any X communicating databases, where S X denotes all of the stored data in subset X databases satisfying |X | ≤ X. The user wants to retrieve a message W θ , where θ is chosen uniformly at random from [1 : K], and sends a query to each database (Q As the user does not know the messages, the queries are generated independent of the message content, In addition, we require that the index of the retrieved message by the user is private against any T colluding databases, where Upon receiving the queries, the nth database replies with a deterministic answer string A"
    },
    {
      "heading": "[θ]",
      "text": "n based on its received query Q n , shared common randomness between the databases S, and stored data, S n , n ∈ [1 : N ], When the user receives all answer strings A [θ] [1:N ] , the required message must be decodable based on the answer strings and the sent queries, In addition, the symmetric privacy constraint requires that the user gains no information about the message set except for the required message, where W θ C denotes all other messages aside from the required message W θ . Finally, the scheme must be private and secure against an eavesdropper who can listen to any set of E queries and E answers, and where The rate R of any scheme satisfying the above requirements is defined as the ratio between the length of the required message and the average length of the answer strings, In the X-secure, E-eavesdropped, T -colluding quantum symmetric PIR (XSETQSPIR) problem, we follow the system models introduced in the literature [25]- [27], [31]. The databases store S n , n ∈ [1 : N ], as classical bits and share an entangled state of N quantum bits denoted by ρ. The user sends the queries Q (ρ), where tr(•) is the trace operator, replies to the user queries over a separate quantum channel. Upon receiving the query, the nth database performs the quantum operation Enc n based on the received query, storage and A 0 n to produce the quantum state where Enc n is the nth database's encoder, and Λ n is a masking random variable sent by the user to the databases. 1  The final received state at the user is given as, where ⊗ is the tensor product. Since the storage is in the form of classical bits and the queries are sent over classical channels, constraints ( 9)-( 11) must hold. It is also required that the index of the required message be secure against the received queries and masking random variables Λ Additionally, the Von Neumann entropy of the required message W θ given the queries and the answers must be zero, and for symmetric privacy, the quantum mutual information between the other messages W θ C and the received quantum densities A [θ] [1:N ] must satisfy, ) In addition, for the eavesdroppers who listen to any E classical and quantum channels, the privacy and security requirements must be satisfied, where Then, 1 The main reason for the masking random variables is to fight over-the-air decodability in quantum channels. It is discussed in detail in Section V-B. the XSETQSPIR rate R Q for the retrieval scheme satisfying ( 9)-( 11) and ( 20)-( 24) is defined as In this paper, we follow the encoding and decoding structure using the N -sum box abstraction introduced recently in [33]. In the encoding stage, the databases use Pauli operators X(a) = q-1 j=0 |j + a j|, and Z(a) = q-1 j=0 ω tr(aj) |j j|, where q = p r with p as any prime number, a ∈ F q and ω = exp(2πi/p). In the decoding stage, the user applies projective value measurement (PVM) defined on the quotient space of the stabilizer group L(V) defined by where V is a self orthogonal subspace in and c v ∈ C is chosen such that L(V) is an Abelian subgroup of HW N q with c v I q N being an element of the stabilizer group if c v = 1, where HW N q is the Heisenberg-Weyl group defined as, In the next section, we state our main results for this problem, both for the classical and the quantum variations."
    },
    {
      "heading": "IV. MAIN RESULTS",
      "text": "Theorem 1 For classical X-secure, E-eavesdropped, Tcolluding SPIR (XSETSPIR) with N databases, the rate given by is achievable, using modified cross subspace alignment (CSA) with message length L = N -max(T, E) -X. Remark 1 When X = 0 and E = 0, the proposed scheme achieves the optimal rate for T -colluding SPIR, R = 1 -T N , found in [3], [5]. Remark 2 When X = 0, the proposed scheme achieves the optimal rate for E-eavesdropped, T -colluding SPIR, R = 1max(T,E) N , found in [6]. Remark 3 For X ≥ 1 the exact capacity of X-secure PIR with a fixed number of messages K is still an open problem. Theorem 2 For X-secure, E-eavesdropped, T -colluding quantum SPIR (XSETQSPIR) with N databases which are allowed to share entanglement and have quantum channels for answer strings, the rate given by is achievable with modified quantum CSA. Remark 4 When X = 0 and E = 0, the proposed scheme achieves the capacity of T -colluding QSPIR, R Q = min 1, 2 1 -T N , found in [26]. V. ACHIEVABLE SCHEME Before describing the achievable scheme for the quantum X-secure, E-eavesdropped, T -colluding SPIR, we first introduce the classical scheme which uses the modified classical CSA to solve the classical version of the problem."
    },
    {
      "heading": "A. Achievable Scheme in the Classical Setting: XSETSPIR",
      "text": "Consider a total of N databases with the T -colluding, Eeavesdropped and X-secure setting. Let the message length L be L = N -X -M , where M = max(E, T ). The storage at each database n denoted by S n is, where W •,j = [W 1,j , . . . , W K,j ] T is a vector representing the jth bit of all K messages, with W i,j being the jth bit of message i, R ij are uniform independent random vectors with the same dimensions as W •,j , and {f i } L i=1 , {α n } N n=1 are globally known distinct constants from F q . The user wishes to retrieve W θ while protecting its privacy from any T colluding databases and E eavesdroppers. The user sends the query n to the nth database as, where e θ is a vector of length K with a 1 in the θth index and zero otherwise, and Z ij are uniform independent random vectors of length K each, chosen by the user. Since the databases want to hide any information about the messages other than the user-required message, they agree on X + M -1 independent uniform random variables Z ′ 1 , . . . , Z ′ X+M-1 before the retrieval process starts, i.e., they share common randomness, where all X + M -1 common randomness variables Z ′ i are random noise symbols from F q . Each database n, n ∈ [1 : N ], then computes the answer to be sent to the user as, where n . After receiving all the answer strings from the N databases, the user has the following answer vector, from which the required L symbols of W θ can be obtained, as where t represents the transpose operation, α = [α 1 , . . . , α N ] t , f = [f 1 , . . . , f N ] t , and B N (α, f ) is an N ×N invertible matrix given by, where γ = [γ 1 , . . . , γ N ] t . The main difference between the N -L interference symbols here and the interference symbols in [8] is that they are contaminated with random noise unknown to the user, i.e., Z ′ i terms, which leak no information to the user except for the required L bits. Remark 5 Compared to the CSA scheme, the proposed symmetric CSA scheme achieves the same rate with the extra benefit of symmetric privacy."
    },
    {
      "heading": "B. Achievable Scheme in the Quantum Setting: XSETQSPIR",
      "text": "To develop the quantum scheme based on the N -sum box abstraction [33], we first recall some important definitions in [33]. Definition 6 (QCSA matrix) The quantum CSA (QCSA) matrix of size N × N and elements from F q designed to retrieve 2L symbols in the quantum PIR scheme is defined as follows Definition 7 (Dual QCSA matrices) The matrices H u N and Using these definitions, we restate the N -sum box feasibility theorem from [33,Thm. 6]. Theorem 3 For any dual QCSA matrices H u N and H v N , there exists a feasible N -sum box transfer matrix G(u, v) of size N × 2N given as follows, where , I L is the identity matrix of size L × L, and 0 A,B is the all zeros matrix of size A × B."
    },
    {
      "heading": "Remark 6",
      "text": "We explain the the main concept behind Theorem 3 as follows: If u and v are chosen such that H u N and H v N are dual QCSA matrices, then there exists an N -entangled qubit shared between the N databases such that the quantum channels between the databases and the user can be represented by G(u, v). Remark 7 A main difference between the quantum channel and the classical channel is that the decoding is done over-theair. This implies that if the eavesdropper listens to E answers, there is a possibility that it can get up to E out of the L symbols. This means that the eavesdropper is more powerful in the quantum variation compared to the classical variation. Now, we are ready to describe the XSETQSPIR scheme. The storage at each database is slightly modified compared to the classical case. The storage in the quantum scheme S Q is given as, where S n (1) and S n (2) are as in (31), i.e., each containing L = N -X -M ≤ N 2 new symbols of the K messages, along with new random noise vectors. In other words, the length of the messages considered in the quantum scheme is twice of what was considered in the classical case. To retrieve the required message, the user sends the query Q n to database n, which is of the same form as in the classical scheme in (32). Each database n, n ∈ [1 : N ], then generates the noise added answers as in (33), where with all Z ′ i (j) being random noise symbols. To prevent the eavesdropper from decoding over-the-air, the user sends two masking variables to each database n, given by, for κ ∈ [1,2], where λ n (κ), n ∈ [1 : N ], κ ∈ [1 : 2] are uniform independent random variables generated by the user. Then, each database generates two answer instances A , The N initial answers from the N databases are written compactly as, where Then, to make use of the entanglement and quantum channels, the answers are modified as, where u = [u 1 , . . . , u N ] t and v = [v 1 , . . . , v N ] t are chosen such that they satisfy Definition 7. These answers are sent through the quantum channels using the encoder defined by the Pauli operators, i.e., each database sends its answer instances Ãn (1), Ãn (2), n ∈ [1 : N ] as follows, Based on the properties of the quantum channel, the N symbols received by the user, denoted by y are given as, Remark 8 In this scheme, we use the fact that the length of each message sub-packet L must satisfy both L = N -X -max(T, E), and L ≤ N 2 . If L > N 2 , we drop the extra databases as in [33]. Remark 9 Note that since u and v can be globally known, the no-cloning theorem cannot be invoked, thus the eavesdropper can listen to quantum channels. Remark 10 Due to the over-the-air decoding, the user needs to send masking variables, λ 1 , . . . , λ N , to the N databases, thus N 2 bits in total. However, in our proposed scheme the user needs only to send 1 bit to each database over the nonsecure channel, i.e., N bits in total, to achieve the same goal."
    },
    {
      "heading": "VI. CONCLUSIONS",
      "text": "In this paper, we studied the classical and quantum variations of the X-secure, E-eavesdropped, and T -colluding symmetric PIR. In the classical variation, we developed a scheme that achieves symmetric privacy at the same rate as the state-of-the-art scheme that solves the same problem without symmetric privacy. In the quantum variation, we uncovered how the eavesdroppers have better access to the transmitted answer strings due to the over-the-air decodability imposed by the N -sum box abstraction. To that end, we designed a scheme that represses over-the-air decodability while maintaining the super-dense coding gain, i.e., doubling the rate compared to the classical variation."
    }
  ]
}