{
  "paperid": "2502.05071v1",
  "title": "Deterministic quantum teleportation of a path-encoded state using entangled photons",
  "authors": [
    "Krishnan",
    "Sengupta",
    "Dinesh",
    "Chandrashekar",
    "Bennett",
    "Brassard",
    "Crépeau",
    "Jozsa",
    "Peres",
    "Wootters",
    "Samuel",
    "Braunstein",
    "Mann",
    "Bouwmeester",
    "Pan",
    "Mattle",
    "Eibl",
    "Weinfurter",
    "Zeilinger",
    "Milburn",
    "Braunstein",
    "Zhang",
    "Goh",
    "Chou",
    "Lodahl",
    "Kimble",
    "Hou",
    "Huang",
    "Yuan",
    "Chang",
    "Zu",
    "He",
    "Duan",
    "Oh",
    "Lee",
    "Lee",
    "Yonezawa",
    "Samuel",
    "Braunstein",
    "Furusawa",
    "Lipka",
    "Bartosik",
    "Skrzypczyk",
    "Fattal",
    "Diamanti",
    "Inoue",
    "Yamamoto",
    "Kim",
    "Kulik",
    "Shih",
    "Karlsson",
    "Bourennane",
    "Friis",
    "Lee",
    "Truong",
    "Sabín",
    "Solano",
    "Johansson",
    "Fuentes",
    "Chen",
    "Chen",
    "Yuan",
    "Zhao",
    "Chuu",
    "Schmiedmayer",
    "Pan",
    "Zhao",
    "Jeng",
    "Conlon",
    "Tserkis",
    "Shajilal",
    "Liu",
    "Ralph",
    "Syed",
    "Assad",
    "Lam",
    "Pirandola",
    "Eisert",
    "Weedbrook",
    "Furusawa",
    "Braunstein",
    "Hu",
    "Guo",
    "Liu",
    "Li",
    "Guo",
    "Bashar",
    "Chowdhury",
    "Islam",
    "Rahman",
    "Das",
    "Wang",
    "Cai",
    "Su",
    "Chen",
    "Wu",
    "Li",
    "Liu",
    "Lu",
    "Pan",
    "Hu",
    "Zhang",
    "Liu",
    "Cai",
    "Ye",
    "Guo",
    "Xing",
    "Huang",
    "Huang",
    "Luo",
    "Zhong",
    "Erhard",
    "Wang",
    "Peng",
    "Krenn",
    "Jiang",
    "Li",
    "Liu",
    "Sun",
    "Mao",
    "Chen",
    "Zhang",
    "Jiang",
    "Zhang",
    "Zhang",
    "Miki",
    "Yamashita",
    "Terai",
    "Samuel",
    "Braunstein",
    "Kimble",
    "Holger",
    "Hofmann",
    "Ide",
    "Kobayashi",
    "Furusawa",
    "Van Loock",
    "Braunstein",
    "Yonezawa",
    "De Riedmatten",
    "Marcikic",
    "Tittel",
    "Zbinden",
    "Collins",
    "Gisin",
    "Warwick",
    "Bowen",
    "Treps",
    "Buchler",
    "Schnabel",
    "Ralph",
    "Bachor",
    "Symul",
    "Lam",
    "Wang",
    "Bartlett",
    "Munro",
    "Rigolin",
    "Demid",
    "Sychev",
    "Ulanov",
    "Tiunov",
    "Pushkina",
    "Kuzhamuratov",
    "Novikov",
    "Lvovsky",
    "Guccione",
    "Darras",
    "Jeannic",
    "Varun",
    "Verma",
    "Nam",
    "Cavailles",
    "Laurat",
    "Kolangatt",
    "Verma",
    "Matta",
    "Sengupta",
    "Chandrashekar",
    "Sengupta",
    "Dinesh",
    "Shafi",
    "Soumya Asokan",
    "Chandrashekar",
    "Jabir",
    "Samanta",
    "Kim",
    "Kwon",
    "Han",
    "Moon",
    "Yang",
    "Li",
    "Song",
    "Gao",
    "Li",
    "Zhang",
    "Chen",
    "Gong",
    "Li",
    "Wang",
    "Chen",
    "Zhang",
    "Yin",
    "He",
    "Wang",
    "Guo",
    "Han"
  ],
  "year": 2025,
  "abstract": "Quantum teleportation enables a way to transmit an arbitrary qubit state from one place to an other. A standard scheme for teleportation in optical setup involve three photons, an entangled photon pair and a photon carrying quantum state to be teleported. The interaction between the photons in the scheme makes quantum teleportation probabilistic. Here we demonstrate a deterministic teleportation of an arbitrary qubit state using only a polarization entangled photon pair in a linear optical setup. By introducing the path degree of freedom to one of the entangled photon and encoding the arbitrary qubit state into it, we demonstrate 100% Bell State Measurement (BSM) outcome. This enables a deterministic teleportation of a qubit state in an optical scheme with high fidelity. We report an average teleportation fidelity of 88.00±0.04%. The dependency of fidelity on the visibility of single-photon interferometer used for path qubit state shows the possibility of further improving the fidelity of quantum teleportation.",
  "sections": [
    {
      "heading": "",
      "text": "Introduction: Quantum teleportation enables the reconstruction of arbitrary quantum state between two spatially separated particles without actually transmitting the quantum state or a particle transfer [1][2][3]. Using a shared entangled state between two parties and a classical communication channel, quantum teleportation has been experimentally demonstrated in various quantum systems [4][5][6][7][8][9][10][11][12][13][14][15]. Among them, the ability to share entangled photons over large distances is poised to play an important role as a resource for quantum communication, distributed quantum networks and quantum computation [16][17][18]. This has resulted in the demonstration of quantum teleportation of photonic qubit states encoded in different degrees of freedom of photons [19] and in higher dimensional states [20,21]. However, even to teleport a standard two-level quantum state in a photonic system, one needs to consider a photon in an arbitrary quantum state encoded with Alice and its interaction with one of the entangled photon pairs which are shared between Alice and Bob. The interaction between the two photons with Alice is always probabilistic in nature reducing the success rate of the Bell-state measurement (BSM) which generates classical information to be exchanged with Bob. However, by using different degrees of freedom of the photon to encode arbitrary qubit state, the best efficiency reported for performing BSM and teleport a qubit state is 50% [22]. Apart from the qubit state, that is, the discrete variable approach, quantum teleportation has also been demonstrated in the continuous variable approach [23][24][25][26][27][28] and hybrid configuration [32,33]. There are also schemes available for multipartite quantum teleportation in both theory and experiment [29][30][31]. Here we demonstrate the deterministic teleportation of qubit state encoded in spatial (path) mode using only photon pairs entangled in polarization degree of freedom. Encoding arbitrary qubit state in path degree of freedom on the entangled photon with Alice does not invoke any photon-photon interaction at Alice side. This enables a deterministic and controlled operations on qubits with Alice resulting in deterministic teleportation of arbitrary qubit state from Alice to Bob. Earlier reported works employing path encoded qubit states involve higher dimensional state teleportation with a best fidelity of 0.75 using probabilistic BSM [20,21] unlike the scheme reported here which demonstrate a deterministic teleportation of only two-dimensional state. We report an average teleportation fidelity of 88.00±0.04% with highest being 99.00% for state |0⟩ and 80.30% for state |R⟩ = (|0⟩ + i|1⟩)/ √ 2). The fidelity of teleportation is dependent on the interference visibility of the single photon interference employed for BSM in the scheme. With the increase in single photon interference visibility near cent percent teleportation can be achieved. In quantum communication protocols for teleportation of quantum states or for teleportation of qubit state in photonic quantum computation involving path degree of freedom [34,35], the deterministic scheme presented here will be more easily employable when compared to other known approaches and can be extended to long distance quantum teleportation. FIG. 2: Experimental setup for teleporting a qubit state using the spatial mode of a polarization-entangled photon, which itself acts as the teleportation quantum channel. (a) A continuous-wave laser with a wavelength of 405 nm is focused on a PPKTP crystal, utilizing type-0 phase matching to produce degenerate polarization-entangled photon pairs at 810 nm in a Sagnac-type interferometer. (b) One photon of the entangled pair is sent to Bob, who will use it to reconstruct the quantum state using local unitaries. (c) The other photon of the pair is sent to Alice, where she prepares the path-encoded quantum state |ψ⟩. This is followed by a polarization-path Bell-state measurement (BSM) using a PBS and HWP. Alice then sends the classical information to Bob, who reconstructs the state based on the received values. Suppose, Alice wants to teleport an arbitrary qubit state represented as to Bob where |0⟩ and |1⟩ denote the computational basis state and the complex coefficients α, β satisfying |α| 2 + |β| 2 = 1. To achieve this, she shares an entangled quantum channel and a classical communication channel with Bob. In order to teleport an arbitrary quantum state, Alice encodes the computational basis by introducing the spatial degree of freedom (DOF) to the one of the polarization entangled photon pair shared between her and Bob. Then, she performs a joint measurement known as the BSM involving single photon interferometer on a path qubit state and transmits the classical information based on her measurement outcome, allowing Bob to perform the necessary unitary operation and reconstruct the unknown quantum state on his side. The entire process of local operations and classical communication (LOCC) is carried out based on the coincidence measurement of the Alice and Bob photon pairs. This approach which Alice employs to teleport a quantum state by introducing path degree of freedom to the polarization entangled photon she shares, uses only entangled photons pair to represent three-qubit state and teleport an arbitrary quantum state. Since the scheme does not involve photon-photon interaction, the outcome will be deterministic. In Fig. 1(a), the scheme for quantum teleportation of the path encoded qubit state using only entangled photons pair in polarization degree of freedom shared between Alice and Bob is shown. The quantum state to be teleported is encoded on the entangled photon with Alice by introducing path degree of freedom. This is done by passing it through the variable beam splitter with splitting ratio corresponding the desired qubit state Alice wants to teleport to the Bob. This action of beam splitter is independent of the polarization state of the entangled photon Alice shares with Bob. By performing the BSM on the polarization and path qubit state with Alice involving single photon interference on path qubit state, the measurement output from the two qubit state is obtained. The classical outcome of the measurement is communicated to the Bob and he will perform the corresponding unitary operator mapped to the classical information and reconstruct the qubit state on the polarization qubit with him. In Fig 1(b) the quantum circuit equivalent of the optical scheme is shown. The second and third qubit with Hadamard operation followed by controlled-NOT (C-NOT) operation represents the polarization entangled photon pair. The qubit state to teleport is encoded on Alice's photon via unitary operator (U ) in the form of variable beam splitter. The C-NOT operation, Hadamard operation followed by the joined measurement on the first two qubits represent the BSM on the path and polarization state of the photon with Alice. To perform Hadamard operation on the path qubit state one has to involve single photon interferometer [35]. In Fig. 2, the complete experimental setup for quantum teleportation is shown. A polarization entangled photon pair AB represented by the state, is prepared using a PPKTP crystal (Raicol-cyrstal), where quasi-phase matching is achieved through periodic poling with a period of 3.425µm. This corresponds to type-0 phase matching, and we have utilized a Sagnac-loop configuration to generate the polarization entanglement [36,37].  One of the entangled photon pair A is sent to Alice for encoding the qubit state to be teleported and the other pair B is sent to Bob for state reconstruction. To encode the arbitrary qubit state to be teleported, the photon A is passed through a variable beam-splitter (BS) whose output will be the path encoded qubit state. Generally, a beam splitter matrix B(θ, ϕ) takes the form: U BS (θ, ϕ) = e iϕ/2 cos θ i sin θ i sin θ cos θ . This matrix describes how the creation and annihilation operators transform under the beam splitter. If we consider the input mode as |0⟩, it transforms as follows: |ψ⟩ out = cos(θ) |0⟩ + i sin(θ) |1⟩, up to a global phase. Now, if we introduce a relative phase between the spatial modes, a general path-encoded quantum state takes the form: This will also be the state we want to teleport to Bob. For simplicity, we write it as such that |α| 2 +|β| 2 = 1, where η and (1-η) represents reflection and transmission probability, respectively. This transformation does not affect other degrees of freedom of the photon, such as polarization in this case. A nonpolarizing beam-splitter with different splitting ratios has been utilized to produce these quantum state. However, this operation is restricted due to the limitation on the availability of BS with desired splitting ratio and in addition to difference in splitting for S and P polarization vowing to the manufacturing limitations. However, as shown in Fig. 2 Al"
    }
  ]
}