{
  "paperid": "2506.18577v2",
  "title": "Classical and Quantum Resources in Perfect Teleportation",
  "authors": [
    "Zhu",
    "Chen",
    "Zhang",
    "Gour",
    "Bennett",
    "Brassard",
    "Crépeau",
    "Jozsa",
    "Peres",
    "Wootters",
    "Li",
    "Li",
    "Guo",
    "Banaszek",
    "Roa",
    "Delgado",
    "Fuentes-Guridi",
    "Verstraete",
    "Verschelde",
    "Roa",
    "Groiseau",
    "Luo",
    "Zhong",
    "Erhard",
    "Wang",
    "Peng",
    "Krenn",
    "Jiang",
    "Li",
    "Liu",
    "Lu",
    "Huang",
    "Yang",
    "Hu",
    "Zhang",
    "Liu",
    "Cai",
    "Ye",
    "Guo",
    "Xing",
    "Huang",
    "Huang",
    "Li",
    "Chen",
    "Shen",
    "Zhang",
    "Chen",
    "Zhang",
    "Zhang",
    "Karlsson",
    "Bourennane",
    "Li",
    "Ghose",
    "Sangouard",
    "Simon",
    "De Riedmatten",
    "Gisin",
    "Biham",
    "Huttner",
    "Mor",
    "Bose",
    "Vedral",
    "Knight",
    "Townsend",
    "Aoun",
    "Tarifi"
  ],
  "year": 2025,
  "abstract": "We propose a teleportation protocol that enables perfect transmission of a qubit using a partially entangled two-qutrit quantum channel. Within our scheme, we analyze the relationship among the three key ingredients of teleportation: (i) the quantum channel, (ii) the sender's (Alice's) measurement operations, and (iii) the classical information transmitted to the receiver (Bob). Compared to Gour's protocol [1], our scheme requires less entanglement of Alice's measurement and fewer classical bits sent to Bob. Our results also show a trade-off between these two resources and derive a lower bound for their sum, quantifying their interplay in the teleportation process.",
  "sections": [
    {
      "heading": "I. INTRODUCTION",
      "text": "Quantum teleportation is a protocol that enables the transmission of an unknown quantum state from a sender (Alice) to a receiver (Bob), utilizing a quantum channel and assisted by classical communication. This process, first proposed by Bennett et al. [2], can be perfectly implemented by sharing a maximally entangled two-qubit Bell state between Alice and Bob. Alice performs a joint measurement on the quantum state to be transmitted and a subsystem of the pre-shared Bell state. She then sends the corresponding measurement results to Bob via classical communication. Finally, Bob applies specific unitary operations to his state, recovering the target state with 100% success probability. A key feature of quantum teleportation lies in the nonuniqueness of its protocols. Significant extensions beyond the original scheme include: probabilistic teleportation with partially entangled pure states [3][4][5][6][7], teleportation in high dimensions [8][9][10][11][12], and controlled teleportation involving third-party supervisors [13,14]. These protocol variants now play a pivotal role in various quantum communication scenarios [15][16][17][18][19]. Despite the diversity of protocols, they all share a common requirement: the consumption of quantum entanglement and classical communication resources. The former manifests in the entanglement of the quantum channel and the entanglement resources of the sender's joint measurement, while the latter depends on the amount of classical information that must be transmitted to reconstruct the quantum state. The interplay among these three key factors remains an open problem in quantum teleportation theory. Specifically, for a fixed quantum channel, what is the fundamental relationship between the measurement resource requirement and the classical communication cost? Can this relationship be quantitatively characterized? We address these questions for the special case of faithfully transmitting a qubit using arbitrary partially entangled two-qutrit pure states. Through a perspective that interprets Alice's measurement basis as a unitary transformation of the computational basis, we extend the teleportation protocol from two-qubit to two-qutrit quantum channels. Our scheme employs five free parameters to characterize the measurement basis, offering broader applicability compared to existing protocols: Gour's protocol [1] requires only two parameters but imposes a fixed classical cost log 2 d a (where d a represents the total dimension of Alice's system), regardless of channel entanglement. Chen et al's protocol [11] further reduces the parameter count to one, though this comes at the expense of being restricted to partially entangled states with degenerate Schmidt coefficients. In contrast, our protocol combines these two characteristics: (i) entanglementdependent classical communication cost for resource optimization, (ii) compatibility with adaptability to arbitrary partially entangled two-qutrit channels. Based on the Ref. [11]'s definition of the entanglement of Alice's joint measurement basis, we analyze the relationship among the above three key ingredients. The results show that our protocol achieves greater resource efficiency than prior approaches [1,11] in both classical communication costs and quantum entanglement consumption for any perfect-teleportation-enabled two-qutrit partially entangled pure state. Moreover, we derive the lower bound on the sum of these two resource costs under fixed channel conditions, revealing a constrained trade-off relationship between classical and quantum resources."
    },
    {
      "heading": "II. TWO-QUBIT CHANNEL",
      "text": "To propose a two-qutrit channel protocol for qubit transmission, we reconstruct the standard teleportation scheme originally designed for two-qubit channels. First, we briefly revisit the conventional approach that utilizes two-qubit Bell states as the quantum channel. Following the standard protocol, the sender (Alice) and the recipient (Bob) pre-shared an EPR pair. When Alice needs to transmit an unknown qubit to Bob (satisfying the normalization condition |α| 2 + |β| 2 = 1), she first applies a controlled-Not gate (qubit 1 as the control and qubit 2 as the target) and follows a Hadamard gate (acting on qubit 1) to her local qubits. She then measures qubits 1 and 2 in the computational basis, obtaining a 2-bit outcome m ∈ {00, 01, 10, 11}. After obtaining the outcome, Bob applies the corresponding Pauli gate (1, X, Z or Y ) to qubit 3 to recover the state |φ 1 perfectly. Figure 1 illustrates the process of the standard quantum teleportation protocol, where |Φ 23 represents the pre-shared EPR pair, D † 12 denotes the unitary operation performed by Alice, and W M1M2 corresponds to the state recovery operation implemented by Bob based on the received classical information (M 1 , M 2 ). Notice that the pre-shared EPR pair can be replaced by a two-qubit partially entangled pure state with , where perfect teleportation is attainable if and only if |Φ 23 is maximally entangled [3]. Our subsequent analysis will utilize such partially entangled states (and their high-dimensional extensions) as the quantum channel. Without loss of generality, one can assume that the Schmidt coefficients a j=0,1 are real numbers and 0 ≤ a 0 ≤ a 1 . Meanwhile, the unitary operation D † 12 and the following measurement of the computational basis can be regarded as a measurement of the Bell basis. This implies that constructing Alice's joint measurement basis reduces to designing the unitary operator D 12 . Since Bob's recovery operation depends on the elements of operator D 12 , the essential step of the teleportation protocol lies in the design of this unitary operator. In our scheme, the unitary operator corresponding to Alice's joint measurement is of the form After Alice measured qubits 1 and 2 using the computational basis, Bob's qubit 3 collapsed into the form of |φ j± 3 = α|φ α 3 + β|φ β 3 . This process is equivalent to performing a joint measurement of qubits 1 and 2 in the orthonormal basis At this stage, our protocol contains multiple undetermined parameters due to the lack of certain prior conditions (for example, the values of Schmidt coefficients a j=0,1 ). We shall show that perfect teleportation in our scheme can only be achieved when the quantum channel is maximally entangled. For the protocol to succeed perfectly, the following conditions must hold: (i) yielding four constraint equations in total. By leveraging the unitarity of matrices U and V , and the normalization condition . Thus, the original four conditions simplify to the following form: •e iδ ) sin η cos η = 0, (5) where we have assumed u kl = v kl without loss of generality. It is easy to show that the conditions hold if • e iδ = 0, one can obtain that e iδ = -1, a 2 0 = a 2 1 = 1/2, and By performing a unitary transformation 1 , the maximally entangled states in Eq. (6b) can be transformed as Bell bases 1 √ 2 (|00 -|11 ) 12 and 1 √ 2 (|10 + |01 ) 12 . Thus, this new scheme is equivalent to the standard one. If sin η cos η = 0, one can obtain that a 2 0 u 2 12 = a 2 1 u 2 11 , then the same conclusion holds. III. TWO-QUTRIT CHANNEL Extending the previous protocol to the two-qutrit channel follows naturally. Similarly to the case of the two-qubit channel, the state that Alice can expect to deliver is still in the form of Eq. ( 1). The transmission channel is described by where the Schmidt coefficients a j=0,1,2 are real numbers satisfying 0 ≤ a j < 1 and 2 j=0 a 2 j = 1. The total state in the teleportation takes the form Compared with the two-qubit channel case, these basis vectors {|00 , |01 , |02 , |10 , |11 , |12 } admit a richer variety of possible decompositions into mutually orthogonal subspaces. After imposing perfect teleportation constraints, there remain three types of identity-dimensional orthogonal subspace decompositions: The selection of subspaces for constructing the measurement bases is related to the size of the Schmidt coefficients. If the Schmidt coefficients satisfy max{a j } j=0,1,2 = a 1 , then Alice's measurements can be chosen by a unitary transformation acting on the subspace of {|00 , |11 , |02 } and {|10 , |01 , |12 }. The unitary operators read as where u kl , v kl , and δ m (k, l = 1, 2, 3, m = 1, 2) are real numbers. The constraint equations for the unitary matrix elements can be directly derived from conditions (i) and (ii) for perfect quantum teleportation. Note that the number of constraint equations is significantly fewer than the number of unknown parameters, making it particularly challenging to determine the explicit form of the measurement bases analytically. To simplify our analysis, we assume that u kl = v kl and U are restricted to be a rotation matrix R(θ 1 , θ 2 , θ 3 ) within the SO(3) group. For a two-qutrit channel, the unitary operator corresponding to Alice's joint measurement is of the form The constraint equations for the unitary matrix elements and the Schmidt coefficients are given as Then the probabilities of Alice's outcome are given by the overlap P j± = 3 φ j± |φ j± 3 as Next, one can easily prove that our scheme is sufficient and necessary for all quantum channels satisfying the perfect teleportation condition. [1] When max{a j } j=0,1,2 = a 1 ≤ 1/ √ 2, Eqs. (11a) allow expressing two rotation angles (e.g., θ 1 and θ 2 ) in terms of the third (θ 3 ), while constraining its admissible range. This guarantees the existence of a solution for all valid channels. In this sense, our scheme is necessary for any quantum channel satisfying max{a j } j=0,1,2 = a 1 ≤ 1/ √ 2. In contrast, consider a channel with max{a j } j=0,1,2 = a 1 = 1/2 + δ > 1/ √ 2, (δ > 0). From the unitary constraints This implies that our scheme is sufficient for any quantum channel satisfying max{a j } j=0,1,2 = a 1 ≤ 1/ √ 2. In particular, this analysis can be extended symmetrically to cases where a 0 or a 2 are maximal, thus exhaustively characterizing all perfect teleportation-capable channels. This completes the proof."
    },
    {
      "heading": "IV. ENTANGLEMENT AND CLASSICAL INFORMATION",
      "text": "A perfect quantum teleportation scheme involves three key elements: establishing a quantum channel, the joint measurement performed by Alice, and the transmission of classical information to Bob. Each of these steps requires the consumption of certain resources. Our scheme provides a continuous region to explore these resources in the perfect teleportation of a qubit, where the Schmidt coefficients of the bipartite states can be selected at random. Also, by examining the three key elements mentioned above, we have compared our scheme with the one presented in Ref. [1]. The quantifiers of the above three resources have been mentioned in Ref. [11], which are where E(|Φ 23 ) is the entanglement entropy of the quantum channel, E 12 is the entanglement of Alice's joint measurement defined by the average of the bases, H 12 is the Shannon entropy of the distribution (12). It is worth noting that (13b) can be derived by direct generalization in the work of Li et al. [3]. The entanglement of the qubitqutrit states (Eq. ( 9)) can be presented as a monotone increasing function of the concurrence, which are 2 12 (u 2 11 +u 2 13 ), C(|ψ 1-12 ) = C(|ψ 2-12 ) = 4u 2 22 (u 2 21 +u 2 23 ), C(|ψ 3± 12 ) = 2u 2 31 u 2 32 (1-cos δ 1 )+2u 2 31 u 2 33 (1cos δ 2 ) +2u 2 32 u 2 33 [1-cos(δ 1 +δ 2 )], (14) where cos δ 1 = -a 4 0 u 4 31 + a 4 1 u 4 32 -a 4 2 u 4 33 2a 2 0 a 2 1 u 2 31 u 2 32 , cos δ 2 = -a 4 0 u 4 31 + a 4 2 u 4 33 -a 4 1 u 4 32 2a 2 0 a 2 2 u 2 31 u 2 33 , cos(δ 1 + δ 2 ) = -a 4 1 u 4 32 + a 4 2 u 4 33 -a 4 0 u 4 31 2a 2 1 a 2 2 u 2 32 u 2 33 . Next, we will list two special cases of quantum channels to clarify the properties of these three quantities. Case I: a 0 = a 1 or a 2 = a 1 . Since the constraints are symmetric under the exchange of a 0 and a 2 , it is sufficient to analyze the case a 2 = a 1 without loss of generality. The scheme in Ref. [1] for this case can give an analytical expression of the entanglement of Alice's joint measurement, that is where . contrast, our scheme involves more degrees of freedom ({θ j } j=1,2,3 , {δ j } j=1,2 ). The constraint a 2 = a 1 only partially restricts these parameters, necessitating a numerical exploration of the accessible entanglement regimes. Case II: For this configuration, Ref. [1] yields the entanglement measure . In our scheme, although constrained by Eqs. (11) and the condition a 1 = 1/ √ 2, the parameter space still cannot fully determine the relationship between parameters {θ j } j=1,2,3 and {δ j } j=1,2 , and the Schmidt coefficients {a j } j=0,1,2 . Consequently, numerical methods are required to determine the achievable entanglement regimes between Alice's joint measurement and the quantum channel. Figure 2 compares the entanglement degree relationships between Alice's joint measurement and the quantum channel: (a) results from Ref. [1] protocol, (b) our scheme's results (Sect. III). It is easy to find that the entanglement of Alice's joint measurement reaches its maximum when the quantum channel is maximally entangled, and approaches a minimum as any Schmidt coefficient a j=0,1,2 vanishes. In particular, our scheme achieves a superior lower bound. When any a j → 0, the entanglement degree of Alice's joint measurement yields 3 ) ≈ 0.918 in Ref. [1]. One can also note that when the quantum channel entanglement is 1, the scheme in Ref. [1] is constrained to a unique protocol of Alice's joint measurement basis due to its fundamental design (omitting common phase factor). In contrast, our scheme provides flexible non-unique protocols (detailed examples are shown in the next section). Additionally, the region for case I in our scheme (red region in panel (b)) shows a non-monotonic relationship between the entanglement of Alice's joint measurement and the quantum channel. This demonstrates that the entanglement of Alice's joint measurement does not represent Alice's ability to utilize the quantum channel. Figure 3 shows the regions of the classical bits sent to Bob versus the entanglement of the quantum channel, along with the specific regions and curves for cases I and II. In the scheme of Ref. [1], the probabilities of Alice's outcome remain independent of the quantum channel, whereas our scheme demonstrates an overall upward trend between the classical communication cost and the entanglement of the quantum channel. When the quantum channel reduces to a two-qubit Bell state, the minimum number of classical bits required reaches its lower bound of 2 bits. This implies that our scheme contains the case of the two-qubit channel naturally. We will show this in the next section. We observe that the sum of the average entanglement of Alice's measurement and the Shannon entropy of the classical information sent to Bob exhibits a trade-off relation: the greater the entanglement resource consumption in Alice's joint measurement, the lower the classical communication costs. By Eqs. (13b) and (13c), the upper bound of E 12 + H 12 can be easily obtained as with ). For a fixed quantum channel, the quantity E 12 + H 12 is upperbounded by a function of the Schmidt coefficient a 1 . A more physically significant bound is the lower bound on E 12 + H 12 , characterizing the minimal teleportation cost that Alice incurs when using the fixed quantum channel. This lower bound can be characterized as a piecewise function of the entanglement entropy of the quantum channel E(|Φ 23 ) = E: where f 1 (E) = g(q) = q + 3 q + 1 + 2 log 2 (q + 1)-2q + 1 (q + 1) 2 log 2 (2q + 1) - Here, the parameter q exhibits a positive correlation with the entanglement entropy of the quantum channel E, obeying the relation H(q) = 2(E -1), and k = 5/3-log 2 3 log 2 3-3/2 , b = 2 log 2 3 + 11  6 -1 4 log 2 3-6 ."
    },
    {
      "heading": "V. SPECIFIC CASES",
      "text": "In this section, we will demonstrate through quantitative analysis of a specific case that our protocol exhibits non-uniqueness when the two-qutrit channel degenerates to a two-qubit scenario. Remarkably, Cases I and II produce identical entanglement measurement regions in this limit. We therefore focus on Case I to streamline our discussion. The degeneracy of channel dimensions emerges when any Schmidt coefficient approaches zero. As a prototypical example, we analyze case I under the condition a 0 = 0, where the first term in the Schmidt decomposition of the two-qutrit channel vanishes. Under this condition, Alice's joint measurement basis reduces to with with θ 2 ∈ [0, π/2]. Since the above two sets of measurement bases cannot be transformed into each other through a local unitary transformation, it is easy to get non-unique teleportation protocols through our scheme. For simplicity, we assume that Alice performs her measurements in the form of Eq. 19. Then the probabilities of Alice's outcome and the entanglement of Alice's joint measurement can be given by where H(x) is the binary entropy mentioned above. Further, the Shannon entropy of the distribution (21) is given by Figure 4 shows the relationship between the total resources that Alice costs (E 12 +H 12 ) and the parameter θ 1 . The minimum of E 12 +H 12 occurs when θ 1 = 0 or π/2. In this scenario, the measurement of qubit 1 and qutrit 2 in bases |ψ 1+ 12 and |ψ 2+ 12 (with θ 1 = 0) or |ψ 1-12 and |ψ 2-12 (with θ 1 = π/2) does not collapse qutrit 3 into the form of α|φ α + β|φ β . This implies that our scheme reduces to two-qubit Bell state teleportation. Therefore, the entanglement of Alice's measurement and the Shannon entropy of the distribution are E 12 = 1 and H 12 = 2, respectively. In addition, the maximum of E 12 + H 12 occurs when θ 1 = π/4. In this case, the measurement collapses the initial state |φ 1 |Φ 23 as with the probabilities P 1± = P 2± = 1/8 and P 3± = 1/4. The entanglement of Alice's measurement and the Shannon entropy of the distribution are E 12 = 1 2 [1 + H( 3 4 )] ≈ 0.906 and H 12 = 2 + 1 2 log 2 1 2 = 5 2 ."
    },
    {
      "heading": "VI. SUMMARY",
      "text": "By extending an equivalent scheme for the original teleportation protocol using the two-qubit channel, we propose a scheme for perfect teleportation utilizing the partially entangled two-qutrit channel. For any partially entangled two-qutrit channel that satisfies the perfect teleportation condition, it is sufficient and necessary to propose a teleportation protocol using our scheme. Compared with the scheme in [1], our scheme consumes fewer classical and quantum resources for the same channel. In addition, our scheme is suitable for a wider channel range than the scheme in [11]. We also establish a trade-off relation between the entanglement of Alice's measurement and the classical information sent to Bob, which quantifies the lower bound of these two quantities. Notably, our scheme faces limitations when extended to higher-dimensional channels. The primary challenge stems from the exponentially growing complexity (scaling as ∼ 2 da/2-1 ) in constructing Alice's measurement basis, as the number of orthogonal subspace decompositions increases with the system dimension d a . This raises a fundamental question: Does there exist a class of teleportation protocols where (i) high-dimensional joint measurements can be realized through simple low-dimensional extensions, while (ii) maintaining analogous resource trade-offs, and (iii) preserving universality for all perfectteleportation-enabled channels? Addressing this question represents a promising direction for future research."
    }
  ]
}