{
  "paperid": "9811020v1",
  "title": "Complete quantum teleportation by nuclear magnetic resonance",
  "authors": [
    "Nielsen",
    "Knill",
    "Laflamme",
    "Bennett",
    "Preskill",
    "Bennett",
    "Brassard",
    "Crepeau",
    "Jozsa",
    "Peres",
    "Wootters",
    "Bouwmeester",
    "Pan",
    "Mattle",
    "Eibl",
    "Weinfurter",
    "Zeilinger",
    "Boschi",
    "Branca",
    "De Martini",
    "Hardy",
    "Popescu",
    "Sakurai",
    "Bennett",
    "Divincenzo",
    "Smolin",
    "Wootters",
    "Cirac",
    "Zoller",
    "Kimble",
    "Mabuchi",
    "Cory",
    "Fahmy",
    "Havel",
    "Ernst",
    "Bodenhausen",
    "Wokaun",
    "Grant",
    "Harris",
    "Gershenfeld",
    "Chuang",
    "Nielsen",
    "Knill",
    "Laflamme",
    "Cory",
    "Price",
    "Havel",
    "Laflamme",
    "Knill",
    "Zurek",
    "Catasti",
    "Mariappan",
    "Nmr Greenberger-Horne-Zeilinger States",
    "Cory",
    "Price",
    "Maas",
    "Knill",
    "Laflamme",
    "Zurek",
    "Havel",
    "Somaroo",
    "Chuang",
    "Gershenfeld",
    "Kubinec",
    "Jones",
    "Mosca",
    "Chuang",
    "Vandersypen",
    "Zhou",
    "Leung",
    "Lloyd",
    "Jones",
    "Mosca",
    "Hansen",
    "Brassard",
    "Braunstein",
    "Cleve",
    "Zurek",
    "Schumacher",
    "Barnum",
    "Nielsen",
    "Schumacher",
    "Poyatos",
    "Cirac",
    "Zoller",
    "Chuang",
    "Nielsen",
    "Nielsen",
    "Caves"
  ],
  "year": 2024,
  "abstract": "Quantum mechanics provides spectacular new information processing abilities 1,2 . One of the most unexpected is a procedure called quantum teleportation 3 that allows the quantum state of a system to be transported from one location to another, without moving through the intervening space. Partial implementations of teleportation 4,5 over macroscopic distances have been achieved using optical systems,",
  "sections": [
    {
      "heading": "",
      "text": "but omit the final stage of the teleportation procedure. Here we report an experimental implementation of the full quantum teleportation operation over inter-atomic distances using liquid state nuclear magnetic resonance (NMR). The inclusion of the final stage enables for the first time a teleportation implementation which may be used as a subroutine in larger quantum computations, or for quantum communication. Our experiment also demonstrates the use of quantum process tomography, a procedure to completely characterize the dynamics of a quantum system. Finally, we demonstrate a controlled exploitation of decoherence as a tool to assist in the performance of an experiment. In classical physics, an object can be teleported, in principle, by performing a measurement to completely characterize the properties of the object. That information can then be sent to another location, and the object reconstructed. Does this provide a complete reconstruction of the original object? No: all physical systems are ultimately quantum mechanical, and quantum mechanics tells us that it is impossible to completely determine the state of an unknown quantum system, making it impossible to use the classical measurement procedure to move a quantum system from one location to another. Bennett et al 3 have suggested a remarkable procedure for teleporting quantum states. Quantum teleportation may be described abstractly in terms of two parties, Alice and Bob. Alice has in her possession an unknown state |Ψ = α|0 + β|1 of a single quantum bit (qubit) -a two level quantum system. The goal of teleportation is to transport the state of that qubit to Bob. In addition, Alice and Bob each possess one qubit of a two qubit entangled state, where subscripts A are used to denote Alice's systems, and subscripts B to denote Bob's system. Here and throughout we omit overall normalization factors from our equations. This state can be rewritten in the Bell basis ((|00 ± |11 ) , (|01 ± |10 ) for the first two qubits and a conditional unitary transformation of the state |Ψ for the last one, that is, where σ x , σ y , σ z are the Pauli sigma operators 6 , in the |0 , |1 basis. A measurement is performed on Alice's qubits in the Bell basis. Conditional on these measurement outcomes it is easy to verify from the previous equation that Bob's respective states are |Ψ ; σ z |Ψ ; σ x |Ψ ; -iσ y |Ψ . (3) Alice sends the outcome of her measurement to Bob, who can then recover the original state |Ψ by applying the appropriate unitary transformation I, σ x , σ z , or iσ y , conditional on Alice's measurement outcome. Notice that the quantum state transmission has not been accomplished faster than light because Bob must wait for Alice's measurement result to arrive before he can recover the quantum state. Recent demonstrations of quantum teleportation 4,5 omitted the final stage of teleportation, the unitary operators applied by Bob conditional on the result of Alice's measurement. This prevents complete recovery of the original state. Instead, the earlier experiments relied on classical post-processing of the data after completion of the experiment to check that the results were consistent with what one would expect if the conditional operations had, in fact, been performed. Our experiment implements the full teleportation operation. The most important implication of the inclusion of this difficult extra stage is that our teleportation procedure can, in principle, be used as a subroutine in the performance of other quantum information processing tasks. Teleportation as a subroutine is important in potential applications to quantum computation and communication 7,8 , although in the present system, moving the C2 qubit to H may be accomplished more efficiently by techniques other than teleportation. Our implementation of teleportation is performed using liquid state nuclear magnetic resonance (NMR), applied to an ensemble of molecules of labeled trichloroethylene (TCE). The structure of the TCE molecule may be depicted as To perform teleportation we make use of the Hydrogen nucleus (H), and the two Carbon 13 nuclei (C1 and C2), teleporting the state of C2 to H. Figure 1(a) illustrates the teleportation process we used. The circuit has three inputs, which we will refer to as the data (C2), ancilla (C1), and target (H) qubits. The goal of the circuit is to teleport the state of the data qubit so that it ends up on the target qubit. We are therefore only teleporting the qubit a few angstroms, making this a demonstration of the method of teleportation, rather than a practical means for transmitting qubits over long distances. State preparation is done in our experiment using the gradient-pulse techniques described by Cory et al 9 , and phase cycling 10,11 . The unitary operations performed during teleportation may be implemented in a straightforward manner in NMR, using non-selective rf pulses tuned to the Larmor frequencies of the nuclear spins, and delays allowing entanglement to form through the interaction of neighboring nuclei 9,12 . Other demonstrations of quantum information processing with three qubits using NMR are described in 14,15,16 , and with two qubits in 17,18,19,20 . An innovation in our experiment was the method used to implement the Bell basis measurement. In NMR, the measurement step allows us to measure the expectation values of σ x and σ y for each spin, averaged over the ensemble of molecules, rather than performing a projective measurement in some basis. For this reason, we must modify the projective measurement step in the standard description of teleportation, while preserving the remarkable teleportation effect. We use a procedure inspired by Brassard et al 21 , who suggest a two-part procedure for performing the Bell basis measurement. Part one of the procedure is to rotate from the Bell basis into the computational basis, |00 , |01 , |10 , |11 . We implement this step in NMR by using the natural spin-spin coupling between the Carbon nuclei, and rf pulses. Part two of the procedure is to perform a projective measurement in the computational basis. As Brassard et al point out, the effect of this two part procedure is equivalent to performing the Bell basis measurement, and leaving the data and ancilla qubits in one of the four states, |00 , |01 , |10 , |11 , corresponding to the different measurement results. We cannot directly implement the second step in NMR. Instead, we exploit the natural phase decoherence occurring on the Carbon nuclei to achieve the same effect. Recall that phase decoherence completely randomizes the phase information in these nuclei and thus will destroy coherence between the elements of the above basis. Its effect on the state of the Carbon nuclei is to diagonalize the state in the computational basis, As emphasized by Zurek 22 , the decoherence process is indistinguishable from a measurement in the computational basis for the Carbons accomplished by the environment. We do not observe the result of this measurement explicitly, however the state of the nuclei selected by the decoherence process contains the measurement result, and therefore we can do the final transformation conditional on the particular state the environment has selected. As in the scheme of approximately 20 -30s for the Carbons, and 5s for the Hydrogen. Thus, for delays on the order of 1s, we can approximate the total evolution by exact phase decoherence on the Carbon nuclei. The total scheme therefore implements a measurement in the Bell basis, with the result of the measurement stored as classical data on the Carbon nuclei following the measurement. We can thus teleport the state from the Carbon to the Hydrogen and verify that the state in the final state decays at the Hydrogen rate and not the Carbon rate. Re-examining figure 1(a) we see how remarkable teleportation is from this point of view. During the stage labeled \"Measure in the Bell basis\" in figure 1(a), we allow the C1 and C2 nuclei to decohere and thus be measured by the environment, destroying all phase information on the data and ancilla qubits. Experimentally, a standard NMR technique known as refocusing employs rf pulses to ensure that the data qubit effectively does not interact with the target qubit. Classical intuition therefore tells us that the phase information about the input state, |Ψ , has been lost forever. Nevertheless, quantum mechanics predicts that we are still able to recover the complete system after this decoherence step, by quantum teleportation. We implemented this scheme in TCE using a Bruker DRX-500 NMR spectrometer. Experimentally, we determined the Larmor and coupling frequencies for the Hydrogen, C1 and C2 to be: The coupling frequencies between H and C2, as well as the Chlorines to H, C1 and C2, are much lower, on the order of ten Hertz for the former, and less than a Hertz for the latter. Experimentally, these couplings are suppressed by multiple refocusings, and will be ignored "
    }
  ]
}