{
  "paperid": "0703106v1",
  "title": "Practical Identity-Based Encryption (IBE) in Multiple PKG Environments and Its Applications",
  "authors": [
    "Wang",
    "Al-Riyami",
    "Paterson",
    "Boneh",
    "Franklin",
    "Bellare",
    "Rogaway",
    "Gentry",
    "Mccullagh",
    "Barreto",
    "Shamir",
    "Sakai",
    "Kasahara"
  ],
  "year": 2007,
  "abstract": "In this paper, we present a new identity-based encryption (IBE) scheme using bilinear pairings. Our IBE scheme enjoys the same Key Extraction and Decryption algorithms with the famous IBE scheme of Boneh and Franklin (BF-IBE for short), while differs from the latter in that it has modified Setup and Encryption algorithms. Compared with BF-IBE, we show that ours are more practical in a multiple private key generator (PKG) environment, mainly due to that the session secret gID could be pre-computed before any interaction, and the sender could encrypt a message using gID prior to negotiating with the intended recipient(s). As an application of our IBE scheme, we also derive an escrowed ElGamal scheme which possesses certain good properties in practice.",
  "sections": [
    {
      "heading": "Introduction",
      "text": "The idea of identity(ID)-based cryptography was first introduced by Shamir in 1984 [7]. The basic idea behind an ID-based cryptosystem is that end users can choose an arbitrary string, for example their email addresses or other online identifiers, as their public key. The corresponding private keys are created by binding the identity with a master secret of a trusted authority (called private key generation, or PKG for short). This eliminates much of the overhead associated with key management. In 2001, Boneh and Franklin [2] gave the first fully functional solution for ID-based encryption (IBE) using the bilinear pairing over elliptic curves. Based on pairings, Sakai and Kasahara presented another IBE (SK-IBE for short) scheme by using another Key Extraction algorithm in 2003 [8]. However, the Boneh-Franklin scheme (BF-IBE for short) has received much more attention in recent years. In this paper, we give a new IBE scheme based on bilinear pairings. Our scheme has the same Key Extraction and Decryption algorithms with BF-IBE, while differs from the latter in that it has different Setup and Encryption algorithms. We show that ours are more practical in a multiple private key generator (PKG) environment. Parallel to [2], we also derive an escrowed ElGamal [4] encryption scheme from our IBE scheme. Furthermore, we show how the derived ElGamal encryption enables a dual decrptor public key encryption (PKE) scheme. We note that SK-IBE due to Sakai and Kasahara [8] has a better performance than BF-IBE and ours. Especially, SK-IBE are also very practical in multiple PKG environments. However, its applicability to some circumstance are not comparable to BF-IBE, e.g. , it seems very hard to derive from it an escrowed ElGamal encryption scheme. In this regard, we do not compare the new IBE with SK-IBE for now. Paper Organization. The rest of this paper is structured as follows. In the next section, we give the necessary definition for bilinear pairings. Section 3 describes our IBE scheme. In Section 4, we present a new escrowed ElGamal encryption scheme. Section 5 contains a brief conclusion and indicates our ongoing work."
    },
    {
      "heading": "Bilinear Pairings",
      "text": "In this section, we describe in a more general format the basic definition and properties of the pairing: more details can be found in [2]. Let G 1 be a cyclic additive group generated by an element P , whose order is a prime p, and G 2 be a cyclic multiplicative group of the same prime order p. We assume that the discrete logarithm problem (DLP) in both G 1 and G 2 are hard. Definition 1. An admissible pairing e is a bilinear map e : G 1 × G 1 → G 2 , which satisfies the following three properties: p , then e(aP, bQ) = e(P, Q) ab ; 2. Non-degenerate: e(P, P ) = 1; 3. Computable:"
    },
    {
      "heading": "New IBE Scheme and Its Fitness for Multiple PKG Environments",
      "text": "For the problem of inherent key escrow, the difficulty of establishing secure channels for private key distribution, and to avoid the single point of failure of using only one PKG, it is well-known that (single-PKG) IBE is only well suitable for use in relatively small and close organizations, i.e. with each organization has its own private key generator, generating private keys for the principal within its domain. For an IBE to be used in a multiple PKG environment (or, cross domains), all that is needed is the availability of standard pairing-friendly curves and a common group generator point P . We note that this is a reasonable requirement. In fact, elliptic curves, suitable group generator points and other cryptographic tools have been standardized for non-IBE applications, for example in the NIST FIPS standards [6]. Once these group generator points and curves have been agreed upon, each PKG can generate its own random master secret."
    },
    {
      "heading": "Description of the Scheme",
      "text": "Let G 1 and G 2 be groups of prime order p, and let e : G 1 × G 1 → G 2 be the bilinear pairing. P is a generator points of G 1 . The IBE system works as follows. Setup. Given a security parameter k, the PKG does the following: 1. Chooses a random s ∈ Z p , calculates The message space is M = {0, 1} n . The ciphertext space is C = G * 1 × {0, 1} n . The public params are < q, G 1 , G 2 , e, P, P P ub , n, H 1 , H 2 > and the master key is s. Key Extraction. This algorithm is identical to that of BF-IBE. To generate a private key for identity ID ∈ {0, 1} * , the PKG first computes 1 , and then sets the private key d ID to be d ID = sQ ID where s is the master key. Encryption. To encrypt message m ∈ M, the sender picks randomly a r ∈ Z p , using the receiver's identity ID to compute 1 , sets the ciphertext to be , where Decryption. This algorithm is identical to that of BF-IBE. To decrypt a ciphertext C = U, V ∈ C, using the private key d ID of the identity ID computes Consistence: The recipient can correctly decrypt C to get m since e(U, d ID ) = e(rs -1 P, sQ ID ) = e(P, Q ID ) r ."
    },
    {
      "heading": "Its Fitness for Multiple PKG Environments",
      "text": "As mentioned above, an IBE scheme is often used across multiple PKGs, namely for each organization (e.g., a company), it has its own PKG. In many cases, a principal may need to encrypt messages to principals from different domains. For example, for a salesman of company A, he may need to encrypt messages to Bob from company B, Carol from company C, or Emmy who he does not know which company she is belonging to by now. Now we compare our new IBE with BF-IBE [2] in such an environment. The Setup algorithm in our IBE requires one more fast inverse operation in Z p than BF-IBE, and the Key Extraction and Decryption algorithms in the two IBE schemes are the same. In the following, we discuss what significance our different Encryption algorithm could bring in practice. In BF-IBE [2], the session secret, i.e. th term g ID is computed as g ID = e(P P ub , Q ID ), in which P P ub is the public key of the intended receiver's PKG. We emphasize that in a multiple PKG environment, before computing the second part of the ciphertext, i.e. V , and especially, the term g ID (requires a relatively expensive pairing evaluation) which are the main operations of the overall encryption, BF-IBE requires the sender to first get to know the following two things: which organization the receiver is from, and the public key associated with the corresponding PKG. Compared with BF-IBE, the biggest difference of our IBE is that in the Encryption algorithm, the terms V and especially, g ID = e(P, Q ID ) are computed independently from any PKG's public key. Consequently, in our IBE, the sender can compute the pairing (and V ) before getting the public key of the receiver's PKG, in the case that (s)he knows which organization the receiver is from. Interestingly, the sender can even pre-compute g ID and V before (s)he knows which organization the receiver is from! Therefore, our scheme enables a type of efficient \"on the move\" IBE in a multiple PKG environment, which requires very small on-online work for the sender (i.e. encryptor). We emphasize that this feature is particularly useful in (ID-based) broadcasting (or multiple-recipient ) encryption scenario, namely with most of the expensive computation pre-computed, the overall performance will be upgraded to a large extent."
    },
    {
      "heading": "Escrowed ElGamal Encryption",
      "text": "Parallel to [2], in this section we introduce a new ElGamal encryption system in which a single escrow key enables the decryption of ciphertexts encrypted under any public key."
    },
    {
      "heading": "Description of the Scheme:",
      "text": "Our ElGamal escrow encryption works as follows: Setup. Given a security parameter k, the escrow authority (EA) does the following: 1. Chooses a random s ∈ Z p , calculates two points H > and the escrow key is s. Key Generation. Same as in [2], a user generates a public/private key pair for herself by picking a random x ∈ Z q and computing P P ub = xP ∈ G 1 . Her private key is x, her public key is P P ub . Encryption. To encrypt message m ∈ M, the sender picks randomly a r ∈ Z p , sets the ciphertext to be Compared with the scheme in [2], our escrow ElGamal requires the EA to publish one more point as its public key. An advantage of our scheme is that the sender can choose a designated EA (from multiple EAs) after (s)he finished most of the operations of encrypting a message. This provides the sender with more flexibility in practice."
    },
    {
      "heading": "A Simple and Direct Application:",
      "text": "If we look the escrow authority (EA) in the above escrowed ElGamal scheme as an ordinary principal (who has his/her own private and public key pair), it can be then used as a dual decryptor PKE scheme, i.e., a single ciphertext can be decrypted independently by two different principals. However, unlike in conventional setting, we require at least one of the recipient to publish two points (e.g. Y 1 , Y 2 ) as his/her public key, in the form of Y 1 = αP and Y 2 = α -1 P (assuming α is the private key of the recipient). A good property of this scheme is that the sender can encrypt the message before (s)he picks up the second recipient. In other words, after the encryption has been down, the sender can change his/her mind on who the second recipient will be. More interestingly, the sender can efficiently add more such \"second recipient\", each time (s)he adds one, only one scalar multiplication is needed, without any expensive pairing computation. However, we note that the size of the ciphertext will grow linearly."
    },
    {
      "heading": "Conclusion and Ongoing Work",
      "text": "The rapid world-wide development of electronic transactions, largely associated with the growth of the Internet, stimulates a strong demand for fast, secure and cheap public key schemes. In this paper, we gave a practical IBE scheme suitable for multiple PKG environments. Additionally, we proposed a related escrow ElGamal encryption scheme. Ongoing work includes studying the formal security of the proposed two encryption schemes, namely to prove the security of them in the random oracle model [3] (provided that the Bilinear Diffie-Hellman (BDH) problem is hard), and exploring its merits in constructing Certificate-Based Encryption (CBE) [5] and Certificateless Public Key Encryption (CL-PKE) schemes [1]."
    }
  ]
}