{
  "paperid": "2510.24534v1",
  "title": "Quantum-Resistant Networks Using Post-Quantum Cryptography",
  "authors": [
    "Jin",
    "Kumar",
    "§1",
    "Azari",
    "Seshadreesan",
    "Liu",
    "Lo",
    "Chau",
    "Bennett",
    "Brassard",
    "Bennett",
    "Brassard",
    "Crépeau",
    "Jozsa",
    "Peres",
    "Wootters",
    "Davis",
    "Valivarthi",
    "Cameron",
    "Pena",
    "Xie",
    "Narvaez",
    "Lauk",
    "Li",
    "Taylor",
    "Youssef",
    "Wang",
    "Kapoor",
    "Korzh",
    "Sinclair",
    "Shaw",
    "Spentzouris",
    "Spiropulu",
    "Wootters",
    "Zurek",
    "Kimble",
    "Wehner",
    "Elkouss",
    "Hanson",
    "Zhou",
    "Tang",
    "Li",
    "Yu",
    "Chen",
    "Yu",
    "Liu",
    "Steane",
    "Gottesman",
    "Bennett",
    "Brassard",
    "Popescu",
    "Schumacher",
    "Smolin",
    "Wootters",
    "Mosca",
    "Shor",
    "Shor",
    "Rivest",
    "Shamir",
    "Adleman",
    "Diffie",
    "Hellman",
    "Pub",
    "Koblitz",
    "Grover",
    "Scrivano",
    "Chen",
    "Chen",
    "Jordan",
    "Liu",
    "Moody",
    "Peralta",
    "Perlner",
    "Smith-Tone",
    "Bos",
    "Ducas",
    "Kiltz",
    "Lepoint",
    "Lyubashevsky",
    "Schanck",
    "Schwabe",
    "Seiler",
    "Stehle",
    "Ducas",
    "Lepoint",
    "Lyubashevsky",
    "Schwabe",
    "Seiler",
    "Stehle",
    "Hulsing",
    "Bernstein",
    "Dobraunig",
    "Eichlseder",
    "Fluhrer",
    "Gazdag",
    "Kampanakis",
    "Kolbl",
    "Lange",
    "Lauridsen",
    "Angom",
    "Kar",
    "Debbarma",
    "Biswas",
    "Makarov",
    "Anisimov",
    "Skaar",
    "Zhao",
    "Fung",
    "Qi",
    "Chen",
    "Lo",
    "Lydersen",
    "Wiechers",
    "Wittmann",
    "Elser",
    "Skaar",
    "Makarov",
    "Fei",
    "Meng",
    "Gao",
    "Wang",
    "Ma",
    "Jain",
    "Anisimova",
    "Khan",
    "Makarov",
    "Marquardt",
    "Leuchs",
    "Lucamarini",
    "Choi",
    "Ward",
    "Dynes",
    "Yuan",
    "Shields",
    "Pang",
    "Yang",
    "Zhang",
    "Dou",
    "Li",
    "Gao",
    "Jin",
    "Ma",
    "Qi",
    "Zhao",
    "Lo",
    "Braunstein",
    "Pirandola",
    "Lo",
    "Curty",
    "Qi",
    "Li",
    "Li",
    "Xue",
    "Li",
    "Chen",
    "Li",
    "Wang",
    "Yu",
    "Wei",
    "Sun",
    "Lu",
    "Heshami",
    "England",
    "Humphreys",
    "Bustard",
    "Acosta",
    "Nunn",
    "Sussman",
    "Xu",
    "Ma",
    "Zhang",
    "Lo",
    "Pan",
    "Poettering",
    "Rösler",
    "Schwenk",
    "Stebila",
    "Yan",
    "Zhou",
    "Zhong",
    "Sheng"
  ],
  "year": 2025,
  "abstract": "Quantum networks rely on both quantum and classical channels for coordinated operation. Current architectures employ entanglement distribution and key exchange over quantum channels but often assume that classical communication is sufficiently secure. In practice, classical channels protected by traditional cryptography remain vulnerable to quantum adversaries, since large-scale quantum computers could break widely used public-key schemes and reduce the effective security of symmetric cryptography. This perspective presents a quantum-resistant network architecture that secures classical communication with post-quantum cryptographic techniques while supporting entanglementbased communication over quantum channels. Beyond cryptographic protection, the framework incorporates continuous monitoring of both quantum and classical layers, together with orchestration across heterogeneous infrastructures, to ensure end-to-end security. Collectively, these mechanisms provide a pathway toward scalable, robust, and secure quantum networks that remain dependable against both classical and quantum-era threats.",
  "sections": [
    {
      "heading": "I. Introduction",
      "text": "Quantum entanglement is a fundamental resource in quantum communication, enabling protocols that achieve information transfer beyond the capabilities of classical systems. Quantum key distribution (QKD) [1], [2], quantum teleportation [3], and entanglement swapping [4] demonstrate how quantum states can be transmitted securely across distance based on the principles such as superposition and the nocloning theorem [5]. These advances have laid the groundwork for large-scale quantum networks, where entanglement distribution serves as the foundation for secure communication and distributed quantum information processing [6], [7]. Most quantum applications, in addition to relying on quantum channels, also depend critically on classical channels for exchanging information. Classical communication is required for reconciliation in QKD [8], for transmitting syndrome data in quantum error correction [9], [10], and for exchanging measurement outcomes in entanglement purification [11]. This reliance creates a significant vulnerability: while the quantum components of these protocols may be intrinsically resistant to eavesdropping, the classical components continue to depend on conventional cryptography, which is threatened 1 :These authors contributed equally. by quantum adversaries [12]. If attackers possess quantum computational power, classical authentication and coordination mechanisms can be compromised, undermining the very security that quantum applications are designed to provide. Classical cryptography secures current digital communication, but these protocols are vulnerable in the presence of quantum computers. Shor's algorithm [13], [14] can solve integer factorization and discrete logarithms in polynomial time, breaking the hardness assumptions underlying RSA [15], Diffie Hellman key exchange [16], the Digital Signature Algorithm (DSA) [17], and elliptic curve cryptography (ECC) [18]. In addition, Grover's algorithm [19] provides a quadratic speedup for brute force search, reducing the effective security level of symmetric key ciphers and hash functions by half; for instance, AES 128 offers only about 64 bits of security against a quantum adversary [20]. Together, these results show that conventional cryptographic primitives cannot provide long term security in a quantum era. In response to the looming threat posed by quantum computers, the U.S. National Institute of Standards and Technology (NIST) initiated its Post-Quantum Cryptography (PQC) standardization project in 2016 [21]. After several evaluation rounds, NIST announced in July 2022 the first algorithms selected for standardization: CRYSTALS-Kyber as a key encapsulation mechanism and CRYSTALS-Dilithium as a digital signature scheme [22], [23], together with SPHINCS+ [24], a stateless hash-based signature system. These algorithms were formally adopted as Federal Information Processing Standards (FIPS) in 2024 [25]. The selections reflect the current consensus that lattice-based cryptography offers the most practical combination of efficiency and security, while SPHINCS+ was included to ensure diversification beyond lattice-based assumptions. Although quantum protocols are designed to provide information-theoretic security, practical implementations have revealed exploitable weaknesses. Side-channel attacks such as detector efficiency mismatch [26], time-shift strategies [27], and bright-illumination attacks [28] demonstrate that adversaries can manipulate devices without triggering disturbance detection. Fei et al. [29] showed that manin-the-middle attacks on calibration phase vulnerabilities can enable basis dependent efficiency mismatches that leak key information. Source side vulnerabilities have also been investigated: Trojan horse probing of transmitters allows adversaries to inject light and retrieve internal settings, while injection locking attacks can force lasers to operate under the attacker's influence [30]- [32]. Together, these findings show that quantum protocols cannot be regarded as intrinsically secure in practice, as weaknesses in physical components and other real world constraints create exploitable vulnerabilities. Various countermeasures against quantum side channel and device level attacks have been proposed, such as measurement device independent QKD and decoy state methods [33]- [35], but these remain an active area of research, and new approaches continue to be developed. In contrast, the protection of the classical channels that underpin the quantum communication protocols has received comparatively less attention, even though they represent a critical vulnerability. Ensuring the authenticity and confidentiality of reconciliation messages and coordination signals requires solutions capable of withstanding adversaries equipped with quantum computational capabilities. The security of the classical layer in the quantum era remains a missing link in current designs, and addressing this gap through post quantum cryptographic protocols is essential. The main challenges in deploying these protocols include achieving interoperability with existing infrastructure, balancing efficiency tradeoffs, and ensuring seamless integration with quantum specific operations, all of which are necessary steps toward building fully robust quantum networks [36], [37]."
    },
    {
      "heading": "II. Quantum Resistant Networks",
      "text": "A quantum network consists of nodes such as quantum processors, repeaters, or end user devices interconnected by quantum channels that distribute entanglement across the network (See Fig. 1). These quantum links enable protocols such as entanglement swapping and quantum teleportation. While quantum channels carry qubits and entanglement, the successful execution of network operations critically depends on classical communication. For example, in teleportation or entanglement swapping, the outcomes of Bell state measurements must be transmitted to remote nodes so that corrective operations can be applied [7]. Similarly, classical channels are indispensable for synchronization and control signaling across the network. Protecting this classical layer against adversaries equipped with quantum computers requires embedding post quantum cryptography (PQC) into each stage of the protocol stack. Without PQC, authentication and confidentiality of measurement outcomes, synchronization data, or routing messages would be vulnerable to interception or manipulation, undermining the security guarantees of the quantum layer itself. The challenge, however, is that PQC introduces computational overhead for encryption and decryption in addition to the intrinsic latency of classical message exchange. Because qubits must be stored in quantum memories while awaiting these classical signals, the timing of classical communication becomes tightly coupled to the coherence limits of available memory technologies."
    },
    {
      "heading": "Timing Constraints for PQC Protected Communication",
      "text": "In quantum networks, qubits are often stored in quantum memories while waiting for classical information needed to complete distributed operations such as teleportation or entanglement swapping. If the classical message arrives too late, the stored quantum state decoheres and the protocol fails. When post quantum cryptography (PQC) is used to protect classical communication, additional delay is introduced by cryptographic operations. To ensure correct functioning, the total delay must remain below the memory coherence time. a) Notation used in following equations: • T encrypt : time required to encrypt or authenticate the classical message before transmission. • T comm : classical communication delay, including propagation through the channel and processing in the network. • T decrypt : time required to decrypt or verify the received message. • T coh : coherence time of the quantum memory storing the qubit during the wait. • i: index of a repeater or round of communication. • P: set of repeaters whose Bell state measurement (BSM) results are sent to the end node. • L: number of dependent rounds of classical communication in a sequential protocol. b) Single-hop case: For a single sender-receiver pair, the qubit in memory must survive the combined time for encryption, transmission, and decryption: This form applies to simple two-node protocols such as quantum teleportation. c) Multi-hop with parallel communication: In repeaterbased networks, many BSMs may be performed simultaneously at different nodes, and their outcomes are broadcast in parallel. The end node must wait until the last relevant message arrives. The condition becomes Here, the maximum determines the constraint because all messages are sent simultaneously, and the slowest one sets the waiting time. d) Protocols with sequential signaling: Some protocols, such as certain entanglement purification or multi-round handshake schemes, may require multiple dependent rounds of classical communication. In such cases, the delays accumulate: This cumulative bound applies whenever each round must be completed before the next begins. In summary, the appropriate inequality depends on the protocol structure: the single-hop case for one-shot exchanges, the parallel case when multiple classical information are broadcast simultaneously, and the sequential case when classical messages must be exchanged in a round-by-round fashion. Designing PQC integration strategies that respect these timing constraints requires careful attention to cryptographic overheads. Practical approaches include minimizing encryption and verification latency, exploiting parallelism where protocol structure allows, and pre-establishing secure keys so that cryptographic operations do not lie on the critical path of quantum communication. Aligning PQC operations with quantum state preparation and memory usage is essential to ensure that the total classical delay remains within the coherence window. Addressing these challenges is necessary for quantum networks to be resilient against adversaries equipped with quantum computational capabilities."
    },
    {
      "heading": "PQC algorithm selection for heterogeneous network nodes",
      "text": "A single PQC algorithm will not be suitable for all scenarios in a large scale quantum resistant network. Different types of network nodes such as resource constrained quantum processors, high throughput quantum switches, and routers operating over satellite or fiber based communication channels require different PQC choices depending on their computational power, link latency, memory limits, and required security level. Edge nodes such as user terminals may prefer lightweight algorithms (for example, lattice based KEMs with smaller key sizes such as Kyber512) that minimize encryption and decryption times. In contrast, core nodes or quantum repeaters, which have greater processing capacity and stricter security requirements, can afford more computationally intensive algorithms such as FrodoKEM 1344. Selecting PQC algorithms therefore requires balancing key size, computational load, and expected attack complexity to match the capabilities and roles of heterogeneous devices in the network [38]."
    },
    {
      "heading": "Quantum Memory Hierarchy and Architectural Adaptations",
      "text": "A hierarchy of quantum memories is critical for integrating PQC while preserving overall network performance. Just as classical computing employs a tiered memory structure (cache, RAM, disk) to balance speed and capacity, quantum networks can utilize memories with different coherence times and access speeds at different layers. Long lived quantum memories, such as those based on trapped ions or error corrected logical qubits, are best suited for backbone nodes where repeaters must store entangled states while awaiting classical feedforward messages from neighboring links. In contrast, short lived quantum memories, such as photonic or atomic ensemble memories, can be used to buffer rapidly generated local entanglement between adjacent nodes, which is swapped forward almost immediately once both links succeed. This layered approach allows PQC protected classical communication to be processed within coherence constraints by aligning memory lifetimes with the expected classical delays at each level of the network [39]."
    },
    {
      "heading": "III. Man-In-The-Middle for hybrid quantum-classical network Hybrid Quantum-Classical Adversary Model",
      "text": "We consider a hybrid adversary capable of exploiting both the quantum and classical layers of the network. On the quantum side, the adversary may intercept qubits in transit and load them into a quantum memory, which requires a finite interception and storage latency denoted by T Eve . The stored qubits can only be preserved for the coherence time of the adversary's memory, T Eve coh . On the classical side, the adversary may manipulate coordination messages, such as teleportation corrections or entanglement swapping, by spoofing, delaying, or relaying PQC-protected communication. The additional delay introduced by these manipulations is denoted by T pqc . The total adversarial delay is therefore A man-in-the-middle attack can only succeed if the adversary is able to complete both the quantum interception and the classical manipulation before decoherence occurs, that is if If this bound is exceeded, the adversary's stored quantum states undergo decoherence, resulting in increased quantum bit error rates (QBER) or reduced entanglement fidelity, thereby making the intrusion detectable. By explicitly accounting for finite coherence times and PQC-induced delays, this model moves beyond earlier idealized assumptions and establishes a framework for analyzing realistic joint quantum-classical attack vectors in quantum networks."
    },
    {
      "heading": "Mitigation Strategies for Hybrid MITM Attacks",
      "text": "Robust defense against hybrid man-in-the-middle adversaries requires coordinated measures across both the quantum and classical layers [40]. All classical coordination traffic should be protected with post-quantum cryptographic authentication to prevent spoofing, replay, etc. To move beyond static threshold tests, anomaly detection techniques such as machine learning models trained on expected error patterns, fidelity distributions, timing statistics, etc., can provide early warning of subtle intrusions that might otherwise remain hidden. At the network level, robustness can be further enhanced through multipath routing of both quantum states and classical information, which forces an adversary to compromise multiple channels simultaneously. Taken together, these measures create a layered defense framework that significantly increases the cost and complexity of sustaining hybrid quantum classical attacks."
    },
    {
      "heading": "IV. Towards Securing Large Scale Quantum Networks PQC-Orchestrated Key Infrastructure at Scale",
      "text": "A robust Key Management System (KMS) is required to orchestrate network-wide key establishment and frequent re-keying, scaling from point-to-point links to multi-node topologies [41]. In a fully connected network, each node must exchange new keys with every other node, leading to H(N ) ∼ O(N 2 ) handshakes per re-key cycle. To control this growth, hierarchical or orchestrated key infrastructures can be employed, reducing complexity toward near-linear scaling. The design objective is to minimize T key (the time for key rotation) while keeping T auth low and H(N ) tractable as N grows. Achieving this balance ensures that the classical coordination layer of the quantum network remains quantum resistant without imposing prohibitive latency or overhead."
    },
    {
      "heading": "Physical Constraints to Secure Quantum Networks",
      "text": "Maintaining high-quality entanglement across long distances and heterogeneous links (optical fiber, free space, and satellite based channels) is a central challenge for largescale quantum networks. Routing protocols must incorporate entanglement swapping at intermediate nodes together with techniques such as entanglement purification or local error correction [42]. Two key constraints are the quantum memory coherence time T coh (the maximum time a stored qubit remains coherent) and the entanglement generation rate R e (the rate of producing entangled pairs per link). For secure operation, the total end-to-end entanglement distribution time T dist must remain below the coherence time, i.e., T dist < T coh , ensuring that stored pairs are still usable when multi-hop processes are completed. Synchronization across hops is also necessary so that multiple links generate entanglement within a common window, effectively requiring R e T coh ≫ 1, which guarantees that many attempts can succeed within one memory lifetime and reduces adversarial opportunities to exploit timing gaps. Another critical factor is the fidelity of the quantum state. The end-to-end fidelity F end of an L-hop entangled link decreases with each swap operation and is strongly constrained by the lowest-quality link or memory in the chain. Transmission losses, imperfect swapping, and memory decoherence degrade quantum states with time, and without active entanglement distillation they can quickly push F end below application thresholds. From a security standpoint, low fidelity not only limits performance but also obscures the distinction between natural noise and malicious interference, making adversarial actions harder to detect. Ensuring that fidelity remains above threshold is therefore essential for both reliable and secure operation of large-scale quantum networks."
    },
    {
      "heading": "V. Conclusion",
      "text": "This perspective discusses how achieving fully quantumresistant networks requires moving beyond treating cryptography, entanglement distribution, and network control as separate components. Future systems must integrate these elements into a unified architecture capable of sustaining end-to-end security under realistic timing and adversarial constraints. We have discussed how post-quantum cryptographic techniques can be embedded into protocol lifecycles, how a hybrid adversary model exposes vulnerabilities overlooked by traditional approaches, and how scalable routing together with machine learning methods can strengthen reliability. A fully quantum-resistant network will also depend on advances in quantum memory technologies, efficient PQC implementations, and coordinated control frameworks spanning heterogeneous infrastructures. At the same time, significant research challenges remain. Open problems include scaling deployment to ultra-long distances, maintaining robustness under high levels of noise, developing routing algorithms for complex and dynamic topologies, and mitigating failure scenarios such as repeater congestion under multi-user access. Addressing these issues is critical before quantum-resistant networking can move from conceptual proposals to practical, global-scale systems."
    }
  ]
}