{
  "paperid": "2106.05896v1",
  "title": "VLSI Systems for signal processing and communications",
  "authors": [
    "Kulkarni",
    "Kulkarni",
    "Maheshwari",
    "Singh",
    "Rabaey",
    "Pedram",
    "Catthor",
    "Rajgopal",
    "Sehgal",
    "Mozdzen",
    "Markovic",
    "Nikolic",
    "Brodersen",
    "Chandrakasan",
    "Sheng",
    "Brodersen",
    "Markovic",
    "Stojanovic",
    "Nikolic",
    "Horowitz",
    "Brodersen",
    "Parhi",
    "Yi",
    "Woods",
    "Ting",
    "Cowna",
    "Burleson",
    "Goeckel",
    "Isshiki",
    "Dai",
    "Basu",
    "Gupta",
    "Gupta",
    "Racanelli",
    "Kempf",
    "Joseph",
    "Hu",
    "Processing",
    "Hu",
    "Takagi",
    "Asada",
    "Yajima"
  ],
  "year": 2024,
  "abstract": "The growing advances in VLSI technology and design tools have exponentially expanded the application domain of digital signal processing over the past 10 years. This survey emphasises on the architectural and performance parameters of VLSI for DSP applications such as speech processing, wireless communication, analog to digital converters, etc",
  "sections": [
    {
      "heading": "",
      "text": "The organization of this paper is as follows. In Section 2, we research about evolution in the design and implementation of DSP systems. Section 3 mentions the performance parameters for choosing the optimal architecture with the highest functionality. Section 4 describes some major applications of VLSI in signal processing while section 5 provides a brief yet satisfactory conclusion to the survey. Section 6 enlists the references used in the survey paper. In general, design decisions regarding DSP system implementation require a balanced tradeoffs between these three system goals. As a result, an extensive variety of specialized hardware implementations and associated design tools have been developed for DSP including associative processing, bit-serial processing, on-line arithmetic, and systolic processing. As implementation technologies have become available, these basic approaches have advanced to meet the needs of application designers."
    },
    {
      "heading": "Evolution of",
      "text": "In the above table, various cost metrics have been developed to compare the quality of different DSP implementations. Performance has almost always been the most critical system requirement since DSP systems often have demanding real-time constraints. In the past three decades, however, cost has become more significant as DSP has transformed from predominantly military and scientific applications into numerous low-cost consumer applications. In the past decade, energy consumption has become an important measure as DSP techniques have been widely applied in portable, battery-operated systems such as cell-phones, CD players, and laptops [1]. Finally, flexibility has proved its significance as one of the key differentiators in DSP implementations since it allows changes to system functionality at various points in the design life cycle. Table 1 shows the results of these cost tradeoffs in four primary implementation options including applicationspecific integrated circuits (ASICs), programmable digital signal processors (PDSPs), general-purpose microprocessors, and reconfigurable hardware. Each implementation option specifies different trade-offs in terms of performance, cost, power and flexibility. The optimal system can be idenfied as per the end application."
    },
    {
      "heading": "Choosing an optimal architecture",
      "text": "Optimal VLSI architecture is technology dependent, which requires characterization of primary functional blocks for speed, power, and area. This information is used to steer the architectural optimization procedure that is based on balancing the algorithm throughput requirement with the capability of the underlying basic building blocks. Data throughput and latency are primary constraints in chip realizations. Data throughput is interesting for optimization since, for a given architecture, the throughput relates to the frequency of operation. [2] The key information that provides grounds for optimization is technology specific energy-delay tradeoff in datapath logic as shown in the below figure. This tradeoff exists because the energy needed to operate digital logic gates is influences their speed. The tradeoff is obtained by negotiating the design parameters such as gate size, supply and threshold voltage. Introduction of a new technology shifts the entire Energy-Delay curve towards lower energy and delay. The architecture is said to be energy optimal when the slope of its E-D tradeoff curve is similar to that of the underlying datapath logic. A good tradeoff point is indicated in figure below. Source: [2] By using the concepts of parallelism and time multiplexing, an algorithm can be mapped into a range of architectures with widely varying throughput and latency. Architectural transformations such as data-stream interleaving, loop retiming and folding enable more complex operations with concurrent or time-serial execution, which may involve feedback loops."
    },
    {
      "heading": "Parallelism & Time Multiplexing:",
      "text": "Parallelism along with adjustment in the supply voltage improves the energy by slowing down the clock and distributing computation power over several parallel branches computing together. [3] 2. Data-Stream Interleaving: Data-stream is a way of time multiplexing the data. Interleaving essentially improves the area efficiency by sharing data-path logic across the independent streams of data. [4] 3. Folding: Folding too reduces the area. However, it raises the issue of how to optimally distribute pipeline registers around the loop in order to maximize throughput. [5] 4. Loop Retiming: Loop retiming is a technique of distributing pipeline registers around recursive loops by assigning the right amount of latency to basic functional building blocks and then distributing the pipeline registers inside the blocks such that all internal datapath logic blocks lay at the same point. [6] 5. Delayed Iteration: Delayed iteration occurs when majority of loops have somewhat similar latency, while only a few loops need longer computation."
    },
    {
      "heading": "Reconfigurability",
      "text": "Most reconfigurable devices and systems contain SRAM-programmable memory to allow full logic and interconnect reconfiguration in the field. Despite a wide range of system characteristics, most DSP systems need reconfiguration under a variety of constraints.  Field customization-The reconfigurability of programmable devices allows periodic updates of product functionality on introduction of advanced vendor firmware versions or detection of product defects. Field customization is particularly essential in the face of changing standards and communication protocols. Unlike ASIC implementations, reconfigurable hardware solutions can be rapidly updated based on the application demands without requiring manual field upgrades or hardware swaps.  Slow adaptation-Signal processing systems based on reconfigurable logic may need to be periodically updated in the course of daily operation based on a number of constraints. These may include issues such as the ever changing weather and operating parameters for mobile communication and structural support for multiple, time-varying standards in stationary receivers.  Fast adaptation-Many communication processing protocols may benefit from rapid reset of computing parameters and require constant re-evaluation of operating parameters. [8] Some of these issues include adaptation to time-varying noise in communication channels, adaptation to network congestion in network configurations, and speculative computation based on changing data sets."
    },
    {
      "heading": "Parallelism",
      "text": "abundance of programmable logic smoothly facilitates the creation of a number of functional units directly in hardware. Certain characteristics of FPGA devices, in particular, make them especially the preffered choice for use in digital signal processing systems. The fine-grained parallelism found in these devices is at par with the high-sample rates and distributed computation often required of signal processing applications in image, audio, and speech processing. Plentiful FPGA flip flops and the motivation to achieve accelerated system clock rates have led designers to focus on heavily pipelined implementations of functional blocks and inter-block communication. Given the highly pipelined and parallel nature of many DSP tasks, such as image and speech processing, these implementations have exhibited remarkably better performance than standard PDSPs. In conclusion, these systems have been successfully implemented using both task and functional unit pipelining. [9] Referred to as Ring Connected Trees or RCT, a two-dimensional lattice of (NxN) PEs is used for an (NxN) RCT. In the proposed architecture, a parallel processing environment for signal processing is provided by the multiple processing elements working in a coordinated way to do the computation. Multiprocessing along with pipelining results in lower computation time and faster results. The machine was tested for the parallel working of a number of computation problems from the signal processing domain at the same time. RCT has better VLSI area complexity as compared to that of Mesh-of-Tree and has linear time performance for signal processing computations. This research largely misses out on signal processing applications like autocorrelation, IIR filtering, Hadamard transform, Walsh transform and also towards multidimensional cases. However, a tree-based architecture has some obvious advantages like simplicity and regularity, area-efficient VLSI design, embedded hierarchic organization, ease of mapping signal processing algorithms to Tree-based structures, etc. [10]"
    },
    {
      "heading": "A) Sigma Delta ADC",
      "text": "Nearly all the signals perceived naturally are continuous and hence analog in nature. These analog signals need to be converted to discrete time-discrete valued digital signals so as to be processed by digital computational systems. Analog-to-Digital (ADC) and Digital-to-Analog (DAC) converters are therefore quintessential for bit-conversion and processing of continuous data in any discrete digital system. Any analog signal is firstly sampled, then quantized to obtain its discrete form. One of the more advanced ADC technologies is the so-called delta-sigma, or ΔΣ (using the proper Greek letter notation). In mathematics and physics, the capital Greek letter delta (Δ) represents difference or change, while the capital letter sigma (Σ) represents summation. In a sigma-delta converter, the analog input The CORDIC architecture is efficiently coded using Verilog HDL. The architecture is pipelined to have an internal critical path of a single adder. To minimize angle approximations error, numbers of micro-rotations have been adjusted. To reduce the total quantization error including scale factor error, the pipelined CORDIC architecture has been optimized. [17] Source: [17] D) Speech Processing The low cost VLSI architectures come under use to deal with architecture to solve complex problems. In mobile phones speech processing plays a crucial role in solving complex DSP procedures as these involve, speech recognition, noise suppression, silence detection, pitch analysis and many more. FPGA is recommended for low price VLSI which is also widely used in the market. Here there is a specific architecture for suppressing surrounding noise in the mobile communication.  In case of noisy speech pertaining to nonparametric model based methods, noise is estimated and removed from degraded using subtractive algorithms.  FIR filters crucially influence the operation and performance in noise estimation and thereby on the complete system. To process real time signals it is necessary to design filters with low power operation for a given throughput requirement. Efficient Filters can be designed using a MAC circuit that consumes less processing time and less hardware. Implementation of FIR in FPGA can be a simple MAC, Parallel or Semi-Parallel, and Multi-channel FIR."
    },
    {
      "heading": "Conclusion",
      "text": "The increased complexity of VLSI systems processing are thus the parameters to look out for while developing a VLSI system for application in signal processing."
    }
  ]
}