{
  "paperid": "2305.09923v1",
  "title": "Robust Power Allocation for Integrated Visible Light Positioning and Communication Networks",
  "authors": [
    "Ma",
    "Yang",
    "Du",
    "Li",
    "Wu",
    "Al-Dhahir",
    "Li",
    "Farahsari",
    "Farahzadi",
    "Rezazadeh",
    "Bagheri",
    "Alam",
    "Faulkner",
    "Parr",
    "Kamalakis",
    "Ghassemlooy",
    "Zvanovec",
    "Alves",
    "Memedi",
    "Dressler",
    "Matheus",
    "Vieira",
    "Vieira",
    "Vieira",
    "Gnawali",
    "Luo",
    "Fan",
    "Li",
    "Keskin",
    "Sezer",
    "Gezici",
    "Zhang",
    "Duan",
    "Fu",
    "Shi",
    "Alam",
    "Faulkner",
    "Legg",
    "Demidenko",
    "Du",
    "Zhang",
    "Chen",
    "Yang",
    "Zhong",
    "Zhang",
    "Alphones",
    "Yang",
    "Sun",
    "Zhuang",
    "Huai",
    "Hua",
    "Chen",
    "Li",
    "Cao",
    "Chen",
    "Eroglu",
    "Ggvenc",
    "Pala",
    "Yüksel",
    "Sun",
    "Duan",
    "Zou",
    "Shi",
    "Gu",
    "Aminikashani",
    "Deng",
    "Kavehrad",
    "Du",
    "Zhang",
    "Chen",
    "Alphones",
    "Zhong",
    "Keskin",
    "Gezici",
    "Arikan",
    "Lin",
    "Zhang",
    "Lin",
    "Tang",
    "Ghassemlooy",
    "Lin",
    "Li",
    "Chen",
    "Fan",
    "Wang",
    "Lu",
    "Jin",
    "Feng",
    "Chen",
    "Xue",
    "Wang",
    "Shi",
    "Béchadergue",
    "Chassagne",
    "Guan",
    "Shao",
    "Salustri",
    "Khreishah",
    "Xu",
    "Ma",
    "Jin",
    "Lu",
    "Wang",
    "Huang",
    "Feng",
    "Chen",
    "Chen",
    "Dong",
    "Su",
    "Wang",
    "Yang",
    "Du",
    "Zhong",
    "Chen",
    "Alphones",
    "Zhang",
    "Xu",
    "Wang",
    "Liu",
    "Chen",
    "Han",
    "Yu",
    "Yu",
    "Yang",
    "Chen",
    "Zhong",
    "Alphones",
    "Zhang",
    "Du",
    "Yang",
    "Zhong",
    "Chen",
    "Alphones",
    "Du",
    "Zhang",
    "Xie",
    "Yang",
    "Zhong",
    "Chen",
    "Alphones",
    "Du",
    "Pal",
    "Dash",
    "Joshi",
    "Ghose",
    "Ma",
    "Yang",
    "Li",
    "Chen",
    "Li",
    "Wu",
    "Safari",
    "Li",
    "Al-Dhahir",
    "Kahn",
    "Barry",
    "Fath",
    "Haas",
    "Wang",
    "Sekercioglu",
    "Armstrong",
    "Cengiz",
    "Wang",
    "Leus",
    "Huang",
    "Lottici",
    "Ándrea",
    "Mengali",
    "Gezici",
    "Tian",
    "Giannakis",
    "Kay",
    "Cheung",
    "So",
    "Ma",
    "Chan",
    "Chan",
    "Hang",
    "Ching",
    "Cheung",
    "Ma",
    "So",
    "Wei",
    "Wan",
    "Chen",
    "Ye",
    "Gustafsson",
    "Gunnarsson",
    "Torrieri",
    "Keskin",
    "Sezer",
    "Gezici",
    "Poor",
    "Ma",
    "Yang",
    "Li",
    "Dong",
    "Gu",
    "Li",
    "Grant",
    "Boyd",
    "Wang",
    "So",
    "Chang",
    "Ma",
    "Chi",
    "Ma",
    "He",
    "Dai",
    "Zhang",
    "Li",
    "Li",
    "Zymler",
    "Kuhn",
    "Rustem",
    "Zhang",
    "Li",
    "Gao",
    "Han",
    "Zhou",
    "Palomar",
    "Luo",
    "-K. Ma",
    "So",
    "Ye",
    "Zhang",
    "Jungnickel",
    "Pohl",
    "Nonnig",
    "Helmolt",
    "Chen",
    "Shu",
    "Ma",
    "Li",
    "He",
    "Yang",
    "Lu",
    "Cao",
    "Li"
  ],
  "year": 2023,
  "abstract": "Integrated visible light positioning and communication (VLPC), capable of combining advantages of visible light communications (VLC) and visible light positioning (VLP), is a promising key technology for the future Internet of Things. In VLPC networks, positioning and communications are inherently coupled, which has not been sufficiently explored in the literature. We propose a robust power allocation scheme for integrated VLPC Networks by exploiting the intrinsic relationship between positioning and communications. Specifically, we derive explicit relationships between random positioning errors, following both a Gaussian distribution and an arbitrary distribution, and channel state information errors. Then, we minimize the Cramer-Rao lower bound (CRLB) of positioning errors, subject to the rate outage constraint and the power constraints, which is a chanceconstrained optimization problem and generally computationally intractable. To circumvent the nonconvex challenge, we conservatively transform the chance constraints to deterministic forms by using the Bernstein-type inequality and the conditional value-atrisk for the Gaussian and arbitrary distributed positioning errors, respectively, and then approximate them as convex semidefinite programs. Finally, simulation results verify the robustness and effectiveness of our proposed integrated VLPC design schemes.",
  "sections": [
    {
      "heading": "I. INTRODUCTION",
      "text": "As predicted by Cisco, over 500 billion Internet of Things (IoT) devices will be connected to the Internet globally by 2030, and about 80% of the mobile traffic occurs in indoor environments [1]. This would also lead to growing demands for indoor location-based services, which are supported by accurate positioning and high data rates [2], [3]. The related applications include smart manufacturing, safety monitoring, logistics management, and indoor navigation. For indoor environments, the global navigation satellite system (GNSS) signals are usually weak due to the multipath effect and signal blocking. Meanwhile, conventional radio frequency (RF) based indoor positioning approaches, e.g., Wi-Fi, radio frequency identification (RFID), and ultra-wideband (UWB), generally suffer from electromagnetic interference, sensitivity to the changing environment, and multipath effects. Besides, the RF spectrum scarcity is also a challenging issue as the number of electronic devices sharing it becomes large. Visible light positioning and communications (VLPC) provide alternative solutions for indoor location-based services. At present, most of the existing works study visible light positioning (VLP) and visible light communications (VLC) separately [2]- [6]. Some recent advances in integrated VLPC S. Ma is with the Peng Cheng Laboratory, Shenzhen 518055, China. (email: mash01@pcl.ac.cn) networks motivate us to investigate a unified system, capable of fulfilling the requirements of both positioning and communications [7], [8]. Specifically, in the integrated VLPC network, both the positioning and communication operations can be jointly optimized via the shared use of a single hardware platform and a joint signal processing framework. Owing to its inherent advantages, including, but not limited to, no electromagnetic interference, low multipath effects, and low deployment cost, integrated VLPC networks have drawn more and more research attention in both industrial and academic communities. For VLP, there are many positioning algorithms based on received signal strength (RSS) [9]- [12], hybrid RSS/angle of arrival (AOA) [13], time of arrival (TOA) [14], time difference of arrival (TDOA) [15], [16] and the maximum likelihood estimators [17]. In [18], a position estimation deep neural network (PE-DNN) aided VLC receiver was designed to achieve data transmission and location positioning simultaneously. In [19], the authors experimentally demonstrated an indoor VLC and a VLP system using the orthogonal frequency division multiple access (OFDMA). The integrated VLPC system also was proposed by other different modulations or signal processing, such as code division multiple access (CDMA) [20], m-CAP [21], retroreflectors [22], and adaptive feedback threshold [23]. Based on the reinforcement learning framework, an intelligent resource allocation scheme was studied in [24] for integrated VLC and VLP systems, where the sum rate is maximized subject to the constraints of minimum data rates and positioning accuracy. In [25], an OFDMA-based integrated VLPC system was proposed to estimate the receiver's position based on the power of the data sequence. By using filter bank multicarrier-based subcarrier multiplexing (FBMC-SCM) and phase difference of arrival, the authors in [26] experimentally tested the integrated VLPC system. Based on FBMC-SCM, a joint subcarrier and power allocation method was presented in [27] for multi-cell integrated VLPC systems to maximize the sum rate under both the minimum data rate and positioning accuracy constraints. For the integrated VLPC IoT network [28], the authors jointly optimized AP selection, bandwidth allocation, adaptive modulation, and power allocation to maximize the data rate. Note that, in the above existing literature, the estimated position information is not fully utilized in the data transmission. In [29], the relationship between channel gain distributions and UE's position and orientation was studied, and the symbol error probability was derived based on the least-square channel estimation and channel gain distributions, while the relationship between positioning and communication performance is not revealed. In [30], the intrinsic relationship • Based on the derived the Cramer-Rao lower bound (CRLB) of VLP and achievable rates of VLC, we describe the relationship between positioning errors and channel estimation errors for the integrated VLPC network, and there exists an optimal tradeoff relationship between the VLP and VLC. On the one hand, VLP can enhance VLC, i.e., location information can be used to increase the information transmission signal-to-noise ratio (SNR) and rate. On the other hand, VLP and VLC are mutually restricted. Both positioning accuracy and communication rate depend on the allocated power. Moreover, positioning accuracy affects channel estimation error, and channel estimation error further affects the communication rate. To our best knowledge, this inherent coupling between VLP and VLC is revealed for the first time. • Next, we propose a robust power allocation optimization framework to minimize the CRLB of VLP subject to the rate outage chance constraint and the optical and electrical power constraint. This chance-constrained optimization problem is generally intractable. Meanwhile, due to the matrix inverse, the problem usually is nonconvex, which make the problem more challenging. -For Gaussian distributed positioning errors, we conservatively transform the chance constraint to a deterministic form, based on the Bernstein-type inequality to circumvent the intractability of the chance constraints. Furthermore, the non-convex deterministic form constraints are approximated by a convex form based on the matrix norm feature. -Arbitrary distributed positioning errors are a more practical scenario to cover Gaussian and non-Gaussian distributions, where only the mean and variance are known, but the distribution form is uncertain. To tackle a variety of the chance constraint on the uncertainty set, the worst-case distribution of the Conditional Value-at-Risk (CVaR) is conservatively approximated to a more tractable form. Then, by adopting successive convex approximation (SCA), the joint nonconvex optimization problem can be transformed into a series of convex subproblems. Finally, both of these probability-constrained problems can be reformulated as a convex semidefinite program (SDP), which can be solved by the interior point method. The rest of this paper is organized as follows. We present the VLPC system model in Section II. The key performance metrics for the VLPC system are derived in Section III. In Section IV, we investigate the chance-constrained robust integrated VLPC design. Extensive simulation results are presented in Section V. Section VI concludes the paper. Moreover, Tables I and II present the main acronyms and the key notations of this paper, respectively. Notations: Boldfaced lowercase and uppercase letters represent vectors and matrices, respectively. M {1, . . . , M }."
    },
    {
      "heading": "Tr (•) and (•)",
      "text": "T denote the trace and transpose of a matrix, respectively. I denotes the identity matrix. S n represents the space of n-dimensional real symmetric matrices. R n represents the space of n-dimensional real vectors. 0 is a column vector where all elements are 0. • denotes the norm of a vector or the 2-norm of a matrix. • F denotes the Frobenius norm of a matrix. TABLE I: Summary of Main Acronyms Notation Description VLP Visible light positioning VLC Visible light communication VLPC Visible light positioning and communication UE User equipment RSS Received signal strength CRLB Cramer-Rao lower bound CSI Channel state information SNR Signal-to-noise ratio SDP Semidefinite program CVaR Conditional Value-at-Risk SCA Successive convex approximation II. SYSTEM MODEL As illustrated in Fig. 1(a), consider an integrated VLPC network that includes a central controller, M ≥ 3 noncollinear LEDs, photodetector-based user equipment (UE), such as robots and automated guided vehicles move on the factory ground, where u T denote the locations of the UE and the i-th LED (i ∈ M), respectively. The center controller connects all LEDs and controls the transmit signal of each LED. It also can tackle and share information from all LEDs and uplinks. Without loss of generality, characteristics of the LEDs and the UE's photodetector (PD) can be known by measurement or sensors. To simplify the analysis, we assume that the M LEDs are identical, the orientation of the UE's PD is upward, all LED orientation is downward, and all LED positions are exactly known. To avoid interference among different functions, the communication frame of the system includes a downlink positioning subframe, a downlink data subframe, and an uplink subframe with different frequencies f p,i , i ∈ M, f c and f Uplink , respectively, as shown in Fig. 1(b). This structure can TABLE II: Summary of Key Notations Notation Description p p Allocated positioning power vector P p,i Allocated positioning power for i-th LED P c Allocated communication power P total Maximum total power u Location vector of UE û Estimated location vector of UE e p Positioning error vector v i Location vector of i-th LED g i CSI between i-th LED and UE ĝi Estimated CSI between i-th LED and UE ∆g i CSI estimation error between i-th LED and UE i * Index of the data-transmission LED T p Duration of the positioning subframe J u (p p ) Fisher information matrix R c , R L VLC achievable rate and its lower bound P Set of distributions for ∆g i * r Minimum rate requirement P out Maximum tolerable outage probability M Set of the LED's index be implemented by the classical frequency-division multiple access. Besides, the allocated frequencies f p,i is an ID of ith LED to distinguish the source of the positioning signals. For the positioning subframe with the duration T p , M LEDs simultaneously transmit positioning signals to the UE, which can estimate the RSS. Although the center controller can use the RSS information to calculate the UE's location, the issues of the UE privacy and the computing load at the center controller make it reasonable that the UE directly undertakes all the computation tasks. Thus, we assume that the UE is powerful enough to perform the positioning, channel state information (CSI) estimation, and the joint power allocation for the next subframe. In the uplink feedback subframe, the UE only feeds back the CSI and the result of the power allocation to the center controller by infrared communications or RF communications. Finally, the center controller deploys the power allocation results, and selects the LED with the best CSI to transmit data to the UE during the next downlink data subframe. The model can be extended into the multi-UE scenario through a proper multiple-access protocol, which can refer to the classical theory of multi-user networks. For example, based on the TDMA, each UE will be independently served at the allocated slot, which is equivalent to the single-UE case."
    },
    {
      "heading": "A. Downlink Positioning Subframe",
      "text": "In the positioning subframe, the UE estimates the RSS based on the received signals from LEDs. Specifically, for t ∈ [0, T p ], the i-th LED transmits the positioning symbol s p,i (t), where -A ≤ s p,i (t) ≤ A, E {s p,i (t)} = 0, E s 2 p,i (t) = ε, A > 0 and ε > 0. For brevity, we drop the time index t throughout the paper, where s p,i (t) is denoted by s p,i . Hence, the transmitted positioning signal x p,i of the i-th LED is given as where P p,i indicates the allocated positioning power of the i-th LED, and I DC > 0 denotes the direct current (DC) bias. At the UE side, the received light is detected by the PD and usually travels via the line of sight (LOS) and diffuse links, and a DC blocking circuit is adopted to filter the DC component. The received positioning signal y p,i from the i-th LED can be expressed as where g i is the channel gain between the i-th LED and the UE, and n p,i is the zero-mean Gaussian noise N 0, σ 2 p . Generally, the channel gain g i can be decomposed as where g i,LOS and g i,diffuse are the channel gains of the LOS and diffuse links between the i-th LED and the UE, respectively. For the LOS link, the channel gain g i,LOS is given by [31] where m ln 2 ln cos φ 1 2 is the Lambertian index of the LED, φ 1 2 denotes the semi-angle, A R is the effective area of PD, η c is the electric-optical conversion coefficient, η ℓ is the optical-electric conversion coefficient, ψ FoV indicates the FoV of PD, d i denotes the distance from the i-th LED to the UE, φ i denotes the angle of irradiance of the i-th LED, and ψ i denotes the angle of the PD incidence from the i-th LED. On the other hand, the CSI of the diffuse links is always unknown, and the gain of the LOS link is significantly higher than that of the diffuse link [32], [33]. Therefore, to simplify the analysis, we assume that the diffuse links can be ignored, and only the LOS link needs to be considered, i.e., g i = g i,LOS . Finally, according to the frequency components of the received positioning signal, the UE can detect which LED is in the UE's FoV and estimate the RSS. Let M ⊂ M denote the set of the received LED's index, and p y u, T ∈ R M denote the power vector of the received signals {y p,i } i∈ M from the M received LEDs to the UE, where p y,i = E y 2 p,i . Without loss of generality, we assume that P p,i = 0, i / ∈ M."
    },
    {
      "heading": "B. Positioning and Channel Estimation",
      "text": "When at least 3 non-collinear LEDs can be received, using the RSS-based positioning method, the UE's location estimation can be transformed into a RSS-related estimation problem. For example, utilizing the least squares method [34], the positioning result of the UE can be solved by û = arg min û p y u, where p ŷ û, {v i } i∈ M denotes the corresponding received power vector at the UE's Location û ∈ R 3 . Thus, the positioning error e p is defined as Generally, the positioning error e p is assumed to follow two typical probability distribution models: Gaussian distribution and arbitrary distribution. • Gaussian distribution: If only the mean and variance are known, the Gaussian distribution can maximize the entropy of the uncertain parameter without additive constraints. This model has been adopted in [35]- [37] because the CRLB is asymptotically achieved by the maximum-likelihood (ML) estimator even for finite data size [38], [39]. • Arbitrary distribution: The location estimators based on approximate ML [40], [41], and multidimensional scaling (MDS) [42] can also achieve the CRLB. However, the estimation errors do not necessarily follow a Gaussian distribution [35], [43]. In this case, although the distribution of the position error e p is unavailable, its mean and variance also can be assumed to be known [35], [42], [44]. Based on the RSS p y u, {v i } i∈ M and the signal {x p,i } i∈ M, we can select the i * -th LED to transmit the downlink data, which is assumed to correspond to the maximum channel gain, i.e., and the corresponding LED location is If only the LOS link is considered, according to the channel model ( 4), the estimated CSI ĝi * between the i * -th LED and the UE is given by where µ = (m+1)ARηcη ℓ 2π . Due to the positioning error e p , the channel estimation ( 7) is imperfect. The corresponding estimated CSI error ∆g i * between the i * -th LED and the UE is defined as follows Based on ( 7) and ( 8), the channel estimation error ∆g i * is given as Therefore, ∆g i * is a function of e p , i.e., ∆g i * = f (e p ) . Based on the result of positioning and channel estimation, the UE can solve the expected power allocation of each LED to optimize the performance of the integrated VLPC system, and the power allocation result can be fed back to the central controller by the uplink. The designed robust power allocation scheme in this paper will be presented in the following section."
    },
    {
      "heading": "C. Downlink Data Subframe",
      "text": "During the downlink data subframe, the i * -th LED transmits the data symbol s c to the UE, where -A ≤ s c ≤ A, E {s c } = 0, and E s 2 c = ε. Then, the transmitted data signal x c of the i * -th LED is given by where P c indicates the allocated power of the i * -th LED. In addition, because the i * -th LED simultaneously transmits the data and positioning signal, the practical transmitted signal can be represented by Then, the received data signal y c from the i * -th LED is given as where is the received noise, and n c is independent of {n p,i } M i=1 . To ensure that the transmitted signals of VLC are nonnegative, i.e., x p,i ≥ 0 and x i * ≥ 0, the positioning signal power P p,i in (1) and the communication signal power P c in (10) are, respectively, constrained by For eye safety and practical illumination requirements, the maximum optical power of VLC signals should also be limited, i.e., x p,i ≤ P max o , x i * ≤ P max o , where P max o denotes the maximum optical power of each LED. According to (1) and (10), P p,i and P c are, respectively, limited by Due to the limited power budget of the practical electrical circuit, the average electrical powers of the signal x p and signal x i * are also constrained, i.e., where P max e denotes the maximum electrical transmitted power. By combining constraints ( 13), ( 14) and (15), P p,i and P c are constrained by where Pp min . Meanwhile, considering the limited load capability in practical circuits, the total power of a VLPC integrated system should be constrained, i.e., i∈ where P total denotes the maximum total power of the VLPC integrated system."
    },
    {
      "heading": "III. TRADEOFF BETWEEN POSITIONING AND COMMUNICATION",
      "text": "In this section, we first present the performance metric for positioning and communication, and then we discuss their tradeoff."
    },
    {
      "heading": "A. CRLB of VLP",
      "text": "In this paper, we adopt the CRLB as the performance metrics for quantifying the localization accuracy of the UE [45]- [47]. The CRLB can be achieved by the unbiased estimator since VLC links inherently offer high SNR due to the short transmission distance with the dominant LOS path. Specifically, we first fix the height of the UE, and focus on the two-dimensional location estimation. Let u = [x u , y u ] T denote the arbitrary UE location vector, and the vertical height z u is a known constant perfectly, i.e., z u = ẑu . Based on the received signal (2), the log-likelihood function of the received signal y p,i is given as where k is a constant and is independent of u. Moreover, let J u (p p ) denote the Fisher Information matrix (FIM) of u, which is a function of the positioning power p p = [P p,1 , . . . , P p,M ] T . Specifically, the FIM J u (p p ) is given as ∂gi ∂xu ∂gi ∂xu εTp σ 2 p i∈ M P p,i ∂gi ∂yu ∂gi ∂xu εTp σ 2 p i∈ M P p,i ∂gi ∂xu ∂gi ∂yu εTp σ 2 p i∈ M P p,i ∂gi ∂yu ∂gi ∂yu    , where The derivations of ( 19) are given in Appendix A. Thus, the variance of the zero-mean positioning error e p is lower bounded by the CRLB [45], i.e.,"
    },
    {
      "heading": "B. Achievable Rates of VLC",
      "text": "Let R c denote the achievable rate of the UE in the downlink data subframe. Based on the received signal (12), R c is lower bounded by where the inequality (22b) holds because of the entropy power inequality (EPI), and (22c) holds since s c follows the ABG distribution that can achieve the maximum differential entropy [48]. Here, the ABG distribution of signal s c is given by where the parameters α, β, γ are the solutions of the following equations √ πe β e A(β-γA)e -A(β+γA)e 1+α = 0, (24b) where erf (x) dt is the error function."
    },
    {
      "heading": "C. Tradeoff Between Positioning and Communication",
      "text": "The CSI estimation error ∆g i * affects the achievable rate R c . Furthermore, since ∆g i * = f (e p ) and e p depend on the positioning signal power {P p,i }, the achievable rate R c not only depends on the communication signal power P c , but also depends on the positioning signal power {P p,i }. Therefore, there exists an optimal tradeoff between communication power P c and positioning power P p,i for the integrated VLPC system design."
    },
    {
      "heading": "IV. ROBUST INTEGRATED VLPC DESIGN",
      "text": "For any given distribution of the positioning errors, it is hard to design an integrated VLPC scheme for the UE, which always meets the positioning or throughput requirements due to the unbounded errors. However, it is reasonable to make a robust design within the tolerance of uncertainty in practice. In this section, we investigate a chance-constrained robust integrated VLPC design for the two types of positioning error distributions: Gaussian distribution and arbitrary distribution. Specifically, by exploiting the relationship between positioning errors and CSI errors, we focus on designing a VLPC power allocation scheme to minimize the CRLB of VLP under the QoS chance constraint and power constraints."
    },
    {
      "heading": "A. VLPC Design With Prefect CSI",
      "text": "Under the minimum rate requirement, the optical and electrical power constraints, the optimal VLPC power allocation to minimize the CRLB of VLP with perfect CSI can be formulated as follows: s.t.(16a), (16b), ( 17) where r denotes the minimum rate requirement. After replacing the constraint (25b) with a more stringent constraint R L ≥ r, problem (25) can be rewritten as a convex programming problem, which can be solved by standard optimization solvers such as CVX [49]. In addition, (25) also corresponds to the nonrobust design ignoring the coupling between the positioning error e p and the estimated CSI error ∆g. The optimal communication power and positioning power are denoted by P * c and p * p , respectively."
    },
    {
      "heading": "B. Robust VLPC Design with Gaussian Distributed e p",
      "text": "Considering the relationship between ∆g and e p , we propose the outage chance constraint to handle the minimum rate requirement (25b). When e p follows the Gaussian distribution, the corresponding chance-constrained VLPC programming problem can be stated as s.t.(16a), (16b), ( 17) where P out denotes the maximum tolerable outage probability. The robust integrated VLPC design problem ( 26) is nonconvex and computationally intractable. The main challenge lies in the chance constraint (26b), which does not admit closedform expressions. In order to handle the chance-constrained problem (26), we first reformulate the chance constraint (26b). Based on the lower bound of the achievable rate (22c), the probability constraint (26b) can be conservatively transformed into the following constraint Specifically, the constraint R L ≥ r can be equivalently reformulated as where δ . Then, by substituting u = û + e p into (28), we have Moreover, the positioning error e p can be rewritten as e p = J -1 2 u (p p ) êp , where êp ∼ N (0, I). Then, the chance constraint (26b) can be reformulated as where Furthermore, to reformulate the chance constraint (30) into a deterministic form, we invoke the Bernstein-type inequality in Lemma 1. Lemma 1 [50] [51]: Let L = x T Bx + 2x T b, where B ∈ R N ×N is a real symmetric matrix, b ∈ R N ×1 and x ∼ N (0, I). Then, for any η ≥ 0, we have where λ + (B) = max {λ max (B) , 0} and λ max (B) is the maximum eigenvalue of matrix B. According to the Bernstein-type inequality, the chance constraint (30) can be conservatively transformed into the following constraint where η =ln (P out ). Furthermore, constraint (32) can be equivalently reformulated as where ω and ρ are slack variables. Note that constraint (33a) is convex, but constraints (33b) and (33c) are nonconvex because the matrix inverse is non-convexity-preserving. To tackle this issue, constraints (33b) and (33c) can be transformed to convex forms by exploiting the eigenvalue and singular value properties. Specifically, the left-hand side of constraint (33b) can be approximated as where σ max (•) denotes the maximum singular value, and the first inequality is due to √ a 2 + b 2 ≤ a + b, a ≥ 0, b ≥ 0, and the second inequality is because the norm is equal to the sum of all singular values. Because the FIM is invertible and semidefinite, we have where λ min (•) denotes the minimum eigenvalue of the matrix. Thus, an upper bound on the left-hand side of constraint (33b) can be derived, and constraint (33b) can be rewritten with a convex form as follows Meanwhile, because the positive semidefinite matrix means that its minimum eigenvalue is nonnegative, constraint (33c) can be transformed to a concave form as follows Thus, problem (26) can be reformulated as s.t. (16a), (16b), ( 17), (33a), ( 36), (37). Problem ( 38) is a convex semidefinite program (SDP), which can be solved by standard optimization solvers such as CVX [49]."
    },
    {
      "heading": "C. Robust VLPC Design with Arbitrary Distributed e p",
      "text": "In this subsection, we investigate a more practical robust VLPC design scenario, where the central controller has no prior knowledge of the distribution of the position error e p except for its first and second-order moments, i.e., only the mean and variance of e p are known. Specifically, although the distribution of e p is arbitrary, the positioning error variance can achieve the CRLB, i.e., E e p e T p = J -1 u (p p ), and the mean of e p is zero, i.e., E {e p } = 0. With the arbitrary distributed e p , we aim to minimize the CRLB of VLP by optimizing the power allocation subject to the VLC chance constraint and power constraints. Mathemati-cally, the robust VLPC problem can be formulated as follows: (27), ( 17), (16a), (16b). Problem (39) appears to be more challenging than problem (26) since less information about the distribution of e p is known. To reformulate the intractable chance constraints to computationally tractable constraints, (26b) can be equivalently expressed as Furthermore, the chance constraint ( 40) can be transformed into a distributionally robust chance constraint, which is given by where inf P∈P Pr {•} denotes the probability lower bound under the probability distribution P and P is called the ambiguity set, which includes all the possible position error distributions. Lemma 2 [52], [53]: Consider a continuous loss function L : R k → R that is concave or quadratic in ξ. The distributionally robust chance constraint is equivalent to the worst-case constraint, which is given by where P-CVaR ǫ {L (ξ)} is denoted as the CVaR of L (ξ) at the threshold ǫ with respect to P, defined as Moreover, R is the set of real numbers and (z) and β ∈ R is an auxiliary variable introduced by the CVaR. Lemma 3 [52], [53]: Let L (ξ) = ξ T Qξ + q T ξ + q 0 be a quadratic function of ξ, ∀ξ ∈ R n . The worst-case CVaR can be computed as where M and β ∈ R are the auxiliary variables, and Ω is a matrix defined as where µ ∈ R n and Σ ∈ S n are the mean and covariance matrix of random vector ξ, respectively. The arbitrary distributed positioning error e p makes the chance constraint lower bound intractable. However, a CVaRbased method can overcome this challenge effectively, which is known as a good convex approximation of the worst-case chance constraint [52], [53]. As is described by Lemmas 2 and 3, for the continuous quadratic function L (ê p ) êT p Bê p + 2b T êpδ b , the distributionally robust chance constraint (41) can be made equivalent to the worst-case CVaR constraint as follows: where M and β ∈ R are two auxiliary variables, and Ω = I 0 0 T 1 . The successive convex approximation (SCA) based on the first-order Taylor expansion can be exploited to process the nonconvex constraint (46c). The first-order Taylor expansion of the terms J -1 u (p p ), J c is substituted into (46c) to find an affine approximation, which is given by where B, b and δb denote the approximations of B, b and δ b through Thus, the chance-constrained problem (39) can be reformulated as follows s.t. (16a), (16b), ( 17), (46a), (46b), (47). For any known p p,0 and P c,0 , the joint optimization problem (49) becomes the convex SDP, which can be solved by standard convex programming solvers such as CVX [49]. Toward this end, we transform problem (49) into a series of convex subproblems, which can be solved efficiently through iterations. At the t-th iteration, the corresponding convex subproblem is given as (16a), (16b), ( 17), (46a), (46b), (47). Then, the iterations repeat until the termination condition is satisfied, and the optimal solutions p p,0 and P c,0 are output. The details of the robust integrated VLPC method for the arbitrary distributed e p are summarized as Algorithm 1. The proposed SCA algorithm can converge to a stationary point of the original problem after using the CVaR-based method [54]. At each iteration, the subproblem (50) can be efficiently solved with a worst-case complexity O (M + 11) 4.5 log (1/δ) , where δ > 0 is the accuracy of the interior-point method [49], [55]. Algorithm 1 Robust integrated VLPC for the arbitrary distributed e p . Input: Given ǫ ≥ 0, t = 1, c (0) = ∞, choose proper p p,0 , P c,0 , and set r and, P out ; 1: repeat 2: Solve problem (50a) to obtain p p , P c , and calculate CRLB;"
    },
    {
      "heading": "3:",
      "text": "Set p p,0 = p p , P c,0 = P c , c (t) = CRLB; ≤ ǫ. Output: Output the optimal solutions p p and P c ."
    },
    {
      "heading": "V. NUMERICAL RESULTS",
      "text": "This section presents numerical results to show the proposed robust power allocation schemes for the integrated VLPC system. We consider an indoor VLPC system installed with multiple LEDs on the ceiling, where the room height is 2.5 m, and a corner of a square room denotes the origin (0, 0, 0) of a three-dimensional Cartesian coordinate system (X, Y, Z). The receiver's location is (1.1, 1.2, 1.5) m, and four numbers of transmitters are considered, namely, 3 LEDs, 4 LEDs, 5 LEDs, and 6 LEDs, where their locations are shown in Fig. 2. According to the channel model (4), it can be verified that all LEDs are within the UE's FoV. The signal s c is assumed to be drawn from a uniform distribution U (-0.1, 0.1), i.e., A = 0.1, α = ln 2 √ 0.1 -1, β = γ = 0. Without loss of generality, we assume that the total power is P total = 3 min Pp , Pc . According to [27], [28], [45], the other simulation parameters are listed in TABLE III. TABLE III: Simulation Parameters. Definition Value Lambertian index, m 1 Angle of FoV, ψ FoV"
    },
    {
      "heading": "A. Cumulative Distribution Functions of Communication Rates",
      "text": "We first evaluate the robust performance of the proposed power allocation schemes by Monte Carlo simulation, and the cumulative distribution functions (CDF) of the achievable data rate R c are presented in Fig. 3 and Fig. 4. In the initial stages, there is only a DC signal at each LED to provide illumination and positioning, i.e., P c = 0, P p,i = min P total M, Pp . Then, the 10000 random samples of the positioning error e p are independently generated based on the distribution N 0, J -1 u (p p ) . The estimated location û can be derived by (5). Finally, the result of power allocation is fed into a practical simulation environment to evaluate the achievable data rate R c . Besides, the mean of û is considered as the replacement of the actual location u in problems ( 25), (28), and (39). Meanwhile, the proposed schemes are also verified by both LOS and diffuse links (LOS+diffuse). According to the classical optical wireless channel model [56], the channel impulse response h (t) is given by where η i,diffuse is the power efficiency of the diffuse link, τ denotes the exponential decay time, ∆T is the delay between the LOS signal and the diffuse signal, δ (•) is the Dirac function, and u (•) is the unit step function. We assume that g 2 i,LOS η 2 i,diffuse = 12dB, τ = 15ns, and ∆T = 10ns. If the inter-symbol interference (ISI) due to the diffuse link is treated as noise, the achievable rate of the LOS+diffuse link is given by [57], [58] where P 1 and P 2 denote the power without ISI and the power with ISI, respectively, Fig. 3(a) illustrates the CDF of the achievable rate R c under the assumption of the Gaussian distributed positioning error e p with M = 3 LEDs, and different maximum tolerable outage probabilities P out = 0.01, P out = 0.15 and nonrobust (P out → ∞) for only the LOS link and the LOS+diffuse link, respectively. For the nonrobust method, the outage probability with only the LOS link is about 0.5, and it is close to 1 for the LOS+diffuse case, which significantly exceeds the maximum tolerated outage probability requirement. On the other hand, the outage probability of the proposed robust power allocation in Section IV-B is close to 0, even for the LOS+diffuse case, which is well below the requirements P out = 0.01 and P out = 0.15. Fig. 3(b) depicts the same results for 6 LEDs. For the same P out and channel type, the CDF curves in Fig. 3(b) are lower than those in Fig. 3(a). In other words, the conservatism of the proposed robust scheme can be reduced slightly as the number of LEDs increases. In addition, if the other settings are the same, the achievable rate with P out = 0.01 is highest, and the rate of the nonrobust case is lowest. Thus, it leads to a higher actual rate to guarantee stricter outage probability constraint. Fig. 4 shows the case of the arbitrary positioning error distribution, and the chance constraint of the achievable rate is also satisfied. Comparing with Fig. 3, the CVaR-based scheme provides a higher communication rate than the Bernstein-based scheme for the same scenario. Thus, the CVaR-based scheme is more robust than the scheme based on the Bernstein-type inequality, because of less utilized prior information. On the other hand, the CVaR-based scheme can be applied widely in practical scenarios."
    },
    {
      "heading": "B. CRLB Versus the Rate Threshold",
      "text": "In this subsection, we show the relationship between the positioning error and the communication requirement for the nonrobust and two proposed robust schemes. The square root of the CRLB versus the achievable rate threshold r is investigated in Fig. 5(a) and Fig. 5(b) under the Gaussian and arbitrary positioning error distributed assumptions, respectively. To represent the average performance, it is assumed that there is only the LOS channel, and the UE's location estimation is the actual position, i.e., û = u. Fig. 5(a) shows the results under the Gaussian distributed assumption with M = 3, 6 LEDs, and the maximum tolerable outage probabilities are P out = 0.01, P out = 0.15 and nonrobust case. Since û = u, the nonrobust case is equivalent to the perfect positioning case. We observe that the positioning performance degrades as the minimum rate requirement increases, which means that there is a tradeoff between the communication performance and the positioning precision. When the LED number is fixed, and the rate threshold r is low enough, such as r ≤ 150Mbps, the CRLB changes slowly. However, if r is high enough, it degrades rapidly. Besides, for 198 200 202 204 206 229 230 232 0 0.2 0.4 0.6 0.8 1 // // (a) 198 200 202 204 206 208 227 228 230 232 234 0 0.2 0.4 0.6 0.8 1 // // (b) Fig. 4: CDF of the achievable rate Rc under the assumption of the arbitrary distributed positioning error ep with rate thresholds r = 200Mbps and different numbers of LEDs (a) M = 3; (b) M = 6. the same rate threshold and the LED number, stricter P out will lead to worse CRLB. On the other hand, the CRLB can be obviously reduced as the LED number increases from M = 3 to M = 6. Comparing with Fig. 5(a), Fig. 5(b) is set to the same scenario except for the distribution assumption, and there are similar trends of the CRLB versus the rate for different parameters. However, the CVaR-based scheme leads to more drastic positioning performance loss versus the rate threshold r and the outage probabilities threshold P out ."
    },
    {
      "heading": "C. Power Allocation Versus the Rate Threshold",
      "text": "To further derive the performance tradeoff between communication and positioning, the power allocation results versus the rate threshold are illustrated in Fig. 6 and Fig. 7, assuming Gaussian and arbitrary distributed positioning error, respectively. Other design parameters are the same as those in Section V-B. From Fig. 6 and Fig. 7, the allocated communication power P * c increases as the minimum rate requirement r increases, and the rate of change also increases continuously. To minimize the CRLB, the remaining power is always allocated to the positioning signals as much as possible within the constraints. For problems (25), (26), and (39), the allocated positioning power M i=1 P * p,i should satisfy min P total -P * c , M Pp . Due to the limited total power, M i=1 P * p,i will decrease as the minimum rate requirement r increases, which leads to the CRLB degradation. In addition, more power will be allocated to VLC, if a stricter outage probability constraint or a more robust power 0 30 60 90 120 150 180 210 240 270 300 330 0 10 20 30 40 50 60 70 80 90 100 200 210 220 230 240 250 260 270 280 290 300 (a) 0 30 60 90 120 150 180 210 240 270 300 330 0 10 20 30 40 50 60 70 80 90 100 200 210 220 230 240 250 260 270 280 290 300 (b) Fig. 7: Power allocation pp and Pc versus rate thresholds r under the assumption of the arbitrary distributed positioning error ep with the fixed UE's location estimation û = u, only the LOS link, and different numbers of LEDs (a) M = 3; (b) M = 6. allocation scheme is adopted. This causes the sort of achievable rates in Fig. 3 and Fig. 4. When other settings are the same, the achievable rate with P out = 0.01 is the highest, and the rate of the nonrobust case is the lowest. Meanwhile, the CVaR-based scheme provides a higher communication rate than the Bernstein-based scheme for the same scenario. This is also the reason for the variation of the CRLB, as shown in Fig. 5 with different parameters and schemes. According to ( 9), (26c) and (39b), the positioning error distribution can directly influence the distribution of the channel estimation error. Although the allocated positioning power with M = 3 LEDs approximates the power with M = 6 LEDs in both Fig. 6 and Fig. 7, the more LEDs can improve the positioning performance, as illustrated in Fig. 5. Thus, it can reduce the variance of the channel estimation error to increase the LED number. For communication, the conservatism of the robust schemes can be mitigated, as shown in Fig. 3 and Fig. 4."
    },
    {
      "heading": "D. Cumulative Distribution Functions of Positioning Errors",
      "text": "To evaluate the positioning performance loss of robust VLPC schemes, the RSS-based triangulation process was simulated with only the LOS link and the LOS+diffuse link. The location is estimated using the nonlinear least squares method. Besides, the positioning error is calculated using the root-square error (RSE). The CDFs of positioning errors are shown in Fig. 8. From both Fig. 8(a) and Fig. 8(b), two robust VLPC power allocation schemes lead to only a slight loss of positioning precision. Thus, the proposed robust power allocation schemes are also effective for VLP."
    },
    {
      "heading": "VI. CONCLUSION",
      "text": "In this work, we investigated the inherent coupling between VLP and VLC through the relationship between the optical channel and the location. In other words, channel estimation can be implemented using the positioning result. After deriving the CRLB for VLP and the achievable rate for VLC, we unveiled the tradeoff between VLP and VLC by the relationship between the channel estimation error and the positioning error. Furthermore, we proposed two robust power allocation schemes for VLPC to minimize the CRLB under the power constraints and QoS requirements, where the positioning error distributions are assumed to follow either the Gaussian distribution or an arbitrary distribution with a known mean and variance. Under the Gaussian distributed assumption, the Bernstein-type inequality is utilized to tackle the communication rate outage constraints, and the problem was converted into a stricter convex SDP by exploiting the matrix norm. For the arbitrary distributed case, the problem was approximated by a more tractable form through the worstcase CVaR and SCA based on the first-order Taylor expansion. Finally, our simulation results demonstrated the effectiveness of our two proposed robust VLPC power allocation schemes for both localization and communications. APPENDIX A DERIVATION OF THE FORMULATION (19) The derivative of the log-likelihood function Λ (u) with respect to u is given by [38] ∂Λ (u) σ 2 p i∈ M Tp 0 g i ∂g i ∂x u P p,i s 2 p,i (t) -y p,i (t) ∂g i ∂x u P p,i s p,i (t) dt, (54) ∂Λ (u) ∂y u = -1 σ 2 p i∈ M Tp 0 g i ∂g i ∂y u P p,i s 2 p,i (t) -y p,i (t) ∂g i ∂y u P p,i s p,i (t) dt, (55) where ∂gi ∂xu and ∂gi ∂yu can be expressed as Furthermore, the FIM can be denoted as an explicit function between the position power p p = [P p,1 , . . . , P p,M ] T and the unknown UE location u in the 2D plane. where the elements of (58) are given as E ∂ 2 Λ (u) ∂x u ∂x u = -i∈ M P p,i E Tp 0 s 2 p,i (t) dt ∂gi ∂xu ∂gi ∂xu σ 2 p , (59) E ∂ 2 Λ (u) ∂y u ∂y u = -i∈ M P p,i E Tp 0 s 2 p,i (t) dt ∂gi ∂yu ∂gi ∂yu σ 2 p , (60) E ∂ 2 Λ (u) ∂x u ∂y u = -i∈ M P p,i E Tp 0 s 2 p,i (t) dt ∂gi ∂yu ∂gi ∂xu σ 2 p , (61) E ∂ 2 Λ (u) ∂y u ∂x u = -i∈ M P p,i E Tp 0 s 2 p,i (t) dt ∂gi ∂xu ∂gi ∂yu σ 2 p . According to E Tp 0 s 2 p,i (t) dt = εT p for position subframe in Section II-A, (58) can be simplified to (19)."
    }
  ]
}