{
  "paperid": "2401.15317v1",
  "title": "Floorplanning of VLSI by Mixed-Variable Optimization",
  "authors": [
    "Sun",
    "Cheng",
    "Wu",
    "Zhu",
    "Chen",
    "Srinivasan",
    "Venkatesan",
    "Aljafari",
    "Yifan",
    "Zhen",
    "Jianli",
    "Jianli",
    "Wenxing",
    "Shimin",
    "Yinshui",
    "Zhufei",
    "Zou Dexuan",
    "Gai-Ge",
    "Gai",
    "Yin",
    "Xi",
    "Zhenyi",
    "Yan",
    "Pengli",
    "Kun",
    "Zhengli",
    "Lin",
    "Huang Zhipeng",
    "Xingquan",
    "Wenxing",
    "Ximeng",
    "Keyu",
    "Fuxing",
    "Huang",
    "Liu",
    "Li",
    "Yu",
    "Zhu",
    "Wenxing",
    "Jianli",
    "Zheng",
    "Zhou",
    "Sun",
    "Xu",
    "Cheng",
    "Xu",
    "Xujie",
    "Haiyan",
    "Zhao Jinjin",
    "Roy",
    "Adya",
    "Papa",
    "Zou Dexuan",
    "Guosheng",
    "Gai",
    "Jianli",
    "Wenxing"
  ],
  "year": 2024,
  "abstract": "By formulating the floorplanning of VLSI as a mixed-variable optimization problem, this paper proposes to solve it by memetic algorithms, where the discrete orientation variables are addressed by the distribution evolutionary algorithm based on a population of probability model (DEA-PPM), and the continuous coordination variables are optimized by the conjugate sub-gradient algorithm (CSA). Accordingly, the fixed-outline floorplanning algorithm based on CSA and DEA-PPM (FFA-CD) and the floorplanning algorithm with golden section strategy (FA-GSS) are proposed for the floorplanning problems with and without fixed-outline constraint. Numerical experiments on GSRC test circuits show that the proposed algorithms are superior to some celebrated B*tree based floorplanning algorithms, and are expected to be applied to large-scale floorplanning problems due to their low time complexity.",
  "sections": [
    {
      "heading": "Introduction",
      "text": "Floorplanning is a critical stage in the physical design of very large-scale integration circuit (VLSI) that determines the performance of VLSI chips to a large extent [1]. It is a complex optimization problem with multiple objectives and constraints, which makes it challenging to develop high-performance algorithms for floorplanning of VLSI [2]. Floorplanning algorithms generally fall into two categories: the floorplanning algorithm based on combinatorial optimization model (FA-COM) and the floorplanning algorithm based on analytic optimization model (FA-AOM). Representing the relative positions of macros by combinatorial coding structures such as the B*-tree, the sequential pair, etc., one can formulate the floorplanning problem as a combinatorial optimization problem, which is then addressed by metaheuristics in the FA-COMs [3,4,5,6]. The combinatorial codes representing relative positions of macros can be naturally decoded into the compact floorplans complying with the non-overlapping constraints, however, the combinatorial explosion contributes to poor performances of FA-COM on large-scale cases. Accordingly, the problem size could be reduced by clustering or partitioning strategies, which in turn makes it hard to converge to the global optimal results of the investigated large-scale floorplanning problems [7,8]. FA-AOMs address analytical floorplanning models by continuous optimization algorithms, which contributes to their lower time complexities on large-scale cases [9,10]. Since the optimization results of continuous optimization algorithms do not fulfill the non-overlapping constraints for most cases, a FA-AOM usually consists of the global floorplanning stage and the legalization stage, the first optimizing the overall evaluation index, and the second tuning the positions of macros to eliminate constraint violations of results. Li et al. [11] proposed an analytic floorplanning algorithm for large-scale floorplanning cases, where the fixedoutline global floorplanning was implemented by optimizing the electrostatic field model of global placement. In the legalization stage, horizontal constraint graphs and vertical constraint graphs were constructed to eliminate overlap of floorplanning results. Huang et al. [12] presented an improved electrostatics-based analytical method for fixed-outline floorplanning, which incorporates module rotation and sizing driven by wirelength. Since some of the evaluation indexes of global floorplanning are not smooth, additional smooth approximation to the optimization objective function could be incorporated to achieve fast convergence of gradient-based optimization algorithms. However, the approximation procedure not only introduces extra time complexity of the FA-AOM, but also leads to its local convergence to an optimal solution significantly different from that of the original non-smooth model. Accordingly, the conjugate subgradient algorithm [13] is employed in this paper to deal with the continuous variables representing coordinates of modules. Meanwhile, we address the orientation of modules by discrete variables, and formulate the floorplanning problem as a mixed-variable optimization problem. Rest of this paper is organized as follows. Section 2 introduces some preliminaries. Then, the proposed algorithms developed for floorplanning problems with and without fixed-outline constraints are presented in Sections 3 and 4, respectively. Numerical experiment is performed in Section 5 to demonstrate the competitiveness of the proposed algorithms, and Section 6 concludes this paper."
    },
    {
      "heading": "Problem Statement",
      "text": "Given a collection of rectangular modules V = {v 1 , v 2 , . . . , v n } and a set of edges (networks) E = {e 1 , e 2 , . . . , e m }, the VLSI floorplanning problem tries to minimize the total wirelength and the floorplan area by placing modules in approximate positions. Denote the center coordinates of module v i be (x i , y i ), and its orientation is represented by r i . A floorplan of VLSI is represented by the combination of vectors x, y and r, where x = (x 1 , x 2 , . . . , x n ), y = (y 1 , y 2 , . . . , y n ), r = (r 1 , r 2 , . . . , r n ). Subject to the constraint of placing non-overlaping modules with a fixed outline, the floorplanning problem is formulated as min W (x, y) where W (x, y) is the total wirelength, D(x, y, r) is the sum of overlapping area, and B(x, y, r) is the sum of width beyond the fixed outline. By the Lagrange multiplier method, it can be transformed into an unconstrained optimization model where α, λ, and µ are parameters to be confirmed. Here, the square root of D(x, y, r) is adopted to ensure that all indexes to be minimized are of the same dimension. Total Wirelength W (x, y) : The total wirelength is here taken as the total sum of half-perimeter wirelength (HWPL) Sum of Overlapping Area D(x, y, r) : The sum of overlapping area is computed by where O i,j (x, r) and O i,j (y, r) represent the overlapping lengths of modules i and j in the X-axis and Y -axis directions, respectively. Denoting ∆ x (i, j) = |x ix j |, we know where ŵi is confirmed by Denoting ∆ y (i, j) = |y iy j |, we have where ĥi is confirmed by Sum of Width beyond the Fixed Outline B(x, y, r) : For floorplanning problems with fixed-outline, the positions of modules must meet the following constraints: where W * and H * are the width and the height of square outline, respectively. Let ŵi and ĥi are confirmed by ( 6) and ( 8), respectively. Accordingly, B(x, y, r) can be confirmed by which is smoothed by Let β = 0, we get for legitimization of the global floorplanning result the optimization problem min f (x, y, r) = λ 0 D(x, y, r) + µ 0 B(x, y, r). (11)"
    },
    {
      "heading": "The Conjugate Sub-gradient Algorithm for Optimization of the Coordinate",
      "text": "Zhu et al. [13] proposed to solving the non-smooth continuous optimization model of the global placement by the conjugate sub-gradient algorithm (CSA). With an initial solution u 0 , the pseudo code of CSA is presented in Algorithm 1. Because the CSA is not necessarily gradient-descendant, the step size has a significant influence on its convergence performance. The step size is determined by the norm of the conjugate directions together with the control parameter s k , which is updated as As an initial study, we set q = 0.997 in this paper. The termination-condition 1 is satisfied if k is greater than a given budget k max or several consecutive iterations fails to get a better solution."
    },
    {
      "heading": "The Distribution Evolutionary Algorithm for Optimization of the Orientation",
      "text": "Besides the coordinate vectors x and y, the floorplan is also confirmed by the orientation vectors r. The orientation of modules is confirmed by clockwise rotation, and we set r i = j if the rotation angle is θ i = jπ/2, j = 0, 1, 2, 3, The, optimization of the orientation vectors contributes to a combinatorial optimization problem. The estimation of distribution algorithm (EDA) is a kind of metaheuristics that can address the combinatorial optimization problem well, but its balance between global exploration and local exploitation is a challenging issue [14]. Xu et al. [15] proposed for the graph coloring problem a distribution evolutionary algorithm based on a population of probability model (DEA-PPM), where a novel probability model and the associated orthogonal search are introduced to achieve well convergence performance on large-scale combinatorial problems. The core idea of DEA-PPM for floorplanning is to simulate the probability distribution of orientations by constructing a probability matrix where q j representing the probability that module j satisfies Then, the random initialization of q generates a distribution matrix The implementation of DEA-PPM is based on distributed population Q(t) = (q [1] , . . . , q [np] ) and solution population P (t) = (p [1] , . . . , p [np] ), which are em-ployed here for the probability distributions and instantiations of orientation, respectively. Global convergence of DEA-PPM is achieved by an orthogonal search on Q(t), and the local exploitation are implemented in both the distribution space and the solution space. 3 The Fixed-outline Floorplanning Algorithm Based on CSA and DEA-PPM"
    },
    {
      "heading": "Framework",
      "text": "In this paper, the fixed-outline floorplanning algorithm based on CSA and DEA-PPM (FFA-CD) is proposed to solve the problem of fixed-outline floorplanning, where the DEA-PPM is employed to optimize the orientations of the modules and the CSA is used to optimize the corresponding coordinates of the modules. The framework of FFA-CD is presented in Algorithm 2. It starts with initialization of the distribution and solution populations Q(0) and P (0), where P (0) consists of orientation combinations of modules. Meanwhile, the corresponding population X and Y of module coordinate is initialized by Latin hypercube sampling [16]. Combining the orientation and coordinates of modules, we get the best coordinate vectors x * and y * , as well as the corresponding orientation vector r * . Then, the while loop of DEA-PPM is implemented to update Q(t) and P (t), where the CSA is deployed in UpdateXY to get the best module coordinate. Algorithm 2: FFA-CD Input: f (x, y, r), f (x, y, r). Output: Optimal coordinate vector (x * , y * ) and orientation vector r * . 1 initialize the step control parameter s; 2 initialize Q(0) by ( 14), and generate P (0) by sampling Q(0); 3 initialize X and Y by Latin hypercube sampling; 4 let (x * , y * , p * ) = arg min f (x, y, r), x ∈ X, y ∈ Y , r ∈ P (0); set q * as the distribution q corresponding to p * ;"
    },
    {
      "heading": "Evolution of the Distribution Population",
      "text": "In order to better explore the distribution space, DEA-PPM carries out orthogonal exploration for individuals in Q(t). Algorithm 3 gives the flow of orthogonal exploration, which aims to change m worst individuals in Q by orthogonal transformation performed on c columns of a distribution matrix. Here, m is a random integer in [1, np/2] and c is a random integer in [1, n/10]. 6 randomly select c columns q ′ j l (l = 1, . . . , c) from q ′ ; 7 for l=1,. . . ,c do 8 generate a random orthogonal matrix M l ; In Algorithm 4, the intermediate distribution population Q ′ (t) is further updated to get Q(t). Given q [i] ∈ Q ′ (t), it is updated using v ′[i] and v [i] , two orientation combinations selected from P ′ and P , respectively. Columns of q [i]  are updated using either a exploitation strategy or a disturbance strategy presented as follows. The exploitation strategy: To update the j th column of q [i] , it is first renewed as where v [i] j is the j th component of v [i] . Then, an local orthogonal transformation is performed as where j . U (∆θ j ) is an orthogonal matrix given by U (∆θ j ) = cos(∆θ j )sin(∆θ j ) sin(∆θ j ) cos(∆θ j ) . Algorithm 4: j is generated by the exploitation strategy (Eqs. ( 15) and ( 16)); j is generated by the disturbance strategy (Eq. ( 17)); The disturbance strategy: In order to prevent the distribution population from premature, the disturbance strategy is performed as where"
    },
    {
      "heading": "Optimization of the Floorplan with a Fixed Outline",
      "text": "The floorplan is represented by the orientation vector r and the coordinate vectors x and y. In FFA-CD, the evolution of orientation vectors is implemented by iteration of solution population P (t), and the corresponding coordinate vectors are optimized by the function UpdateXY. Initialization of the module orientation According to the principle of DEA-PPM, the solution population P ′ (t) is obtained by sampling the distribution population Q ′ (t). To accelerate the convergence process, the sampling process is performed with inheritance as the process illustrated in Algorithm 5."
    },
    {
      "heading": "Optimization of module position",
      "text": "With the orientation of modules confirmed by the solution population, the position of the modules is optimized by Algorithm 6. For a combination of position vector (x [i] , y [i] ), the global floorplanning is first implemented by optimizing f ; then, the weights of the constraint items is increased to legalize the floorplan approach by lines 4-7, or the legalization Algorithm 5: P ′ = SampleP (Q, P ) process is implemented by lines 9-10. The legalization process based on constraint graphs [10] are implemented Graph(), which is presented in Algorithm 7. To prevent X and Y from falling into inferior local solutions, the coordinates are reinitialized if no better solution is obtained for several times. The legalization of Algorithm 7 is implemented as follows. Let (x ′ i , y ′ i ) be the lower-left coordinate of block v i . v i is to the left of v j if it holds Denote I i and J i as the left-module set and the lower-module set of module i, respectively. Then, the x-and y-coordinates of module i are updated by 4 The Floorplanning Algorithm Based on the Golden Section Strategy While the analytical optimization method is applied to the floorplanning problem without fixed-outline, it is a challenging task to minimize the floorplan area. In Algorithm 6: (P (t), X, Y , s) = U pdateXY (P ′ (t), X, Y , s) Input: X, Y , s; Output: X, Y , s; this paper, we proposed a floorplanning algorithm based on the golden section strategy (FA-GSS), where minimization of the floorplan area is achieved by consecutively narrowing the contour of fixed outline. Minimization of the floorplan area S(x, y, r) is equivalent to minimizing the blank ratio where A is the sum of areas of all modules. As presented in Algorithm 8, we use the golden section strategy to continuously reduce the area of the fixed contour. Given the initial white rate γ max and γ min , where the fixed-outline floorplanning is feasible for γ max but infeasible for γ min , we set If a legal layout can be obtained for γ m , then γ max =γ m ; otherwise, we set γ min =γ m . Repeat the section process until γ maxγ min < ǫ."
    },
    {
      "heading": "Experimental Results and Analysis",
      "text": "To verify the performance of the proposed algorithm, we conducted experiments on the well-known test benchmark GSRC. For all test circuits, the I/O pads are fixed at the given coordinates, and the modules of all circuits are hard modules. All experiments are developed in C++ programming language program, and run in Microsoft Windows 10 on a laptop equipped with the AMD Ryzen 7 5800H @ 3.2GHz and 16GB system memory. Algorithm 7: (x * , y * ) = Graph(x, y) Input: (x, y); Output: (x * , y * ); 1 Sorting all modules according to the x-coordinates of the bottom-left corner and denote them as {v1, v2, . . . , vn}; 2 for i ← 1 to n do 3 update x ′ i and x * according to formula (18); 4 end 5 Sorting all modules according to the y-coordinates of the bottom-left corner and denote them as {v1, v2, . . . , vn}; 6 for i ← 1 to n do 7 update y ′ i and y * according to formula (19); 8 end"
    },
    {
      "heading": "Wirelength Optimization with Fixed-outline Constraints",
      "text": "We first test the performance of FFA-CD on the fixed-outline cases. It is compared with the well-known open source layout planner Parquet-4.5 [17], where the floorplan is represented by the B*-tree and the simulated annealing algorithm to solve the combinatorial optimization model of floorplanning. According to the given aspect ratio R, the width W * and height H * of the fixed contour are calculated as [18] where A is the summed area of all modules, and γ is the white rate defined in (20). The experiment set the white rate as γ = 15%, the aspect ratio R as 1, 1.5, 2, and the population number as 5. For different aspect ratios, each experiment was independently run 10 times, and the results were shown in Table 1. Numerical results demonstrate that FFA-CD outperforms Parquet-4.5 on cases with more than 50 modules, but runs a bit slow for some of the small cases, which is attributed to the compact floorplan of Parquet-4.5. The combinatorial floorplan implemented by Parquet-4.5 could lead to smaller HPWL and shorter runtime, but its performance would degrade significantly while the problem size increases. The iteration mechanism based on CSA ensures that FFA-CD can explore the floorplan space more efficiently. At the same time, DEA-PPM is introduced to explore the rotation strategy, which increases the flexibility of the floorplan and greatly improves the success rate of small-scale problems. Consequently, the success rate of FF-CD was better than or equal to Parquet-4.5 for all cases. Meanwhile, better results on wirelength and tuntime is obtained in several different aspect ratios for the larger-scale cases (n50-n100)."
    },
    {
      "heading": "Minimization of Wirelength and Area without Fixed-outline Constraints",
      "text": "For layout planning problems without fixed contour constraints, FA-GSS is used to optimize the wirelength and area. The proposed FA-GSS is compared with Algorithm 8: FA-GSS Input: f (x, y, r), f (x, y), r. Output: Optimal solution (x * , y * ) and corresponding rotation strategy r * . 1 initialize Q(0) according to formula (7), and sample to generate P (0); 2 initialize X and Y , step control parameter s; 3 set the best solution in P (0) is p * , the corresponding distribution matrix is q * , and the module coordinates are (x * , y * ); 4 λ0 ← 1, µ0 ← 10, kmax ← 50, t ← 1; 5 initialize the maximum whitespace ratio γmax and minimum whitespace ratio γ min ; 6 while γmax -γ min < ǫ do Let's take the best solution for the current X, Y , and call it x ′ , y ′ ; 18 γmax=γm; 19 else 20 γ min =γm; 21 end 22 end Parquet-4.5 and the Hybrid Simulated Annealing Algorithm (HSA) [19], where the population size is set as 5, and we get ǫ = 0.2%. Due to the different magnitude of wirelength and area, the cost function to minimized for the floorplanning problem without fixed outline is taken as where W min and S min are the minimum values of W and A, respectively. The results in Table 1 show that all examples obtain better wirelength and shorter time when the aspect ratio is 1. So, we take R = 1 in FA-GSS for all test cases. For benchmarks in GSRC, the average Cost, and runtime (CPU) of ten independent runs are collected in Table 2. The experimental results show that FA-GSS outperforms both Parquet-4.5 and HAS except for the n30 case. Although FA-GSS runs a bit slower than Parquet-4.5 when they are tested by the n30 case, FA-GSS has the smallest rate of increase in run time as the module size increases. This means that FA-GSS is expected to achieve excellent results on larger circuits."
    },
    {
      "heading": "Conclusion",
      "text": "In this paper, we formulate the flooplanning problem of VLSI as a mixed-variable optimization problem, where the discrete variables represent module orientations and the coordinates of modules are incorporated by continuous variables. Then, the DEA-PPM is introduced to get the module orientation, and coordinate variables are optimized by the CSA. Experimental results show that the proposed FFA-CD and FA-GSS, respectively developed for floorplanning problems with and without fixed-outline, can generally outperforms the floorplanning algorithms designed based on the B*-tree and the simulated annealing. Attributed to their low time complexity, the proposed algorithms are expected to address large-scale floorplanning problems effectively."
    }
  ]
}